{"Topic 1": ["Listen up folks, and downvote as you wish, it makes no difference to reality.\r\n\r\nAvian flu has been in the US and culling flocks since March 2022. You've seen shortages.  There have been very few empty shelves, I saw a few at Thanksgiving, but usually you can buy eggs all through this avian flu.\r\n\r\nColorado passed a law which made any eggs not cage free illegal.  Had to go off the shelves and  probably disposed of.  That is 80% of all commercial eggs in the US.  Now the shelves are empty.\r\n\r\nAvian flu or the new law?  If you can't figure that out, I can't help you.", "Why are you so angry about your ignorance?\r\n\r\nColorado: Kills 85% of it's egg laying birds because of avian flu.\r\n\r\n/u/Stolimike: It's the law that went into effect *6 days ago* that is causing all of this!!", "Avian flu +  new law banning non cage free eggs = panic buying.", "Highly Pathenogenic Avian Flu has caused culling of chicken populations. Covered here several times already.", "Yes, this is the big affecting factor: Highly Pathenogenic Avian Flu (HPAI), carried by water birds (geese, etc.) and highly contagious &amp; deadly amongst domestic fowl and raptors, as well as some other birds.", "Who’s angry?  My initial comment that people got all sensitive about was that it was the avian flu AND the new law.  That means both are the problem. It’s economics, but people take that to be evil capitalism or something and get all upset.", "The cage-free egg law went into effect, plus lots of birds were recently culled to prevent spread of avian flu so the supply chain is slow and people are buying more than they probably realistically need in anticipation of shortages, which of course results in localized shortages.", "Around 80% of Colorado poultry has died from bird flu. Birds who get it have almost 100% death rate and wild birds are spreading it to the poultry farms. Source: my gf who is a vet is dealing with this and working with farmers", "Bird flu + free range Colorado law that went into effect 1/1/2023 = $9 pack of 18 eggs", "Between the bird flu requiring farmers to cull huge numbers of birds to prevent its spread and the new law that went into effect January 1st mandating that all eggs come from cage free hens there’s a bottleneck in supply and there’s also been some panic buying which means prices spike.", "They died of bird flu according to the cashier at my local king Soopers.", "Technically still died because of bird flu.", "This is awful. The goose could have died from the bird flu. My heart aches for all of our beautiful raptors.\r\n\r\nEdit: you should reach out to the city and let them know. Hopefully someone will come collect and test the goose for Bird Flu. https://www.coloradoan.com/story/news/2023/01/11/fort-collins-sheldon-lake-dead-geese-succum-avian-flu-colorado/69796120007/#", "(Somewhat off-topic, sorry): HPAI (Highly Pathenogenic Avian Influenza) is really scary. Besides domestic fowl, it's affecting our raptor population and is carried by waterfowl. We pretty much don't know how to save birds that get it, so while there have been a few rescued wild birds that have survived, the vast majority just die. It's depressing to wildlife rescuers, as well, who are used to being able to at least do something for injured and ill animals and are now faced with animals that are either DOA or die soon after arrival and at the same time endanger other rescued birds. I'm surprised it's not bigger news.", "Bird Flu has also been going around.", "I personally blame the bird flu, and also the new caged law", "That's backwards - because our Front Range landscape is limited in sources of water (and associated vegetation), birds of all kinds congregate closely in riparian zones. \r\n\r\nGo sit in the woods next to a reservoir or the Arkansas or South Platte. Songbirds and gulls and fowl are all occupying the same areas.\r\n\r\nNot arguing other points about avian flu, just that one.", "The way the USDA handles avian flu is when one animal tests positive for it the entire flock has to be killed immediately. \r\n\r\nLots of farmers lost all of their ducks, chickens, and turkeys at the same time. \r\n\r\nSeems a little dumb to me…. How are birds supposed to become immune to avian flu if even the ones who survive the flu or build an immunity get killed with all the rest.", "I don't know how long it takes to replace them. They must be shipped in but, with the avian flu hitting all around the IS I don't know if they're shipping birds.", "Not *normally* a biohazard. And with the avian flu, hitting it with a rotary brush to get it off the sidewalk isn’t going to make it disappear, it’s just going to stir it up and spread it around. But as long as it’s off the sidewalk I guess  ¯\\\\_(ツ)_/¯", "I see you've stated it's the bird flu, which I heard about and forgot until you brought up in other comments.  Do you think there isn't any impact of the law, like it's too early for all that and this is entirely contributed to nationwide bird flu?", "It's nationwide. Bird flu screwing up the supply.", "Bird flu is an Illuminati deep state ploy to jack up egg prices! It's all detailed in Hilary's emails and on Hunter Bidens laptop! Wake up sheeple! /s", "Ssshhh!!! It’s the libs fault that they passed a policy that requires all eggs to be labeled as cage free without actual enforcement and the policy gives them a whole sq foot to roam and that’s more than enough space and the bird flu is jst a hoax spread by hunter bidens laptop!!! I need the outrage!!! /s", "Asking about eggs led me to the knowledge of the avian flu spreading through chickens like wild fire. So if my quest for legit information came from something a bit unconventional, it's still a win. \r\n\r\nBut please Mr. Know It All, judge me more for not knowing something."], "Topic 2": ["It’s not a conspiracy when people panic and buy a ton of a product because they can’t handle the notion of not having it on demand for like one breakfast. Look what happens to milk and eggs and bread any time there’s ever supposed to be a storm that will make roads bad for a day or two. It’s not like there’s ever really a shortage of those items in those instances; people just lose their minds and feel compelled to suddenly alter their purchasing patterns from normal which causes the shelves to empty since the supply chain doesn’t respond to that sort of fluctuation in demand well. \r\n\r\nI have no doubt that bird flu and other sickness has reduced availability of eggs in the immediate short term by some fraction. But I don’t think it’s anywhere near as extreme as the empty shelves would suggest simply due to demand. I bet a ton of households that ordinarily buy one or two dozen eggs per week saw the signs and heard the fear mongers talking about how the cage-free legislation was going to impact prices and availability and immediately went goblin mode and bought 2-3x as many eggs as usual. Because that’s what people always do when they perceive or expect scarcity.", "&gt; I have no doubt that bird flu and other sickness has reduced availability of eggs in the immediate short term by some fraction.\r\n\r\nIf by some fraction, you mean a really large one, like 7/8ths, then yes.\r\n\r\n&gt; Avian flu has killed off 85% of Colorado’s egg-laying hens\r\n\r\nhttps://coloradosun.com/2022/11/22/eggs-cost-prices-avian-flu-bird-inflation/", "It's the lack of regulation that exacerbated that avian bird flu situation.  The fact that the cage free law (in CO) took effect in the new year is merely correlation, not causation.  The egg crisis started months before the new CO law took effect and egg prices are up over 50% nationwide, including states with no such laws.", "These are specific inconveniences not the beginning of a nationwide meltdown and capitalism/free market economy is already working its magic with southwest. \r\n\r\nWhere’s your scrutiny of the regulation that exacerbated the avian bird flu situation? Could it have been written in a more logical way or rolled out more efficiently?\r\n\r\nJust another redditor spinning something to fit their narrative.", "Seems theres dozens of dead geese at pretty much every lake right now. I was at Belmar Park the other day and counted at least 20. Its definitely bird flu related, this is probably the worst epidemic of bird flu the US has ever had.", "It’s not just bird flu. This new law is making eggs more expensive (1 sq. ft. of space per hen): https://leg.colorado.gov/bills/hb20-1343#:~:text=Requires%2C%20by%20January%201%2C%202025,access%20to%20vertical%20space%3B%20or\r\nThe additional stipulations taking effect in 2025 will increase prices further.", "Avian Flu is **extremely rare** to be detected in any sort of North American songbird/backyard bird. How rare? It has been observed twice. Ever.\r\n\r\n\r\n\r\n* A single Cooper’s Hawk reported in Wisconsin. \r\n\r\n\r\n* A single Blue Jay in Nova Scotia tested positive.\r\n\r\n\r\n\r\n* *Maybe* a crow to really stretch it. Not confirmed. \r\n\r\n\r\n\r\nThe role of songbirds in avian flu is just a big scientific gap. No one really knows for *absolute certain*. Surveillance isn't huge, and that's because we know they aren't a major factor. Right now there is no evidence to suggest songbirds play any real role in the spread of avian flu.\r\n\r\n\r\nAs of this week there have been [5 detected cases of avian flu in Colorado.](https://www.usgs.gov/centers/nwhc/science/avian-influenza-surveillance?qt-science_center_objects=0#qt-science_center_objectsOne) 1 backyard chicken flock, and 4 wild water fowl.\r\n\r\n\r\n\r\n[Here](https://www.birdwatchingdaily.com/news/conservation/avian-flu-infects-at-least-34-north-american-bird-species/) is every known North American bird species (34) that can be infected / carry Avian flu strains. \r\n\r\n\r\n\r\n* Don't go messing around with dead birds. Especially waterfowl. \r\n\r\n\r\n* Got backyard chickens, turkey, geese, ducks, quail? Probably best not to put out a bird feeder. That seems very reasonable, just to be safe.\r\n\r\n\r\n* Otherwise, it would be quite an *extreme* decision to avoid a bird feeder all together IMO. But you should clean them once a month any way (9 parts water to 1 part bleach). Even just to avoid mold and poop build up. \r\n\r\n\r\n* But if it's going to make you feel uncomfortable, theres no harm in keeping the feeders inside this year.", "140 million chickens were culled last year due to avian flu, so yes - there will be a shortage.", "Avian flu killed hundreds of thousands of chickens. The thing is once it hits your coop, with even just one sick, you have to euthanize all of them.  So for the foreseeable future eggs are going to be expensive.", "It's actually a crazy scramble for turkeys this year. Avian flu killed a lot of the birds and many places are short on them. A lot of places are sold out of pre-order turkeys and are trying to encourage customers to buy a frozen turkey instead. If you go for a frozen turkey get it soon, because they take days to thaw!\r\n\r\n\r\n\r\nWith that said, Lucky's online ordering is still making it appear that you can reserve a turkey that is described as Free-Range and Organic. I'd give that a try because Whole Foods and Natural Grocers have been pretty well run out of their stock, although it would never hurt to check if they got a new shipment on any given day.", "At king soopers last time I was shopping the \"regular\" eggs were more expensive than the cage free. Maybe bird flu related? I have no idea. I thought it was really odd.", "Some unsolicited advice to help keep the hummingbirds safe here is a simple recipe for Hummingbird nectar which is 4 parts water to 1 part plain white sugar.  This closely mimics what they find in flowers as far as sucrose content goes.\r\n\r\nIn hot climates, recommended to change to fresh nectar daily. Sugar filled water can spoil quickly in hot temps and spoiled nectar causes the hummingbirds tongues to swell to the point they can't drink then they die.\r\n\r\nAlso, just as a heads up, there is a bird flu spreading across the east coast and a lot of areas have recommended removing bird feeders in the interim but there is conflicting reports about whether or not it is impacting song birds.  It appears to be affecting water fowl and raptors more so but wanted to mention it.", "As far as the geese it’s potentially avian flu and yes there have been cases found in bears and mountain lions. This appears to jump to mammals so keep your pets away. Obviously human cases thus far but the bird populations are getting decimated.", "[Avian flu wreaks more havoc in Colorado egg layers and wild birds | Worst-ever outbreak leads to slaughter of 6 million-plus chickens and has killed enough eagles and other raptors to raise wildlife fears](https://coloradosun.com/2023/01/09/avian-flu-colorado-birth-deaths-egg-prices/)", "Consider contacting the Colorado dept of agriculture animal health and see if they (or what agency) wants to collect them for testing. There is an outbreak this year of the Avian Influenza H5N1.\r\n\r\nSo far only a person had it in Colorado, but confirmed avian cases in neighboring states.", "People already die (rarely) from avian flu. Why it is important to never handle wild birds or even dirty bird feeders without protection.\r\n\r\nhttps://www.cdc.gov/flu/avianflu/index.htm", "Avian flu is serious", "Wait until this wave of Avian Influenza has diminshed.", "&gt; Migratory wild birds, especially waterfowls, are the natural host and reservoir of avian influenza viruses\r\n\r\nSource: https://www.woah.org/en/disease/avian-influenza/\r\n\r\nFactory farming is the cause of plenty of problems - this is not one of them. You are simply wrong in everything you’ve posted here.", "Damn... I thought geese were too mean and sassy to be suspectable to avian flu...\r\n😉\r\nSilliness aside, this is scary. Thank you for the info.", "The deadliest US avian flu epidemic is happening and you’re wondering why eggs are more expensive?", "Avian flu has been raging in the United States for the last year. It’s a big deal. Over 56 million birds have been culled. \r\n\r\nNot entirely surprised more people don’t know about it, I guess I’m just disappointed how little people know about where their food comes from. \r\n\r\nAnd tbh I find it a little obnoxious that you’re complaining about a $9 18-pack without any knowledge about the systems that are the catalyst for this epidemic, created the shortage, and make eggs so cheap to begin with. It was only a matter of time until something like this happened.", "The law changed...all eggs are now cage free...voted by the citizens. Laws change again in 2025...and that will cost more also....combined with the avian flu = large price increases.", "They’re going up in price all over the country so your premise is dumb. It’s the avian flu.", "They were exterminated because of the avian flu"], "Topic 3": ["Woodpeckers, flickers, and nuthatches are all groups notably present in avian flu death counts. The weather has been mild, and mild years have generally been less busy at the suet baskets. Our enclave of dark squirrels was driven from the area perhaps seven years ago after a rapid change over the course of three summers.", "Probably not massive, but losing local eggs makes prices go up locally as more eggs will have higher shipping costs associated.  And nationwide, over 50 million egg laying birds were culled for bird flu.  Worst year ever, beating out some bad years around 2015.  Adding that to peaking inflation, and it's just gonna be really bad for eggs for a while.  And eggs go into so many other pre-produced goods that will all also go up in price then.", "If there is an impact, I imagine it is small. Last I heard 85% of all egg laying birds in Colorado were killed due to the avian flu.", "Likely.  85% of Colorado hens have been killed off by avian flu. Not just a Colorado problem.", "I’m not sure how these studies help you? From one: \r\n\r\n&gt; If birds are housed without proof housing this practice is considered as high risk to disseminate avian influenza virus [6,23,24,25,26]. Furthermore, constant presence of wild birds or ducks attracted by the pond can contribute to the spreading of the disease.\r\n\r\nSo yeah, factory farms are around because of the demand humans have. Factory farming then spread’s disease like this faster due to issue like your studies point out. It’s almost like we should just stop, so less animals suffer", "There is an avian flu outbreak and 4.6 million chickens have been culled to prevent futher spread.", "I was feeding the birds, but with the Avian Flu outbreak I took mine down.   \r\n\r\n\r\nMost birds shouldn't need feeders this time of year, even with snow as there are already seeds and plenty of worms from what I see. Hummingbirds perhaps because of flowers I suppose?  \r\n\r\n\r\nI get so many dissapointed visitors but I also want them to not get sick. Does anyone know much about this flu? Does it kill younger birds?", "Is the avian flu an outbreak yet, or just a single case?", "Because of the avian Flu outbreak in Boulder County there are fewer chickens to sacrifice to 'Ra The Sun God'", "Because avian flu and other diseases originates from farming animals and the various practices related to eating meat. Animals are kept very closely together in very unsanitary conditions. It's a miracle that we don't have a major avian flu outbreak more often.\r\n\r\n It's widely believed in the health science community that AIDS jumped from monkeys to humans because someone ate an infected monkey.  COVID is also speculated to have jumped from animals to humans due to animal consumption.", "I do recommend taking down the bird feeder for a while with the avian flu outbreak. Unfortunately bird feeders are a huge spreader.", "There is an avian flu outbreak and millions of birds have been put down or died as a result.", "Key line:\r\n\r\n&gt; no evidence so far of person-to-person transmission for the current avian influenza virus.", "You mentioned egg prices twice and then went on a stupid rant ending on blaming rising prices on wage increases but whatever. We both agree on something because if people vote for politicans who ignore climate change and enviromental issues we might run into more issues like avian flu, greening oranges in Florida, crabs disappearing, and the plethora of enviromental shit. Imagine how much more orange juice will be when all of those trees continue to get infected.", "Depends on what you want. Wanna stop shit like the avian flu wiping out wild birds? Then just stop eating bird flesh and eggs. Wanna slow deforestation and climate change and also stop spreading zoonotic diseases in general? Stop eating all animal products. You okay with the current global situation? Continue eating animals.", "85% of Colorado's chickens have been killed off because of avian flu. This article says there isn't a shortage, just higher prices. https://coloradosun.com/2022/11/22/eggs-cost-prices-avian-flu-bird-inflation/", "why aren't people that eat meat capitalizing on this. bird flu was made up by the gubberment", "Bird flu made it so that the forces that normally kept greed in check couldn't operate as usual, for a time.  It broke the competition that capitalism relies on for efficient markets.", "Yeah I usually buy Happy Egg Co and noticed their price was lowered. I was pleasantly surprised! Especially since so many chickens are being slaughtered because of the bird flu.", "Many of them were actually slaughtered because of bird flu", "If you read the article it states that the water fowl migration helped exacerbate the avian flu in Colorado.", "There is, has to do with the Avian Flu. Colorado lost a shitload of birds in the past 3 months", "[Bird flu wiped out more than 85% of Colorado's commercial hen population](https://www.denver7.com/news/local-news/bird-flu-wipes-out-more-than-85-of-colorados-commercial-hen-population) in the last year", "I read that bird flu was found, but never saw anything saying there was any bans on anything because of it.", "Avian flu has been raging in the United States for the last year. It’s a big deal. Over 56 million birds have been culled. \r\n\r\nNot entirely surprised more people don’t know about it, I guess I’m just disappointed how little people know about where their food comes from. \r\n\r\nAnd tbh I find it a little obnoxious that you’re complaining about a $9 18-pack without any knowledge about the systems that are the catalyst for this epidemic, created the shortage, and make eggs so cheap to begin with. It was only a matter of time until something like this happened."], "Topic 4": ["Raw beef meat is certainly in the running as a potential zoonotic vector for H5N1 infection as well. \r\n\r\nI purchased these in late February (two boxes of 40 tests): \r\nhttps://www.vetassay-elab.com/p-avian_influenza_virus_h7_antigen_lateral_flow_assay_kit-178.html\r\n\r\nI used them outside of the actual package directions, so it isn't a valid survey. I still think it is interesting. I swabbed raw meat samples from 7 stores in Boulder and Longmont, including two ethnic meat suppliers in Longmont. Selections from each store included vertebral cuts (T-bone, etc). The \"ethnic\" cuts additionally included lengua (tongue of course), and machitos (intestine). \r\n\r\nThere were 17 samples in all. Control tests for each sample were done using swabs from regular Spam swabs(now is when you can laugh). \r\n\r\nResults:\r\nControls: zero positives.\r\nsamples: 3 positives for H5N1, 14 negatives\r\nZero inconclusive/failed tests.\r\n\r\nThe three positive samples were retained and re-tested, along with a random selection of three negative samples. All  three negative samples were negative again, and all three positive samples were positive again. \r\n\r\nThe positive samples were each cooked in a pan at 460-485F on one side so than a thermometer read two different temperatures: For each of the two positive vertebral samples, placed adjacent to the bone to read to medium rare (130F-135F) and medium well (150F-155F), respectively, and for the machitos sample, at the center of a ball of the sample to read at 155F.  The samples were removed form the pan onto individual chilled glass Pyrex casseroles to rest for 5 minutes, and then swabs identical or comparable to tests numbers 1 &amp; 2 for each sample were taken, along with three Spam controls (at room temp) for each. The vertebral sample cooked to 152F tested positive. The other two tests were negative. The controls were all negative. \r\n\r\nNo positive controls were available. No supplier would sell me H5N1 protein or RNA fragments to test with. And again, this test protocol was done outside of the printed label, and so the specificity and sensitivity is very much in question, or even the validity of the entire test. However, I am told that all samples were delicious after final preparation to a well done state (or broiled, in the case of the machitos). \r\n\r\nThis proves nothing, of course. The tests, when used properly (which these were not), are very likely to react with and report on H5N1 specific antigens. It just suggests that beef should be investigated as an obvious potential vector for exposure to viable H5N1 virus. The FDA is doing exactly that as I write this now, and not because I've been asking just about every email address I can find in zoonotic virology research to consider the possibility after completing this test. It was an obvious direction for any researcher to go. \r\n\r\nhttps://www.cnn.com/2024/04/29/health/usda-beef-bird-flu/index.html\r\n\r\nGround beef (used in the government testing) generally contains a much higher level of nervous tissue that might be  associated with certain viral pathogens. I'm glad they are doing this for H5N1. It is unlikely they will report on any of the other viral antigen loads in the samples since RT-PCR is exceptionally target sensitive. \r\n\r\nAs for H5N1 in milk, zero viral plaque forming units (PFU's) have, to date, been found from raw or pasteurized milk samples (in other words, the RNA was there but no detectable potentially viable viral particles). There are few cases where the association with raw milk consumption is strongly suspected in humans, but there are some. In previous studies, PCR fragments from a large variety of viruses has always been present, and are now joined by H5N1, again with zero PFU results in pasteurized samples, and very few in raw samples. \r\n\r\nIt is still very easy to pasteurize milk if you are a small producer. It takes us about five minutes to get it going before starting dinner, five minutes to end in  a pail of water to chill after reaching 161F after getting ready to eat dinner, and almost nothing to clean up. That's enough for a few days to a week. \r\nOur milk is still warm from the udders before pasteurization in general, and it goes into the fridge immediately after processing. If equipment is spotlessly clean (and it should be), and animals are healthy, there is no way even for pathogenic bacteria to become a problem. But in the real world, things happen, and people get seriously sick occasionally and unnecessarily. It's not worth it in my opinion, given how easy pasteurization is.", "Not anymore. Prices are increased due to scarcity (bird flu) while at the same time a new Colorado law has gone into effect requiring all eggs sold to be cage free. Hence from now on eggs are going to be much more expensive here. Even after the bird flu is done.", "Wrong. The bird flu started this, but the new law is making it worse", "The year is 2025. I look up from my Twitter feed where President Musk has just announced that he has unanimously dissolved the Senate, to the customer across the counter from me. \r\n\r\n\"Lemme get 2 loosies,\" he asks from behind the N98 mask he foolishly hopes will protect him from the now-dominant Zulu strain of Covid-23.\r\n\r\nI eye him for a tell that might reveal if he was a tax agent. Too sloppy around the edges to be a Fed, definitely, but he could be a Fundo Revenue pig... maybe. Well, fuck it anyway, paying double tax to two governments has been killing profit margins for too long now, a man's gotta make a living any way he can these days.\r\n\r\n\"5 for 4 if you want,\" I offer as I take the man's Doge Central Bank fob from his shaking hands.\r\n\r\n\"Just the 2\" he answers, and I charge his account 2 Bitcoin. If i had misjudged him &amp; he was a pig afterall, I was looking at 5-15 years for tax fraud. And that's if he's a Fed. The Fundos were a bit less transparent about their sentencing guidelines, and i wasn't willing to find out just what they looked like. I laced my left index finger through the trigger guard of the sawed-off Remington 870 I started keeping under the counter after the first — &amp; last — time i got shaken down. With my right hand, I slide aside the false door in the wall below the cigarettes where I keep all of the untaxed &amp; hot merchandise. I pull 2 eggs from their carton &amp; slip them into a paper bag.\r\n\r\nImmediately after he walks out, i lock the door behind him &amp; light a smoke, inhale hard. I don't know how much longer i can keep going on like this. Ever since the avian flu wiped out 99.7% of the world's chicken population, there was good money to be made in the retail sale of duck &amp; goose eggs, if you could get your hands on them... But between the pigs always looking for a bribe or an arrest on the one hand, and these desperate bakers looking to score that sweet yolk by any means necessary , i couldn't help but feel that I'd gotten over easy for a good while already, and it was only a matter of time until i got poached by some pig or scrambled by some breakfast fiend...", "Yes. Bird Flu. Further complicated by the fact that Colorado law now requires all eggs sold to be cage free.", "… less risk. A bunch of comments on hear saying avian flu spread due to factory farming and we should not do it. More avian flu will spread in the alternative so it’s not a great metric to support cage free .. although as you mention there are potential ethical benefits", "Over this winter? Probably almost all bird populations went down due to the avian bird flu. The dead geese at City Park really stacked up.", "Wrong. Bird flu started the price increases, but this new law is driving them higher", "King soopers at multiple locations and target by me do not have eggs. It’s due to avian bird flu. I’ve been able to get egg beaters at least the last few times", "Avian flu and new Colorado law requiring all eggs sold in grocery stores and produced on Colorado farms be cage-free. First one is unavoidable, but the second is a head scratcher. Cage-free was always an option but now it and its cost is being forced on consumers.", "Well at least on the bird flu front, all four cases including this one so far have been dairy workers who are in close contact with cows, not people who got sick from milk (pasteurization is actually pretty rad for preventing things like that). It would be a lot more likely, and *is* a valid concern, that those dairy workers could spread a bird flu strain that's jumped to humans to other people in their outside lives - but at that point, your milk consumption (or lack thereof) is pretty irrelevant!", "It's a shame to see so many people chastising others for buying or drinking raw milk, which I assume is based in fear due to the spreading Bird Flu panic. At the end of the day, it's a personal choice. Raw milk is said to contain vital energies and living enzymes, which some believe nourishes body and soul.", "Oftentimes wildlife centers do not have the ability to go out and rescue all the animals that need help. Rescuers often catch many different types of animals, and while there is always a danger, there are ways to do it carefully and while being aware of the risks. HPAI is transmissible to humans, but as others have said, the current risk of that is very low. For the limited amount of time you would be exposed to the goose, it is recommended to wear a mask, gloves and eye protection, and then change your clothes and clean your shoes if you’re going to be interacting with any other birds.\r\nGeese are constantly being brought in to wildlife centers, and even more so this winter, and the rate of transmissions to humans hasn’t increased due to that.", "It already has jumped species - we’re seeing it in many different types of birds (mostly waterfowl, raptors, corvids and poultry so far). But you’re right that other birds of prey could be picking them apart and are then susceptible to getting HPAI", "Avian flu is actually pretty stupid.  Like ... yes, it is very contagious but birds don't necessarily die from it.  And it doesn't pass to humans unless you slaughter the bird and you somehow inhale the blood.  So ... as a chicken mom, the avian flu thing is just soooo overblown.  Some people were saying last year to cull backyard flocks if a chicken so much as sneezed which is a ridiculous overreaction.\r\n\r\nETA: The flu doesn't pass through eggs.", "Yeah the avian flu thing seems to be the main driver of shortage and price surges.", "As the ex-wife of a pricing strategist/transfer pricing expert? Don't be naive. Of course they're fattening their wallets.\r\n\r\nI'm not saying avian flu isn't affecting supply, but we'd be suckers not to realize they have nerds with spreadsheets figuring out how they can use this to pad their bottom lines right now.", "Aren't they still not advised as they spread bird flu?", "&gt;\tregulation has a cost\r\n\r\nConsidering that this regulation has the potential to limit the spread of bird flu, it’s conceivable that the cost of this regulation could be negative. Econ speak for the win", "If the poultry was given 3 ft of space and fresh water everyday the avian flu spread would be completely managed. This was recommended and very effective where implemented. ", "Ok, maybe I could have said that more clearly. The new Colorado law exacerbates the national avian flu problem in Colorado. The flu is a big problem for us but the law makes it even worse.", "Interesting take. Yes, avian flu is nationwide. If a producer in Colorado, where about 1.5 billion eggs per year are produces, still has birds alive and eggs available but not in accordance with the new Colorado law, those eggs can’t be sold here. I’d say that the local law would exacerbate the national problem, no?", "Is there a single case, like in the entire world, of a person catching H5N1 from drinking raw milk?", "Not illegal but also not recommended currently due to risk of spreading bird flu. Help keep egg prices down by keeping your feeders in for now! \r\n[May Bird Flu map](https://www.aphis.usda.gov/animal_health/animal_diseases/avian/images/hpai-wild-birds-map.png)", "Not sure where the majority of our eggs come from, but both Iowa and Nebraska had millions of chickens killed to prevent the spread of bird flu."], "Topic 5": ["This was [discussed here three days ago](https://www.reddit.com/r/Denver/comments/101uv59/egg_shortage_anyone_else_having_trouble_locating/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf). \r\n\r\nThe answer is bird flu combined with Colorado’s new law to sell only cage free eggs.\r\n\r\n\r\nhttps://www.reddit.com/r/Denver/comments/104wn00/seriously_what_is_going_on_with_eggs_i_bought_a/j37tvga/", "This was [discussed here three days ago](https://www.reddit.com/r/Denver/comments/101uv59/egg_shortage_anyone_else_having_trouble_locating/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf). \r\n\r\nThe answer is bird flu combined with Colorado’s new law to sell only cage free eggs.", "So my friends who always got the duck benedict breakfast from Choice City were lamenting duck went way up in price due to avian flu and the pandemic, which means most restaurants took it off their menus to stay profitable. \r\n\r\nI do know that Beijing Noodle has the green onion pancakes you're looking for. They don't have Peking duck, but they do have a roasted dark meat chicken dish. \r\n\r\n[Menu](https://www.beijingnoodlecolorado.com/menu/)", "When over 50 million egg laying chickens were culled in the US in the past year because of bird flu outbreaks, prices go up.", "Appreciate the thoughtful response! I used deaths as a metric because I was comparing to deaths from lightning strikes, and I couldn't find stats for injuries.\r\n\r\nThe threat of pandemics does change the stakes, and as dairy can be a vector for H5N1, I think it would be prudent to stay away from raw milk until we have a better sense for the risks associated with that virus. As with most contagions, risk multiplies in factory farms (with tens of thousands of animals in close proximity, and weakened immune systems from poor living conditions). Small operations tend to be more resilient in those regards, but I would still want my milk tested on a regular basis.\r\n\r\nCulture-wise, I see this more as an establishment vs. anti-establishment issue, but as Trump-era Republicans have begun to cast themselves as the anti-establishment party, it makes sense that they would fold this into their rhetoric. The parallels between COVID are obvious, but there's room for nuance in both cases.", "Farmers throughout the Midwest killed around 40 million egg laying chickens bc of avian flu back in October. I don’t know how soon they will start hatching hens again, but it’ll take some time for the market to recover from that disease. It takes about 5 months from hatching for a hen to be mature enough to lay eggs. So, it could be as early as spring before we see relief but maybe not until the end of summer for the market to come back.", "It's so weird how so many people don't read other people's comments. These eagles are now exposed to avian bird flu. So many people don't even know this is an issue.", "I think \"price gouging\" from a legal perspective requires a disaster or state of emergency declaration, and only covers specific goods and services (not sure eggs would count). The price increase is really just a supply and demand sort of thing in a free market. Egg producers are short on supply due to avian flu outbreaks so they can't provide as much as they would like to. How do they decide who gets the eggs they do have? Whoever is willing to pay the most, so the producers don't lose as much money. The grocery stores want to make sure they have some amount of eggs on hand, to prevent customers from heading to a competitor store this week for groceries in which case they lose out on the customer's money for milk, bread, meat, cereal, pasta, etc. Buuutttt, they're not exactly willing to take a loss on the price of eggs. The exception to that is the stores that are somehow keeping egg prices below $4.00, or providing a digital coupon every once in awhile. Those stores are likely taking a loss on eggs to try to attract customers from a competitor.", "I grew up in a town of chicken farms and the farmers are definitely reporting having to put down a ton of layers this year due to avian flu. Eggslands Best lost almost all of theirs. It should get a little better with time, and you might find that right now private labels are cheaper than store brand. I do know there are a lot of fb groups for locals with chickens who sell their excess eggs, it’s usually about $5/dozen", "There's an avian bird flu. I have backyard chickens and I wanted to enter some of my rare breeds in the stock show but they have canceled all bird related activities because of the flu. Local poultry swaps have also been canceled. Also chickens don't lay as many eggs and colder weather.  If you Google some news about the avian bird flu you might find some things on how they have to euthanize millions of chickens recently. Ba Gurk\r\n\r\nhttps://www.npr.org/2022/12/02/1140076426/what-we-know-about-the-deadliest-u-s-bird-flu-outbreak-in-history", "While there is a shortage due to avian flu, retails adjusted for that more or less months ago. the reason you can't find them today in this area is because of the new Colorado law mandating cage free eggs. So the vast majority of supermarket eggs are not allowed causing a shortage of all eggs.\r\n\r\nBut don't worry, they'll be back.  And when they are you can pay more for them, put them in your re-usable bag or pay the $.10 for a bag.  Don't worry though, you'll be making at least $13.65/hour.", "They found bird flu in a backyard farm a few weeks ago so they suspended sales of all farm eggs until they could be sure it didn’t spread", "A week or so ago Costco didn’t have any. I’ve heard it’s because of the avian flu, like they have going on in England. Although I also saw a few reports from farmers in England say, the avian flu was not the real reason for egg shortages there. They said the real reason was the grocery stores did not want to pay the farmers for there increase in egg production cost, even though the grocery stores were charging more for eggs. The farmers said they couldn’t sell their eggs to the grocery stores at a loss. Who knows maybe same thing here?", "They'll stop raising prices when people stop paying for it.\r\n\r\nWe've been dealing with record inflation &amp; record profits since COVID. Which means there is price gouging in here somewhere. It may not be the store, it may be their suppliers, LLs, etc and they have no choice but to increase prices. IDK in this case but it's typically something that employees usually have some insight about. Ask them if you're in &amp; it's not too busy.\r\n\r\nAlso, we've recently culled a lot of chickens in the state for bird flu. Suppliers may have raised egg prices quite a bit like what Kroger did a few years ago with the egg shortage. Price to consumers went way up but price paid to the egg farmers stayed the same", "Prices are going up due to a mixture of the new law that people are mentioning and devastation of the chicken flock in CO due to avian flu. Apparently over 80% of the chicken population had to be culled to try to stop the spread.", "Chickens were culled due to an avian flu", "That's not why there is a shortage. It's because birds are dying en mass due to the avian flu.", "In the Midwest they asked us to keep feeders down due to the avian flu. Nothing out there, yet?", "I don't know about the salt that's been a thing since I've been in CO ( 1989)\r\n\r\nSo far as plowing goes due to avian flu they are out of chickens to sacrifice to the Sun God", "YES, worker at Target told me it's due to Avian flu and delayed deliveries.  I bought the egg whites in a carton and there are substitutes for baking and vegan products that resemble eggs.", "Avian flu and they have yo be cage free eggs starting on Jan 1. I would shocked if the stores are going to let their supply of normal eggs run out.\r\n\r\nI doubt the prices are going to go down", "I’ve been buying cage free eggs at Costco for years. Before the Avian Flu, two dozen cost $5.99.", "Avian Bird Flu", "The have until 2025 to be in compliance.  Egg prices are high due to avian flu.  It’s now spreading east so expect these prices throughout the rest of the year.", "140 million chickens were culled last year due to avian flu, so yes - there will be a shortage."], "Topic 6": ["There are many articles about mycoplasmal conjunctivitis, a bacterial eye disease that infects mainly house finches (and, rarely, other birds in the finch family) and is also called \"house finch eye disease\". Completely unrelated to bird flu. House finch eye disease is thought to spread when the birds congregate around feeders. As others have written, cleaning your feeders every two weeks with a mild disinfectant like 50% white vinegar / 50% water is recommended.\r\n\r\narticle with photos of infected house finches: [https://feederwatch.org/learn/house-finch-eye-disease/](https://feederwatch.org/learn/house-finch-eye-disease/)", "So far there have been no reported cases in dogs or cats. And Boulder County has less than 5 cases of bird flu reported/found. So continue to be alert if you have pets that might interact with wildlife. If you have an indoor/outdoor cat, it is probably hunting birds. Control dogs out on walks, lots of goose poop out there. \r\n\r\nThis is the guideline from CPW about reporting dead wild birds:\r\n\r\n\"Dead wild birds: If you find three or more dead wild birds in a specific area within a two week period OR if you see live birds showing clinical signs of disease, please contact your local Colorado Parks and Wildlife office.\"\r\n\r\nhttps://ag.colorado.gov/animals/reportable-diseases/avian-influenza\r\n\r\nhttps://cpw.state.co.us/learn/Pages/Avian-Influenza.aspx", "Part of the concern is that flu is a weird fucking virus and if you co-infect with two strains of flu at once, they can swap parts of their genome to create a new flu. So current HPAI is not easily transmissible between humans, but if someone catches it from, say, working at a chicken farm, or handling a wild carcass as a good samaritan trying to clean up, and either already has or shortly after catches the standard seasonal flu shit can get real fucky, REAL quick.\r\n\r\nIt's known as antigenic shift, it's rare but it's what caused the swine flu outbreak in humans back in 2009. [https://en.wikipedia.org/wiki/Antigenic\\_shift](https://en.wikipedia.org/wiki/Antigenic_shift)\r\n\r\nThat's part of why there's concern and why eyes are on it even though the risk of infecting humans is low, and the risk of spread human-to-human is even lower. If you see a dead bird, do not handle it, call it in. Low is not zero. Denver's asking you to call 'em in to **311**. You can call Colorado Parks and Wildlife in other areas.", "If a pandemic happens within the next couple decades I have a terrible feeling the human response will be less energetic than it was for Covid. Atleast for general populations…unless it’s bird flu. Hard to call it a hoax when a third of the people you know are dying", "We live near a pond in Parker and there was a goose that got out of the boundary fence and couldn't get back in. It was waddling around for like 2 days around the fence and just dropped dead out of nowhere a couple days ago. Had 2 more doing the same thing the other day and when we called animal control, they said there was avian flu starting to spread so that might be why that happened", "I like horses and all, but feral horses are literally an invasive and destructive species in North America. Every year, their population increases by 25%, or \r\ndoubles every four years. I say we need to actually properly cull these horses, not keep them in pens where they give each other a deadly virus. \r\n\r\nI mean, in the last decade alone, we’ve seen the swine flu, avian flu, and the coronavirus (which originally came from bats, then in the middle of 2020 there was a mink scare in Europe). If we just let a virus mutate among thousands of feral horses in BLM pens, there’s a real possibility we’ll have the “equine flu” pandemic too. \r\n\r\nIt’s irresponsible to just let these horses stay where they are. They need to be adopted out, and the rest need to be euthanized. Maybe we should allow hunters to take out feral horses in the same way they’re allowed to take out Eurasian Collard Doves and European Starlings. Sorry, but it’s the truth…", "You seem to be putting words in my mouth. \r\n\r\nI have no problem with the industry not knowing about prions in advance. That's understandable: feeding cows mammalian proteins didn't have a harm that we knew of in advance, I had no objection to them doing that. Once it became clear though that mad cow was a possibility, the industry had a right to argue \"nah, lets ignore it, I'm sure its fine, cheaper hamburgers!\" but obviously the rest of society should have and did say \"absolutely not, you need to take steps to prevent mad cow tainting the food supply even if it costs more.\"\r\n\r\nUsing bedding from chickens (I gather that's what's going on here) we evidently know to be a liability for spreading bird flu and it needs to stop. I don't blame the industry for using it initially if they didn't know it could cause human deaths to make slightly more profit, that's to be expected from any industry, but now we need to force them to stop doing it and we're fools if we don't pass laws stopping it.\r\n\r\nI also have no complaint about inefficiencies leading to higher costs. I know I'm in the minority here but I do NOT think that it should be \"as cheap as possible\" if that ignores externalized costs like breaking antibiotics, spreading disease, and making the climate permanently unstable.\r\n\r\nSaving five dollars off hamburgers at those ignored costs is not worth it to me. I'd much rather the meat industry do it safely (for the rest of the world) or not at all.\r\n\r\nAgain, that's on us, not the industry, to regulate it. We as a society are idiots if we don't pass laws banning antibiotics, the use of any and all technology to limit GHG (from livestock industries and all other industries) and implement a carbon tax as appropriate to be able to counter the effects of GHG externalized costs.\r\n\r\nThe meat and dairy industries won't do it on their own, except token gestures to get us to forget about it and think the problem is solved so they can keep maximizing profit. That's again not a complaint or criticism of those industries specifically, that is just their nature. Industries and companies are not real people with consciences.", "Pandemic 2: Bird Flu Boogaloo", "I’d guess the eagle is scavenging after that goose died of avian flu.", "Why did you think the bird died of avian flu?", "There is a citizen science/ conservation initiative for research into bird flu-- if you see a dead bird or an alive bird suspected to have bird flu please report it to CPW so the data can be collected. \r\n\r\nI worry for all the eagles/birds of prey because they already die at less-than-ideal rates but if they happen to eat a goose or pigeon that has bird flu they die too.", "I think your perception is not necessarily reality. At least not in feb 2023.\r\n\r\nAfter Covid, a lot of people went out way more than usual due to A) pent up demand and B) unusually large savings during Covid. That was late 2021 and 2022. \r\n\r\nIt’s a big part what caused inflation, massive crowds with money to blow. \r\n\r\nBut inflation is absolutely taking its toll now. Price sensitivity is kicking in [and people are adjusting their habits.](https://www.nytimes.com/2023/01/27/business/economy/consumer-spending-december.html)\r\n\r\nAnecdotally, our household is not going out as much, and being much more price conscious about where we go when we do. \r\n\r\nThese price sensitive actions, which I believe are a combination of just being fed up with price increases and constant recession-mongering, will help cool inflation further and calm everything down by end of 2023.\r\n\r\nUnless the bird flu kills us all.", "I know to keep my dog away from any animal carcass, but does anyone know if avian flu can be passed from goose to dog by ingesting goose poop?", "Is reddit the only place some of you get your news?  Notwithstanding the multiple posts on this, it seems like just being aware of your surroundings and you'd know about the avian flu situation?", "They’ll actually intermingle more without cages. It will probably increase bird flu outbreaks compared to individual cages. They’re still stuffed in a giant warehouse together in one room.", "Long term that should help mitigate bird flu outbreaks, because like all communicable diseases, close contact helps rapid spread of infection.", "I drink 1/2 gallon of skim every 2 days. I anticipate dying of bird flu and livestock antibiotics.", "It is a good end goal. It would be great if the end result of the avian flu is more business for Just Egg", "I don’t have real-time evidence, but one just has to think. Say 1000 eggs are produced a day to meet 1000 eggs of demand. The avian flu comes along and kills 90% of the hens. Now only 100 are produced. Calendar flips, and 30 of those eggs don’t comply with the new law. So only 70 eggs to meet demand or 1000. Consumers now must compete for those 70 eggs or cast a wider net and secure more eggs from further away, which should cost more.", "You write that as thought avian influenza is over... it's far from it.  Farms can re-populate all they want but one wild bird flies over and craps on the farm and the whole cycle begins again.\r\n\r\nI'd start getting used to tofu scrambles if I don't want to spend $20 for an omelette.", "All the avian flu stuff aside (valid yes, but aside), chickens usually take a break from laying eggs in the winter. We as modern humans typically don’t see the effects because the chickens are kept warehoused indoors with controlled lighting to mimic longer days. They actually do not consistently lay eggs year-round without human intervention.", "Yes but none of that applies to avian flu. You keep on dumping generic statements that, while true for other things, are 100% false for this topic.", "&gt; Migratory wild birds, especially waterfowls, are the natural host and reservoir of avian influenza viruses\r\n\r\nSource: https://www.woah.org/en/disease/avian-influenza/\r\n\r\nFactory farming is the cause of plenty of problems - this is not one of them. You are simply wrong in everything you’ve posted here.", "Wait until this wave of Avian Influenza has diminshed.", "Avian flu is serious"], "Topic 7": ["Fuck paywalls\r\n\r\n&gt;Raccoon kills eaglet in Front Range bald eagle nest that’s livestreamed via webcam\r\nEaglet that perished at Xcel Fort St. Vrain nest was six weeks old. A sibling eaglet survived, as did the parents.\r\n\r\n&gt;A six-week-old eaglet was attacked by a raccoon and killed at Xcel Energy’s Fort St. Vrain facility near Platteville on Monday, Colorado Parks and Wildlife has confirmed.\r\nThe bald eagle family has a large following because two “eagle cams” are focused on the nest around the clock. Many follow the eagles via the Fort St. Vrain Eagle Cam Facebook group.\r\nA second eaglet survived the attack, as did the mother and father. CPW said wildlife officer Mike Grooms responded to investigate 90 minutes after the attack.\r\n“The camera showed a raccoon scaling to the top of the nest tree and grabbing the older, larger of the two eaglets from the nest around 7 p.m.,” the CPW statement said. “Wildlife officer Grooms was able to collect what remained from the carcass and delivered it to CPW’s Wildlife Health Lab, where officials will submit it for testing of Highly Pathogenic Avian Influenza.”\r\nCPW noted that the nest dates back to 1993 and the camera went online in 2003.\r\n“What followers saw on Monday was a natural event,” the statement said. “Predation of eaglets is not something you often hear about. Without a webcam, such events are hard to document. The vast majority of nest failures in Colorado are attributed to weather events (such as windstorms that damage or destroy nests or nest trees), new nests/inexperienced pairs, the loss of an adult during the nesting season and potentially human-related disturbance in the immediate area.\r\n“The most likely mammalian predator of bald eagles in Colorado’s Front Range are raccoons, while avian predators include magpies, crows and ravens, hawks and owls.”\r\nMany fans of the Fort St. Vrain eagles have commented on the Facebook group page, expressing their sadness over the incident. The group has more than 4,000 members.", "More highlights from that site:\r\n\r\n“Wild bird mortalities\r\nSince approximately November 20, more than 2000 snow geese near the towns of Brush and Fort Morgan in Morgan County, have died due to an outbreak of Highly Pathogenic Avian Influenza. An additional detection in snow geese in Prowers County was confirmed on December 8, 2022. Learn more about HPAI and wild birds from Colorado Parks and Wildlife. \r\n\r\nPublic is asked not to touch any dead birds they find on public lands and do not walk on ice to retrieve any carcasses. Colorado Parks and Wildlife is aware of the large mortality events and is working on a response plan.  “", "I redacted my other comment but, also, I suppose what's stopping them? What's stopping any of these supply chains from maximizing profits. Generally curious if there's anything we could ever vote on to put a cap on food price gouging or if it already exists?\r\n\r\nI'm reading at least in one California article I found in states of emergency you can't raise anymore than 10%. Unfortunately I don't think avian flu and supply loss of eggs plus the new cage free law etc declares an emergency either way. Going to look more into the Colorado law now and get back to this.", "According to https://quickstats.nass.usda.gov/results/042D5B58-A83E-3107-8122-1534D2711534\r\n\r\nThere is 2.1M egg laying chickens in Colorado, down from 5M in March. Approx 6.3 M Chickens were culled in Colorado due to H5N1 / Avian flu. (According to SITUATION REPORT #28 - State of Colorado Response to Highly Pathogenic Avian Influenza https://drive.google.com/file/d/18yRsn1mcjD5tsnEMB2HZO7hZh-SkSoQt/view)\r\n\r\nBut I would bet local shortages have more to do with the large national holiday where everyone cooks at home...", "5.98 at Sam's per the app.\r\n\r\n\r\nAre you just price checking?\r\n\r\n\r\nAvian flu wiped out a ton of poultry, plus the new cage free only eggs in CO, etc.", "Avian flu has been around for months.  There were eggs on the shelf last week.\r\n\r\nThis is the new cage free law.", "Bird flu has been around for months.  Most retailers have adjusted.\r\n\r\nThis is the new cage free law in full effect.", "I guess you.could let them starve after the late freeze but it's not necessary.  \r\n\r\n\"Songbirds, the kind of birds you typically see at bird feeders, are less susceptible to highly pathogenic avian influenza and are unlikely to play a significant role in spreading the virus,” Golder said. \"\r\n\r\n\r\nhttps://kdvr.com/news/nationalworld-news/do-you-really-need-to-put-your-bird-feeder-away-to-stop-avian-flu/", "H5N1, not H1N5.  I'm not trying to be an obnoxious corrector, and it's probably just a typo, but I think it's worth pointing out.  A man died recently in Mexico of Influenza A novel subtype H5N2, see here:  [https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON520](https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON520)\r\n\r\nA recent update on Highly Pathogenic Avian Influenza (HPAI) A (H5N1):  [https://www.cdc.gov/bird-flu/situation-summary/index.html](https://www.cdc.gov/bird-flu/situation-summary/index.html)", "Raw milk is unsafe in general regardless of H5N1. Pasteurization exists for a reason. Raw milk carries a ton of bacteria including Salmonella, Listeria and E. Coli. Don't drink raw milk ever. \r\n\r\n  \r\nRaw milk barely has any nutritional value to begin with. Pasteurization barely results in a decrease of vitamins/ minerals because there are so few to begin with. [https://pubmed.ncbi.nlm.nih.gov/22054181/](https://pubmed.ncbi.nlm.nih.gov/22054181/)\r\n\r\nCalcium and phosphorous (which are what you actually benefit from in milk) are really heat resistant [https://pubmed.ncbi.nlm.nih.gov/27612307/](https://pubmed.ncbi.nlm.nih.gov/27612307/)\r\n\r\nIn proteins, Casein protein is heat resistant. Whey is less so, but studies conclude Pasteurization doesn't really change Whey protein levels. [https://juniperpublishers.com/jdvs/JDVS.MS.ID.555822.php](https://juniperpublishers.com/jdvs/JDVS.MS.ID.555822.php)\r\n\r\nUltra high temperatures actually result in the body being able to better process milk's proteins: [https://pubmed.ncbi.nlm.nih.gov/19022955/](https://pubmed.ncbi.nlm.nih.gov/19022955/)\r\n\r\nNo correlative link has been established between raw milk and preventing asthma and allergies. \r\n\r\nFinally on the microbial level, everyone refrigerates their milk. You harm microbial elements by refrigerating it. \r\n\r\nI will die on this hill. Never drink raw milk. I will lose my mind if I hear another person advocating for raw milk.", "Just a quick heads up that high pathogenic avian influenza has been confirmed in the Fort Collins and the surrounding region in wild bird  populations, so be extra careful about bringing untested animals into your flocks. Ducks and geese can be asymptomatic carriers but mortality in infected poultry is extremely high at around 90-100%.", "Avian flu combined with the cage free law. I wouldn't be surprised if some stores had been letting their old non cage free  supply dry up before resetting everything.", "we should care before its the humans who have to die.   \r\nthe article just as easily read. Bird Flu killing the masses.   \r\nWhats next Rich people?", "Even cage free is a pretty loose guideline that isn't as nice as it sounds in many cases. I thought stores were still impacted by bird flu killing farm stock but now I wonder if part of the slowdown is trying to reach requirements by January.", "Lots of dead geese in Loveland. Is it bird flu killing them (eight dead on a very small lake (Upper Hoffman Lake))?  Is avian flu dangerous to predators? Knowledge from any bird-type persons?", "Wings have gotten absurdly expensive, way more in proportion to everything else. I think the avian flu was partially to blame.", "I have no personal preference for whether or not people eat dairy, but just for the sake of clarity -  this article is if anything a red flag for the conditions of both the animals and employees actually living and working in factory farms, not indicating that dairy products themselves are currently unsafe for consumers; there has been no evidence whatsoever of dairy products on the market testing positive for containing Avian Flu. The 4 human cases mentioned in this article have all been dairy farm employees who got sick from close contact with infected cows (if you're arguing that those poor conditions are a reason to *boycott* dairy products, carry on - as long as we're all clear that the linked article is not saying you could get bird flu from yogurt from the store).", "Coronavirus horses are no joke either. My cousin (another cousin, the first cousin’s [the one we don’t talk about] brother) and my uncle were both infected by coronavirus horses. My uncle spent 3 months in the ICU and had to have bilateral lung replacement. My cousin, well, we don’t talk about what happened to that cousin either, may he find peace.\r\n\r\nMy uncle later said he’d rather simultaneously get bird flu AND Ebola than ever have to ride a coronavirus horse again.", "H5N1 Avian Flu perhaps? Not any way to test for it right now, but I’ve been loosely following the news and saw that cattle workers were being monitored for potential symptoms.", "I saw several dead geese while I was birding on the banks of the Platte this weekend, which is very unusual. Bird flu is no joke. We're super-fucked if this particular strain hops species.", "Seriously. Don’t let your dog near them, don’t touch it to throw it away if one dies in your yard. This bird flu is no joke, unlike all the comments in this thread.", "This is Highly Pathogenic Avian Influenza. It’s been in Eurasia for awhile, but it jumped to North America recently. We could actually watch it spread down the flyways as birds migrate. \r\n\r\nHPAI has already been transmitted between birds and humans a few times, and my understanding is that it has a pretty high mortality rate (flu is pretty dangerous in general, this one more so). The caveat there being that that’s hard to determine without many cases. However, as I’m sure you’re aware, these viruses mutate. Not only do we want to prevent anyone from getting HPAI, we really don’t want this to be a strain that’s spreading from human to human. \r\n\r\nThe biologists I know who have handled birds who have died of HPAI have worn full PPE, like suits and a mask. \r\n\r\nAll that is to say, it’s worth being aware and cautious, as we should with any infectious disease.", "They’re going up in price all over the country so your premise is dumb. It’s the avian flu.", "Avian flu is serious", "Oh yes, it is. Unfortunately it's the rural non liberals that can't keep their laying flocks healthy from the avian flu."], "Topic 8": ["#Timely Notice regarding COVID and other respiratory diseases.\r\n\r\nPlease note that as of recently (May 2022) Denver has seen a large rise in COVID cases and, anecdotally, I've known several people to have gotten a bad strain of a flu-like virus, but testing negative for covid. There is also at least one reported cases of [Avian Flu in Colorado](https://denver.cbslocal.com/2022/04/28/colorado-man-tests-positive-avian-flu/), but the risk appears to be low.\r\n\r\n**Recent Covid News:**\r\n\r\n- [Denver COVID cases rising, city changes level  - KDVR 5/13/22](https://kdvr.com/news/local/denver-covid-cases-rising-city-changes-level/)\r\n\r\n- [Colorado projects COVID hospitalizations could hit 500 by June as Denver moves to “yellow” risk level - The Denver Post 5/14/22](https://www.denverpost.com/2022/05/14/covid-colorado-hospitalizations-cases-model/)\r\n\r\nIt is recommended to avoid large crowds, wear masks, and get vaccinated to help mitigate these risk.", "#Timely Notice regarding COVID and other respiratory diseases.\r\n\r\nPlease note that as of recently (May 2022) Denver has seen a large rise in COVID cases and, anecdotally, I've known several people to have gotten a bad strain of a flu-like virus, but testing negative for covid. There is also at least one reported cases of [Avian Flu in Colorado](https://denver.cbslocal.com/2022/04/28/colorado-man-tests-positive-avian-flu/), but the risk appears to be low.\r\n\r\n**Recent Covid News:**\r\n\r\n- [What You Need to Know About Omicron 3's Rise in Colorado - Westword 5/3/22](https://www.westword.com/news/colorado-omicron-3-covid-rise-update-14004391)\r\n\r\n- [Wastewater shows new spike in COVID cases in Denver area - 9News 5/6/22](https://www.9news.com/article/news/local/next/covid-wastewater-spiking-denver-metro-area-may-2022/73-51a589d1-4da3-403e-8d39-a12ea583fc75)\r\n\r\nIt is recommended to avoid large crowds, wear masks, and get vaccinated to help mitigate these risk.", "https://raptor.umn.edu/about-us/our-research/HPAI\r\n\r\nThe Raptor Center has a good explanation on the unknowns related to avian flu and why you should take down bird feeders. \r\n\r\n\"Every day at The Raptor Center, we are seeing the impact of HPAI- as we triage and test birds like bald eagles and great horned owls that are intensely suffering from fatal neurological illness due to HPAI. With these infected birds, humane euthanasia is the only tool we have left to help them. We also know that this strain and outbreak is causing severe illness in other species  like geese, ducks, blue jays, and crows.\r\n\r\nDuring these unprecedented times, we recommend doing anything that we can to try and help our wild bird populations. Because the science is unclear on the role of songbirds in this current H5N1 outbreak, one consideration is to not encourage birds to gather together at places such as bird feeders or bird baths. These are places where things like viruses could easily be exchanged between individuals.\r\n\r\nIn areas with HPAI transmission in any avian species, consider pausing the use of bird feeders and baths for the next couple of months until the rate of virus transmission in wild birds dramatically decreases. Not only will this action help to protect those beautiful feathered creatures that visit your yard, but will also help all wild bird species that are already having it  hard this spring because of HPAI. We have it in our power to take a short term action so we are not accidentally assisting in the virus’ spread.  This outbreak won’t last forever and I, for one, am greatly looking forward to when I can safely hang my bird feeders back up!\"", "From Wild Birds Unlimited's site, as linked, for the lazy:\r\n\r\n&gt;Avian Flu has been found in a few limited cases in Corvids (Blue Jays, Magpies, Crows, and Ravens) the Corvids who have contracted Avian Flu all appear to have contracted the flu from eating other sick birds, there is no indication that those Corvids contracted it at feeders. In addition, the USDA has reported a total of 4 confirmed cases of Avian Flu in non-Corvid songbirds across the US in all of 2022, this too indicates that songbirds are not susceptible to Avian Flu and the disease is not at risk of being spread at birdfeeders.\r\n\r\n &gt;There is no need to stop watching, feeding, or attracting feeder birds to your yard because of avian flu. We do not recommend feeding or attracting waterfowl.\r\n\r\n&gt;There is no evidence humans are at risk of contracting avian flu from backyard birds or bird feeding.\r\n\r\n&gt;The backyard birds that visit our feeders appear to be significantly less susceptible and much less likely to become a source for the virus.\r\n\r\n&gt;As with any bird or animal, wild or domestic, it is always prudent to take sensible precautions after direct or indirect contact. Be careful around animal droppings or water used by birds and animals; wash your hands after contact with soap and water.\r\n\r\n&gt;It’s always a good idea to practice responsible bird feeding on a regular basis. Clean and sanitize all bird feeders, bird baths, and hardware. If you see or suspect a sick bird we recommend a 10% bleach solution (one-part bleach to nine parts water). For normal cleaning, a solution of half white vinegar and half water is a great natural option. Rinse thoroughly and allow to completely dry before refilling feeders and baths.", "It’s nationwide due to the bird flu, not the new law", "I would recommend not getting a bird feeder right now due to the bird flu that's going around (to prevent spread from bird to bird)", "It's just snow people you don't need to panic buy all the time..it's Colorado the weather changes rapidly around here.. . If is the bird flu due to chickens cages up like prisoners let those mf run free im pretty sure they will find shelter when need be.they lived a prosperous life before we came and fucked everything up", "Really? I thought they were just being isolated right now due to bird flu concern.", "Costs have gone up due to bird flu and the new free range laws that went I to effect beginning of the year.   \r\n\r\nPM if you want a good deal, I got a plug comes down from Cheyenne twice a week", "Eggs have gone up 49% but it's mostly due to a bird flu that wiped out the chicken population. I had to stop buying eggs, which were my go-to protein source most days on a tight budget.\r\n\r\nhttps://www.fox9.com/news/heres-why-eggs-prices-are-so-high", "Some locations struggled with staffing during Covid (who didn't?), and they also have had turkey shortages in recent months due to the bird flu (just means I get a French dip instead of the Kali Mist rn), but they're still my favorite spot for sandwiches in Denver.", "It’s nation wide due to bird flu decimating the population. Not much can be done except waiting. Try egg beaters or powdered egg if you can stomach it.", "This is due to a combination of the store clearing out all non-cage free eggs before the new state law goes banning them goes into effect this weekend, and the fact that colorado lost 85% of its hens earlier this year due to bird flu, and then just last week losing another million hens to infection.\r\n\r\nSo eggs might be fucked for a while in Colorado.", "The Colorado law has nothing to do with it. It’s a nationwide issue due to the bird flu", "I’m not arguing that - I’m just saying that your statement that cage free will reduce bird flu transmission is horribly misinformed.", "Bird flu is introduced into chicken flocks by migratory birds 100% of the time (ducks, geese &amp; gulls). The only way to prevent that from occurring would be to move to a 100% enclosed environment.\r\n\r\nCage free won’t do a thing to reduce bird flu occurrence or severity.", "Grab a bag and throw that fucker away, then wash the fuck out of your hands. Dont fuck around with bird flu.", "I don’t know if this is true or related, but isn’t there avian flu? I know I heard a report in early November regarding a possible turkey shortage— which is why I don’t have a clue if this is true, as I don’t recall a lack, and last I was at the store, there was still a pile of turkeys marked 50%.", "I enjoy going alone and not worrying that others are waiting on me while I watch whichever animals interest me that day. But the birds are off exhibit right now due to a bird flu that’s going around, so no Penguins which makes me sad", "Not sure where the majority of our eggs come from, but both Iowa and Nebraska had millions of chickens killed to prevent the spread of bird flu.", "[Avian flu wreaks more havoc in Colorado egg layers and wild birds | Worst-ever outbreak leads to slaughter of 6 million-plus chickens and has killed enough eagles and other raptors to raise wildlife fears](https://coloradosun.com/2023/01/09/avian-flu-colorado-birth-deaths-egg-prices/)", "The law changed...all eggs are now cage free...voted by the citizens. Laws change again in 2025...and that will cost more also....combined with the avian flu = large price increases.", "Avian flu has been raging in the United States for the last year. It’s a big deal. Over 56 million birds have been culled. \r\n\r\nNot entirely surprised more people don’t know about it, I guess I’m just disappointed how little people know about where their food comes from. \r\n\r\nAnd tbh I find it a little obnoxious that you’re complaining about a $9 18-pack without any knowledge about the systems that are the catalyst for this epidemic, created the shortage, and make eggs so cheap to begin with. It was only a matter of time until something like this happened.", "Damn... I thought geese were too mean and sassy to be suspectable to avian flu...\r\n😉\r\nSilliness aside, this is scary. Thank you for the info.", "The deadliest US avian flu epidemic is happening and you’re wondering why eggs are more expensive?"], "Topic 9": ["Why is it \"market price\"?\r\n\r\nA) avian flu requiring slaughter of millions of chickens causing price fluctuation\r\n\r\nB) shortage of poultry plant workers because so many of them died due to inhumane treatment when covid first was a thing causing price fluctuation\r\n\r\nC) all of the above", "&gt; A) avian flu requiring slaughter of millions of chickens causing price fluctuation\r\n\r\nWait until Thanksgiving comes around, eh? I've been seeing turkeys are a part of this as well.", "Avian flu is going around still (H5N1). Keep it away from pets. You can put it in a box and see if it starts improving but for a bird to not be moving/flying it's very very very sick.\r\n\r\nIf it makes it to the morning, call Colorado Parks and Wildlife at 6060 Broadway (the headquarters) and they might want to test it for Bird Flu.\r\n\r\nI had one die on me last week unfortunately too.", "“Without proof housing” means outdoor bird husbandry … IE free range and pasture. The presence of other birds and the pond is also describing a non-industrial setting.\r\n\r\nEach paper offers citations, reference to, and primary research supporting the risk of avian flu spread is lower in an industrial setting\r\n\r\nEx: \r\n\r\nSimilarly, the retail market share of free range chicken eggs has increased from 10% in 2000 to 40% in 2015 [13]. There is concern amongst poultry veterinarians and industry experts that this growing trend will increase the occurrence of diseases in the poultry industry. Wild birds are known to harbor a number of bacterial, fungal, viral and parasitic diseases that can be transmitted to poultry, and free-range production may increase the potential for diseases to transfer from wildlife to poultry when poultry will have access to the outdoors [10, 14]. Of particular concern to the Australian poultry industry is the avian influenza (AI) virus [7, 10, 15].", "You may be drawing a conclusion that isn’t exactly there. I am not sure if you are insinuating that farm bird are dying from the bird flu in such numbers because they are weak farm birds. \r\n\r\nI mean healthy chickens give good eggs, and I’m all for that.\r\n\r\nThat said, the current bird flu appears to be moving through wild birds pretty quickly, which are pretty organic all things considered. \r\n\r\n\r\nVarious state agencies are requiring mass slaughter of large amounts of chickens (millions) to try and slow or stop the outbreak from reaching wild birds so that it stops spreading. I mean it already has but that is a side point. \r\n\r\nAnyways “we” keep slaughtering millions of chickens that aren’t necessarily infected or otherwise affected. If testing shows an infection in a area generally all are killed quickly. “We” are slaughtering millions of chickens to attempt to stem the spread to wild birds and other industrial farming places. Often under orders by the state. \r\n\r\nNow you might make the argument that bird flu is more likely to start and gain significant foot hold due to factory farming. However it appears that once it gets out to wild birds, it’s still going to kill large amounts of them. So I’ll ask, which  robustness are you talking about? \r\n\r\n\r\nAlso I think you may want to check back in a month to see if your organic eggs are still unaffected, I assume you meant price wise. If not LMK.", "I'm not an ornithologist but I am a bird watcher and lover and have been reading a lot about the avian flu going around, anyone with bird feeders or baths should remove them from their yards.", "So it's the day after Christmas, there hasn't been any shipments and you expect there to be fully stock shelves when nobody hasn't been there for 24 hours let's think about this.....\r\n\r\nAlso there is an avian flu going around that's killing the chickens that are laying the eggs so maybe maybe that is why there is less eggs around and they're getting so expensive", "What? There’s avian flu going around and like 80% of our egg-laying chickens died.", "It's really not a \"secret govermenment\" thing or anything; it's the avian flu that has been going around for a few years. You know, the reason (partially, also corporate greed, but that's another discussion) eggs are so expensive. It's literally in the article.\r\nYOU may have just been trying to be funny, but some people really need to visit an agriculture center or talk to a farmer every now and again.\r\n\r\nAnimals have viruses and bacteria that can be given to pets and humans. Don't touch dead animals, especially not with your bare hands. And if you do, for pete's sake, wash them thouroughly after BEFORE you touch anything or anyone else.\r\n(Sincerely, your friendly grew up in the country/on a farm neighbor.)", "there’s a gnarly bird flu going around right now in poultry livestock. my guess is that it jumped to wild birds despite efforts to contain it. i’ve been seeing a lot of dead birds around denver too", "H5N1 has a 56% mortality rate in humans. A good vaccine exists but isn't stockpiled. They can produce about 150,000,000 doses in 6 months but need chicken eggs to grow the vaccine.\r\n\r\nThe mammals it's infected aren't necessarily intermediates that we will catch it from. But ferrets upper respiratory tracts are very similar to humans and there are a number of mustelids catching the flu from wild birds. So maybe they will be a good intermediate maybe not. Now let's say a mink farmer is around a bunch of sick tube cats and *also* has a flu strain that spreads well in humans. There's a risk of concurrent infection and a new strain popping up.\r\n\r\nThe good news is it seems like this flu and similar strains aren't very good at human to human transmission. Not that viruses aren't extremely good at finding a way. But until there's evidence of that, just stay away from birds.", "Generally speaking I am not a big fan of large agricultural animal operations, but with respect to the bird flu stuff, they have incentive to not want to test because the current way it's handled requires them to kill all the birds if any test positive, even if most of the birds aren't sick and/or would have survived, to prevent spreading. It's not necessarily the best approach, IMO. Something that could be revised and would probably help decrease the incentive not to report that kind of thing.\r\n\r\nI just read in the paper today that more than 4 million chickens in Iowa are being killed after it was detected at an egg farm.", "Not a biohazard?? What about the current bird flu epidemic, transmitted in fecal matter, devastating bird populations around the world &amp; making scary jumps to mammals?", "Even if they were used, the whole practice is super fucked up.  Chickens are the most abused animals in this planet. 9.5 billion are killed in the US each year.  They are also an enormous liability.  Bird flu has like a 50% mortality rate in humans. \r\n\r\n\r\n If we love our children, planet, and communities then it's time to stop putting meat on the table every single day.  Think 8oz a week or less. ", "That's not true. The reason most disease experts are worried about bird flu is specifically because it has a much higher mortality rate than the normal flu in humans. The main reasons it's not a huge issue right now is because there isn't any human to human transmission happening for the most part, so a relatively low number of people are catching it. If it were ever to mutate into a human transmissible disease it would be very very very bad. That's why it always makes the news. I'm not sure if we know the mortality rate for this specific version yet since it's new, previous bird flus had upwards of 50% mortality rate in known infected. That's really high. For comparison the normal flu is 2-3% mortality rate.", "You are mixing up the current bird flu strain (H5N1) with past outbreaks.  The current one sweeping the globe in birds is low severity in humans.  The CDC considers it a low risk to the public.", "Bird flu in chickens is typically spread by wild birds from facility to facility. If an outbreak happens at one site, it will still result in the culling of all the animals at that one site. Cage free isn’t really going to change that.", "First, the article says H5N1 isn't transmissible to humans. Not the same as H1N1 (swine flu) that was going around in 2009.\r\n\r\nSecond...you know there are other people in prisons besides criminals, right? Like, you know, staff?", "I get the avian flu price surge, but the **LOW PRICE** tag really irks me.", "We’ve had coyotes &amp; bobcats go after the dead geese carcasses in Louisville - might be shredded from something other than eagles. I hope the eagles stay away so they don’t get avian flu as well.", "That's true but my understanding is that economic evaluations on the cost of the new law indicated little impact on prices, especially in the first stage. We're seeing the impact of culling over 80% of the flock to try to get the avian flu issues under control.", "Super cool pic, hope the eagles don’t get the avian flu from this meal.", "Not to mention there's a massive ongoing bird flu epidemic around the world. Sick birds are easy targets for cats", "US is experiencing the worst bird flu epidemic in over a decade. Millions of chickens have to be put down and none of the meat can be used, I'm from Iowa myself and just one farm had to put down over 2.3 million chickens.", "Believe it or not, Avian Flu was catastrophic this past year (and has been getting worse for many before that)."], "Topic 10": ["&gt;Woodpeckers, flickers, and nuthatches are all groups notably present in avian flu death counts. \r\n\r\nAre you sure that nuthatches are being killed in large numbers by avian flu? That surprises me a little because nuthatches are classified as passerines or \"perching birds\", and the sites I consider most trustworthy say that passerines have not been seriously affected by the flu. (Passerines are often called songbirds, but \"perching bird\" is the more accurate definition, denoting how their [toes are arranged to grip branches](https://etc.usf.edu/clipart/72600/72658/72658_birdfeet_lg.gif).)\r\n\r\nWoodpeckers are not passerines. Most larger birds are not passerines, including \"poultry\" (chicken, turkey), waterfowl (ducks, goose, pelican), shorebirds (heron, killdeer), raptors (eagle, hawk, owl), and scavengers (buzzard, condor). Many types of non-passerine birds have suffered losses from the avian flu.\r\n\r\nHere are the pages I looked at:\r\n\r\n[https://www.cdc.gov/flu/avianflu/avian-flu-faq.htm](https://www.cdc.gov/flu/avianflu/avian-flu-faq.htm)\r\n\r\n[https://www.allaboutbirds.org/news/avian-influenza-outbreak-should-you-take-down-your-bird-feeders/](https://www.allaboutbirds.org/news/avian-influenza-outbreak-should-you-take-down-your-bird-feeders/)\r\n\r\n[https://wildlife.utah.gov/avian-influenza.html](https://wildlife.utah.gov/avian-influenza.html)", "I went to school with a guy who was the military's leading expert on zoonotic transmission of infectious disease and was in charge of developing response protocol for domestic bases in case of an outbreak. We asked him what kept him up at night, expecting it to be ebola or Dengue or some other exotic headliner. He said \"avian flu\". He said it was for one simple reason - while it has a pretty high mortality rate for that type of disease (much much higher than something like COVID or SARS) more importantly it typically has the highest mortality rate among young to young-middle-aged healthy people. He said once they started modeling scenarios with that in mind the consequences were devastating. Picture the economic fallout from 1 million COVID deaths in the US except it would be 5-20 million deaths entirely of young healthy people. So all the people who make and spend the most money, who perform all the critical infrastructure maintenance, provide all the healthcare and childcare, and provide all the law enforcement. Since the military is also mostly young healthy people he said bases would basically have to go into zombie apocalypse lockdown because if it started spreading through the enlisted population it would be an insurmountable national security risk.", "OK (mostly) sincere question, not even (just) being an ass, just genuinely trying to ask you to guide me through the energy-work logic, as someone who does personally fuck with some level of belief in those things *myself* but still thinks the raw milk stance is unbelievably stupid - \r\n\r\n\r\nwhy do you think that making the milk hot and then cooling it down again would damage the \"vital energies\" it provides to you. Would it not, if anything, \"charge\" it to go through this process where we are preparing it to be consumed, and imbuing it with that intention and purpose? \r\n\r\n\r\nYou are right that it sure *definitely* does contain \"living enzymes\" - as well living pathogens and bacteria lmao. \r\n\r\n\r\nI cannot grok why anyone would consider the potential theoretical benefits of this worth the [very real, measurable risks](https://www.fda.gov/food/buy-store-serve-safe-food/dangers-raw-milk-unpasteurized-milk-can-pose-serious-health-risk?gad_source=1&amp;gclid=CjwKCAjwmrqzBhAoEiwAXVpgotXnpoC3h-nDt1q-EdatAGZTTANfWGNXA4naX4tQ4HdclInGVKvUQxoCrH4QAvD_BwE) of catching live e.coli, salmonella, listeria, campylobacter, and even tuberculosis (and now yes, maybe also bird flu, though that's more recent and less widespread as far as we're aware at this point). Even ignoring the bird flu potential, as I do think the risks of that are poorly-understood at this time and likely overblown, regular degular e.coli and salmonella and listeria kill thousands of people every year (^from ^foodborne ^illness ^in ^general, ^not ^from ^raw ^milk ^specifically, ^to ^be ^clear). From that same linked CDC article, it's still plenty possible to get those from raw milk specifically,  though!\r\n\r\n\r\n&gt;According to the Centers for Disease Control and Prevention (CDC), from 1998 through 2018, there were 202 [localized] outbreaks linked to drinking raw milk. These outbreaks caused 2,645 illnesses and 228 hospitalizations. CDC points out that most foodborne illnesses are not a part of recognized outbreaks, and for every illness reported, many others occur.", "Probably coming from bird flu chickens… the USDA and state agencies have forced egg producers to cull millions of birds that tested positive for bird flu. Though there are regulations mandating disposal of these birds, there is a pretty high likelihood that they are taken to slaughter if infection is suspected (before an inspector order). These birds typically aren’t bred for meat and are older, so the quality of their meat is lower than meat birds. Also, processing volumes are likely much higher as farmers seek to sell birds as risk of infection increases leading to higher likelihood of mild spoilage and ineffective quality control.", "Avian Flu has been decimating laying operations\r\n\r\nThe answer is that supply is significantly reduced. I'm not sure I would go so far as to say there is a shortage per se, but the \"input\" side of the equation is impacted enough that a grocery store may be caught short if their buyer is not ahead of the game.\r\n\r\nMaybe it's at the \"pre-shortage\" stage? If things continue as they are there will be chronic outages, though I don't think we've quite crossed that watershed YET we are headed that direction.\r\n\r\nEdit: the immediate \"this week\" outage is probably a combination of things -- most notably, something like Thanksgiving converges pretty much ALL sales patterns into a single event, and it is to be expected that there would be a run on grocery stores 5-8 days later.\r\n\r\nMost of the year you might go once a week, your neighbor every 5 days, a different neighbor twice a week, etc -- the buyer at the grocery store can more or less estimate that large-scale 'average' pattern. But a bottleneck event like Thanksgiving pinches everything into one event, which is known/obvious, but the followup is also important. People will \"run out\" at more or less the same time following the holiday and need to restock...everyone at once. If the buyer at the store did not plan for THAT convergence they could be caught flat in any case and add to that a reduction in production...and you have empty shelves.\r\n\r\nAs individual's buying patterns re-establish and spread out over the next week or two the store-level averaging patterns will re-establish themselves and you should see a return to normal.\r\n\r\nThat said, prices will continue to rise regardless until this round of the flu passes but at an industry level (not the farm level) I expect the normal sequence of hatch-raise-lay for hens will continue as they have been throughout the bird pandemic and supply should be maintained.\r\n\r\nOn a related note, the fact that sunflower prices are up (see: Ukraine/Russia, drought in the US, etc) means other oil-seeds will also rise, they tend to move as a set. Peanut, Safflower, Corn, Soy, Canola, etc. (these are all important cooking/human crops even if we don't account for animal feed). A reduced harvest of one oil-seed in a given year means consumption moves to another that, hopefully, had a better harvest in a given year. With corn and soy being common ingredients in animal feed, a small adjustment in costs would be expected even without avian flu and inflation making the rounds. (Fortunately, the cost of feed v. cost of eggs is a small impact for [reasons] but it is not zero).\r\n\r\nSunflower had a 15% jump wholesale in September/October after rising steadily the last year, and is expected to jump again sometime over the next year because European distributors are reportedly sitting on inventory due to the uncertainties related to the war in Ukraine. Many American harvests were impacted by drought this year, and now with the Mississippi being at record lows shipping from the Midwest -&gt; sea ports is nearly as hampered as the shipments in Ukraine, only difference is who is to blame. Domestic shipments can be done by rail of course, but price is still impacted dramatically.", "It's a different flu, just happening in parallel.  Can look up the madness if it's important, but I don't remember them offhand\r\n\r\nEdit: the horse one is the different one,  the sick guy was working on a chicken grow, it's not unheard of for one or two cases of bird flu to jump to workers, but for now at least transmission to another human is effectively unheard of", "https://www.aphis.usda.gov/aphis/ourfocus/animalhealth/animal-disease-information/avian/avian-influenza/hpai-2022/2022-hpai-commercial-backyard-flocks\r\n\r\nTake a look at the number of meat processors that have tested positive. The bird flu testing is not taking place hourly, daily, or even monthly. Most of these facilities are inspected at most on a quarterly, pre-scheduled, basis or when enough workers report illness that an OSHA report must be filed. Bird flu has been widespread in our meat for the past 18 months.", "Geese are dying in large numbers from avian flu. I'm not sure if your bald eagle has gone full Hannibal Lecter here--but I love the visual.", "They’re constantly at city park. Last winter they were feasting on all the dead bird flu geese. Just look up.", "Did you even read the article you posted? I don’t think it says what you think it says. It talks about how due to **supply issues** the firm with the least amount of avian flu is making the most amount of money. There is absolutely nothing surprising about that. \r\n\r\nIf Walmart is willing to pay out the ass for eggs - **because of supply issues** - then that’s what people will sell eggs for. There are supply issues. This is not disputed. This has driven up the cost of eggs. That’s how it works with all assets under supply constraints. \r\n\r\nI can tell how smart and educated you are because you resort to insults. Just like Carl Sagan and Einstein.", "&gt;\tThe egg industry is scapegoating a bunch of things (like bird flu) so they can gouge the market.\r\n\r\nLol this is the most Reddit comment ever. “aCtUALlY ThErE ARE No iSsUeS WiTh sUpPly anD DeMaND tHe rEAL isSuE Is cOmPaniES hAVE JuSt nOw dIsCoVeReD GREeD”\r\n\r\nThe data says [otherwise](https://www.nytimes.com/2023/02/03/briefing/why-eggs-cost-so-much.html). “Eight years ago, about 43 million egg-laying birds died as a result of avian flu. Egg prices rose sharply then, too (as you can see in the first chart), and peaked about three months after the outbreak ended.”", "It’s gonna be like that one year when we had the bird flu and all the birds were dying by machete it’s so sad", "For decades, the animal agriculture industry operated at a long-run breakeven, some good months some bad months. Supply shocks (like bird flu) would lead to price run-ups and those windfalls were used to pad the next downturn.\r\n\r\nToday, for the most part, the industry has become so consolidated that processors can retain market power even as their prices surge, and if the market turns against them they can push worse market conditions on both their customers and suppliers.", "Many zoos rehomed their free-roam peacocks because of the huge Avian influenza outbreak back in 2015, I believe. Since then a lot of zoos re-evaluated the care for them and determined it was best to not have them. The Indian peafowl are the most common and need no conservation, so it makes sense conservation-conscious zoos would not want to house them.", "Donate it to CU's [UCM Vertebrate Collections department](https://www.colorado.edu/cumuseum/research-collections/vertebrates/donations-salvage). Not sure of the specifics of your ethical acquisition, but if you literally just found it dead and picked it up, please don't forget we're still in the midst of a very serious Avian Influenza outbreak and take extra PPE precautions, *especially* for a bird that has no obvious cause of death.\r\n\r\n(Also, while house sparrows are one of the very few species not covered under the Migratory Bird Treaty Act so you're good in this case, it is usually very illegal to collect bird remains of most kinds in the US unless you're doing something like donating them to an organization with valid permits, like above. You may already be aware of this, in which case feel free to ignore; but! For the benefit of anyone else reading who didn't already know as well)", "Avian flu is decimating birds this year, nobody should have a feeder up at all.", "#Diseases in the county\r\n\r\nhttps://bouldercounty.gov/families/disease/vector-control-program/\r\n\r\nAlso bird flu in the state.\r\n\r\nThere is no way to tell what an animal died from so assume the worst and follow protocol.", "From the article:\r\n\r\n&gt;In Colorado, there has been one case of an individual contracting avian flu from an infected bird. The case occurred in Delta County this April, when an individual came in direct contact with diseased poultry by doing culling at a commercial farm. The individual did not experience any severe symptoms, and there was no other transmission following this.\r\n\r\nI would also note that a Google News search shows other articles about this subject and it looks like the issue is with birds. It's a disaster for agriculture due to how contagious and potentially fatal this is for birds.\r\n\r\nHowever, it  does not appear to be a major issue with humans at this time--certainly not the next COVID-19, if that's what anyone has in mind.", "Cage free won’t mitigate avian flu outbreaks. It’s very slightly more space than cages but they are mostly still in big buildings and packed tightly on a big floor. They have to have at least 1sqft of space per chicken. Battery cages are way worse because they can’t move at all but a similar amount of space. Some are better than others though. It’s definitely more humane. \r\n\r\nPasture raised is where they actually have space. The eggs are noticeably different too.", "This is Highly Pathogenic Avian Influenza. It’s been in Eurasia for awhile, but it jumped to North America recently. We could actually watch it spread down the flyways as birds migrate. \r\n\r\nHPAI has already been transmitted between birds and humans a few times, and my understanding is that it has a pretty high mortality rate (flu is pretty dangerous in general, this one more so). The caveat there being that that’s hard to determine without many cases. However, as I’m sure you’re aware, these viruses mutate. Not only do we want to prevent anyone from getting HPAI, we really don’t want this to be a strain that’s spreading from human to human. \r\n\r\nThe biologists I know who have handled birds who have died of HPAI have worn full PPE, like suits and a mask. \r\n\r\nAll that is to say, it’s worth being aware and cautious, as we should with any infectious disease.", "Damn... I thought geese were too mean and sassy to be suspectable to avian flu...\r\n😉\r\nSilliness aside, this is scary. Thank you for the info.", "Avian flu is serious", "Avian flu has been raging in the United States for the last year. It’s a big deal. Over 56 million birds have been culled. \r\n\r\nNot entirely surprised more people don’t know about it, I guess I’m just disappointed how little people know about where their food comes from. \r\n\r\nAnd tbh I find it a little obnoxious that you’re complaining about a $9 18-pack without any knowledge about the systems that are the catalyst for this epidemic, created the shortage, and make eggs so cheap to begin with. It was only a matter of time until something like this happened.", "People already die (rarely) from avian flu. Why it is important to never handle wild birds or even dirty bird feeders without protection.\r\n\r\nhttps://www.cdc.gov/flu/avianflu/index.htm", "[Avian flu wreaks more havoc in Colorado egg layers and wild birds | Worst-ever outbreak leads to slaughter of 6 million-plus chickens and has killed enough eagles and other raptors to raise wildlife fears](https://coloradosun.com/2023/01/09/avian-flu-colorado-birth-deaths-egg-prices/)"]}