{"Topic 1": ["Some locations struggled with staffing during Covid (who didn't?), and they also have had turkey shortages in recent months due to the bird flu (just means I get a French dip instead of the Kali Mist rn), but they're still my favorite spot for sandwiches in Denver.", "Bird flu is an Illuminati deep state ploy to jack up egg prices! It's all detailed in Hilary's emails and on Hunter Bidens laptop! Wake up sheeple! /s", "At king soopers last time I was shopping the \"regular\" eggs were more expensive than the cage free. Maybe bird flu related? I have no idea. I thought it was really odd.", "I work at a King's, my ordering has been crazy. Several skus are out of stock or my orders get scratched. I'm ordering 3-4x what I normally do of what's available. \r\n\r\nIt's apparently bird flu affecting everyone. That's what I'm told anyway. \r\n\r\nPrices are all over the place and change every week. One week the cage free are cheaper and the next they're a dollar over the regular eggs.", "This is due to a combination of the store clearing out all non-cage free eggs before the new state law goes banning them goes into effect this weekend, and the fact that colorado lost 85% of its hens earlier this year due to bird flu, and then just last week losing another million hens to infection.\r\n\r\nSo eggs might be fucked for a while in Colorado.", "Yeah I usually buy Happy Egg Co and noticed their price was lowered. I was pleasantly surprised! Especially since so many chickens are being slaughtered because of the bird flu.", "Ssshhh!!! It’s the libs fault that they passed a policy that requires all eggs to be labeled as cage free without actual enforcement and the policy gives them a whole sq foot to roam and that’s more than enough space and the bird flu is jst a hoax spread by hunter bidens laptop!!! I need the outrage!!! /s", "It went into effect Jan 1. But the bird flu is the reason for the mass shortages.", "When over 50 million egg laying chickens were culled in the US in the past year because of bird flu outbreaks, prices go up.", "If this is anything like what's happening in Europe, there is no bird flu, it's just that price went up on eggs and the grocery companies are unwilling to pay the higher prices. \r\n\r\nThere was a reddit user that posted about it a month or so ago.", "It's the lack of regulation that exacerbated that avian bird flu situation.  The fact that the cage free law (in CO) took effect in the new year is merely correlation, not causation.  The egg crisis started months before the new CO law took effect and egg prices are up over 50% nationwide, including states with no such laws.", "Just talked to a food supply chain guy in Moab - a case of eggs was $18 last month is now $97 - bird flu", "It’s not a conspiracy when people panic and buy a ton of a product because they can’t handle the notion of not having it on demand for like one breakfast. Look what happens to milk and eggs and bread any time there’s ever supposed to be a storm that will make roads bad for a day or two. It’s not like there’s ever really a shortage of those items in those instances; people just lose their minds and feel compelled to suddenly alter their purchasing patterns from normal which causes the shelves to empty since the supply chain doesn’t respond to that sort of fluctuation in demand well. \r\n\r\nI have no doubt that bird flu and other sickness has reduced availability of eggs in the immediate short term by some fraction. But I don’t think it’s anywhere near as extreme as the empty shelves would suggest simply due to demand. I bet a ton of households that ordinarily buy one or two dozen eggs per week saw the signs and heard the fear mongers talking about how the cage-free legislation was going to impact prices and availability and immediately went goblin mode and bought 2-3x as many eggs as usual. Because that’s what people always do when they perceive or expect scarcity.", "Yes. Bird Flu. Further complicated by the fact that Colorado law now requires all eggs sold to be cage free.", "Not anymore. Prices are increased due to scarcity (bird flu) while at the same time a new Colorado law has gone into effect requiring all eggs sold to be cage free. Hence from now on eggs are going to be much more expensive here. Even after the bird flu is done.", "I haven’t seen people buying up the eggs but there is Definitely a shortage. I thought the bird flu issue was announced a couple months ago? Holidays make time go by fast but it has been at least a month. Seems like eggs are locally sourced too.", "King soopers at multiple locations and target by me do not have eggs. It’s due to avian bird flu. I’ve been able to get egg beaters at least the last few times", "I’m not arguing that - I’m just saying that your statement that cage free will reduce bird flu transmission is horribly misinformed.", "It’s nation wide due to bird flu decimating the population. Not much can be done except waiting. Try egg beaters or powdered egg if you can stomach it.", "Probably not massive, but losing local eggs makes prices go up locally as more eggs will have higher shipping costs associated.  And nationwide, over 50 million egg laying birds were culled for bird flu.  Worst year ever, beating out some bad years around 2015.  Adding that to peaking inflation, and it's just gonna be really bad for eggs for a while.  And eggs go into so many other pre-produced goods that will all also go up in price then.", "The Colorado law has nothing to do with it. It’s a nationwide issue due to the bird flu", "It’s nationwide due to the bird flu, not the new law", "I see you've stated it's the bird flu, which I heard about and forgot until you brought up in other comments.  Do you think there isn't any impact of the law, like it's too early for all that and this is entirely contributed to nationwide bird flu?", "Our state has mandated that all eggs be cage free. This is the reason that egg prices are skyrocketing faster in Colorado than other states. The bird flu plays a minor role, but the blame on this rests on our regulation happy legislature.\r\n\r\nI am personally opposed to the use of factory farming in egg production and source all my eggs from local farms that free range their chickens, but this was a move that was obviously going to increase the cost of eggs. They did it without caring how it would affect working class and low income Coloradans. The people I really feel for are those on food assistance who now have to try to balance these price increases into the already meager EBT funds they are given. It’s a shame that democrats in Colorado have largely given up on supporting the working class and instead want to implement moral mandates like a ban on plastic bags and styrofoam and this egg travesty", "&gt;\tregulation has a cost\r\n\r\nConsidering that this regulation has the potential to limit the spread of bird flu, it’s conceivable that the cost of this regulation could be negative. Econ speak for the win"], "Topic 2": ["no. bird flu.", "Bird Flu", "Couldn’t have anything to do with the bird flu", "bird flu enters the chat", "Two words: bird flu.\r\n\r\nETA: [https://coloradosun.com/2022/11/22/eggs-cost-prices-avian-flu-bird-inflation/](https://coloradosun.com/2022/11/22/eggs-cost-prices-avian-flu-bird-inflation/)", "Biden and Fauci cooked up the bird flu in China or something.", "For some odd reason I read these series of comments and an odd scene played out in my head of a German chicken farmer.\r\n\r\n\"BIRD FLU, BIRD FLU?  ZEH ARE UNCLEEEEEEAN!!!!!\"\r\n\r\nProceeds to slaughter birds with a sickle.\r\n\r\nA weird thought I wished to randomly share...", "Nothing bc bird flu", "Pandemic 2: Bird Flu Boogaloo", "Bird flu season bagock", "Bird flu and a fire", "BIRD FLU", "It's bird flu", "give it bird flu first", "Bird Flu has also been going around.", "Grab a bag and throw that fucker away, then wash the fuck out of your hands. Dont fuck around with bird flu.", "The bird flu is jumping to rodents, so there's always hope.", "It's nationwide. Fucking bird flu", "The bird flu is very bad this year unfortunately.", "Really? I thought they were just being isolated right now due to bird flu concern.", "Funny how we don't realize something is cheap until its not. Take it easy. Its bird flu that everyone ignored until now.", "It's a different flu, just happening in parallel.  Can look up the madness if it's important, but I don't remember them offhand\r\n\r\nEdit: the horse one is the different one,  the sick guy was working on a chicken grow, it's not unheard of for one or two cases of bird flu to jump to workers, but for now at least transmission to another human is effectively unheard of", "Yeah have fun being patient zero when the bird flu jumps from your flock to your family", "It's nationwide. Bird flu screwing up the supply.", "So bird flu is the one respiratory illness in the world that doesn’t spread faster in close quarters? Huh, I didn’t know that./s"], "Topic 3": ["Avian flu is serious", "Affected by avian influenza?", "gee, it might have also been the avian influenza as well ..", "Avian flu hits daily and nightly", "NOT NOW, AVIAN FLU!", "Avian flu.. it's gonna be 2 weeks to stop the spread", "Avian flu is now spreading to dogs. Contact your vet and have the dog seen if you seen flu symptoms", "Might cross check with avian flu symptoms", "They were exterminated because of the avian flu", "Wait until this wave of Avian Influenza has diminshed.", "No it’s because of avian flu", "There’s a video where someone in the industry explains whats happening and believe it or not its not the avian flu. I was quite surprised myself this https://youtu.be/XdTyrepUB90", "Is reddit the only place some of you get your news?  Notwithstanding the multiple posts on this, it seems like just being aware of your surroundings and you'd know about the avian flu situation?", "Is the avian flu an outbreak yet, or just a single case?", "Avian Bird Flu", "Believe it or not, Avian Flu was catastrophic this past year (and has been getting worse for many before that).", "Key line:\r\n\r\n&gt; no evidence so far of person-to-person transmission for the current avian influenza virus.", "Yes, I believe cars have a lot to do with this. That and the avian flu we've had pass through a few times in the last few years. Very heartbreaking when I see ones that have been hit by careless drivers.", "It's so weird how so many people don't read other people's comments. These eagles are now exposed to avian bird flu. So many people don't even know this is an issue."], "Topic 4": ["Yeah bird orgs in the area are worried about it. I volunteer with Bird Conservancy of the Rockies in their Bald Eagle Watch program and this is something all of us are monitoring in the field. The ones I've been watching were feeding on a goose carcass last week and I really hope they don't get HPAI (bird flu) from it 😞", "There is a citizen science/ conservation initiative for research into bird flu-- if you see a dead bird or an alive bird suspected to have bird flu please report it to CPW so the data can be collected. \r\n\r\nI worry for all the eagles/birds of prey because they already die at less-than-ideal rates but if they happen to eat a goose or pigeon that has bird flu they die too.", "https://raptor.umn.edu/about-us/our-research/HPAI\r\n\r\nThe Raptor Center has a good explanation on the unknowns related to avian flu and why you should take down bird feeders. \r\n\r\n\"Every day at The Raptor Center, we are seeing the impact of HPAI- as we triage and test birds like bald eagles and great horned owls that are intensely suffering from fatal neurological illness due to HPAI. With these infected birds, humane euthanasia is the only tool we have left to help them. We also know that this strain and outbreak is causing severe illness in other species  like geese, ducks, blue jays, and crows.\r\n\r\nDuring these unprecedented times, we recommend doing anything that we can to try and help our wild bird populations. Because the science is unclear on the role of songbirds in this current H5N1 outbreak, one consideration is to not encourage birds to gather together at places such as bird feeders or bird baths. These are places where things like viruses could easily be exchanged between individuals.\r\n\r\nIn areas with HPAI transmission in any avian species, consider pausing the use of bird feeders and baths for the next couple of months until the rate of virus transmission in wild birds dramatically decreases. Not only will this action help to protect those beautiful feathered creatures that visit your yard, but will also help all wild bird species that are already having it  hard this spring because of HPAI. We have it in our power to take a short term action so we are not accidentally assisting in the virus’ spread.  This outbreak won’t last forever and I, for one, am greatly looking forward to when I can safely hang my bird feeders back up!\"", "That's backwards - because our Front Range landscape is limited in sources of water (and associated vegetation), birds of all kinds congregate closely in riparian zones. \r\n\r\nGo sit in the woods next to a reservoir or the Arkansas or South Platte. Songbirds and gulls and fowl are all occupying the same areas.\r\n\r\nNot arguing other points about avian flu, just that one.", "https://www.nocowildlife.org/\r\n\r\nText noco wildlife between 9 and 5 to see if anyone is doing necropsies on dead wildlife to check for bird flu? I doubt that it’s a priority but I have seen no recent articles. I don’t know how to get in touch with Fish &amp; Wildlife.", "I found a dead red  tailed hawk in my yard a few weeks ago. Called and asked if they wanted to test it (more likely avian flu than WN for a hawk) and they said no, they were totally slammed with dead birds all over and to just dispose of it. You could see if they're interested in a jay, but I suspect not.  They have mosquito traps all over the place they monitor regularly.", "Oftentimes wildlife centers do not have the ability to go out and rescue all the animals that need help. Rescuers often catch many different types of animals, and while there is always a danger, there are ways to do it carefully and while being aware of the risks. HPAI is transmissible to humans, but as others have said, the current risk of that is very low. For the limited amount of time you would be exposed to the goose, it is recommended to wear a mask, gloves and eye protection, and then change your clothes and clean your shoes if you’re going to be interacting with any other birds.\r\nGeese are constantly being brought in to wildlife centers, and even more so this winter, and the rate of transmissions to humans hasn’t increased due to that.", "It already has jumped species - we’re seeing it in many different types of birds (mostly waterfowl, raptors, corvids and poultry so far). But you’re right that other birds of prey could be picking them apart and are then susceptible to getting HPAI", "&gt;Woodpeckers, flickers, and nuthatches are all groups notably present in avian flu death counts. \r\n\r\nAre you sure that nuthatches are being killed in large numbers by avian flu? That surprises me a little because nuthatches are classified as passerines or \"perching birds\", and the sites I consider most trustworthy say that passerines have not been seriously affected by the flu. (Passerines are often called songbirds, but \"perching bird\" is the more accurate definition, denoting how their [toes are arranged to grip branches](https://etc.usf.edu/clipart/72600/72658/72658_birdfeet_lg.gif).)\r\n\r\nWoodpeckers are not passerines. Most larger birds are not passerines, including \"poultry\" (chicken, turkey), waterfowl (ducks, goose, pelican), shorebirds (heron, killdeer), raptors (eagle, hawk, owl), and scavengers (buzzard, condor). Many types of non-passerine birds have suffered losses from the avian flu.\r\n\r\nHere are the pages I looked at:\r\n\r\n[https://www.cdc.gov/flu/avianflu/avian-flu-faq.htm](https://www.cdc.gov/flu/avianflu/avian-flu-faq.htm)\r\n\r\n[https://www.allaboutbirds.org/news/avian-influenza-outbreak-should-you-take-down-your-bird-feeders/](https://www.allaboutbirds.org/news/avian-influenza-outbreak-should-you-take-down-your-bird-feeders/)\r\n\r\n[https://wildlife.utah.gov/avian-influenza.html](https://wildlife.utah.gov/avian-influenza.html)", "Passerine susceptibility is noted in specific environments where interactions with highly susceptible species are entwined (buntings, thrushes in particular). PCR positive necropsy cases with healthy body mass in surveys do find representation from flickers and nuthatches. But more concerning is the degradation of the environment, and nuthatches are susceptible and an indicator. Species and numbers for song and other birds are down by 30% over the past 50 years. Other species displaced from other areas are moving in to displace local species and the trend will continue as greater political pressure by people for higher density (ironically because they believe it is more environmentally friendly)  to raise local pollution levels and land uses that devastate insect populations (down a measured 60% or more in the past nearly 40 years in Colorado).\r\n\r\nEventually, you'll be able to drive for an hour without so much as a bug on the windshield, and as a result, the area will be devoid of most birds. \r\n\r\nThe fired a few years ago forced a plethora of species common to the foothills to the plains, and a lot didn't make it. Then avian flu, heat waves, progressive infill, changing prairie grass and other environments, and a long list of other things. \r\n\r\nBut to answer your question, they are not as affected in general by HPAI but can be impacted when they are exposed to infected species in their habitat.", "Donate it to CU's [UCM Vertebrate Collections department](https://www.colorado.edu/cumuseum/research-collections/vertebrates/donations-salvage). Not sure of the specifics of your ethical acquisition, but if you literally just found it dead and picked it up, please don't forget we're still in the midst of a very serious Avian Influenza outbreak and take extra PPE precautions, *especially* for a bird that has no obvious cause of death.\r\n\r\n(Also, while house sparrows are one of the very few species not covered under the Migratory Bird Treaty Act so you're good in this case, it is usually very illegal to collect bird remains of most kinds in the US unless you're doing something like donating them to an organization with valid permits, like above. You may already be aware of this, in which case feel free to ignore; but! For the benefit of anyone else reading who didn't already know as well)", "Fuck paywalls\r\n\r\n&gt;Raccoon kills eaglet in Front Range bald eagle nest that’s livestreamed via webcam\r\nEaglet that perished at Xcel Fort St. Vrain nest was six weeks old. A sibling eaglet survived, as did the parents.\r\n\r\n&gt;A six-week-old eaglet was attacked by a raccoon and killed at Xcel Energy’s Fort St. Vrain facility near Platteville on Monday, Colorado Parks and Wildlife has confirmed.\r\nThe bald eagle family has a large following because two “eagle cams” are focused on the nest around the clock. Many follow the eagles via the Fort St. Vrain Eagle Cam Facebook group.\r\nA second eaglet survived the attack, as did the mother and father. CPW said wildlife officer Mike Grooms responded to investigate 90 minutes after the attack.\r\n“The camera showed a raccoon scaling to the top of the nest tree and grabbing the older, larger of the two eaglets from the nest around 7 p.m.,” the CPW statement said. “Wildlife officer Grooms was able to collect what remained from the carcass and delivered it to CPW’s Wildlife Health Lab, where officials will submit it for testing of Highly Pathogenic Avian Influenza.”\r\nCPW noted that the nest dates back to 1993 and the camera went online in 2003.\r\n“What followers saw on Monday was a natural event,” the statement said. “Predation of eaglets is not something you often hear about. Without a webcam, such events are hard to document. The vast majority of nest failures in Colorado are attributed to weather events (such as windstorms that damage or destroy nests or nest trees), new nests/inexperienced pairs, the loss of an adult during the nesting season and potentially human-related disturbance in the immediate area.\r\n“The most likely mammalian predator of bald eagles in Colorado’s Front Range are raccoons, while avian predators include magpies, crows and ravens, hawks and owls.”\r\nMany fans of the Fort St. Vrain eagles have commented on the Facebook group page, expressing their sadness over the incident. The group has more than 4,000 members.", "HPAI is also being found to transmit to dogs, so if you hunt waterfowl and use a retriever I wouldn’t hunt for the rest of the season…", "Woodpeckers, flickers, and nuthatches are all groups notably present in avian flu death counts. The weather has been mild, and mild years have generally been less busy at the suet baskets. Our enclave of dark squirrels was driven from the area perhaps seven years ago after a rapid change over the course of three summers.", "I am a wildlife rehabilitator and HPAI is devastating our local raptor populations as well. We've been admitting 1-2 cases a day for the past 3 months and it's close to 100% lethal in raptors.", "[Avian flu](https://www.steamboatpilot.com/news/expensive-eggs-avian-flu-hampers-colorado-supply-chain/)", "(Somewhat off-topic, sorry): HPAI (Highly Pathenogenic Avian Influenza) is really scary. Besides domestic fowl, it's affecting our raptor population and is carried by waterfowl. We pretty much don't know how to save birds that get it, so while there have been a few rescued wild birds that have survived, the vast majority just die. It's depressing to wildlife rescuers, as well, who are used to being able to at least do something for injured and ill animals and are now faced with animals that are either DOA or die soon after arrival and at the same time endanger other rescued birds. I'm surprised it's not bigger news.", "I think it’s been tough this year with HPAI.", "#Diseases in the county\r\n\r\nhttps://bouldercounty.gov/families/disease/vector-control-program/\r\n\r\nAlso bird flu in the state.\r\n\r\nThere is no way to tell what an animal died from so assume the worst and follow protocol."], "Topic 5": ["Bird flu has killed many geese. A Canada goose is a significant foe for a bald eagle, and it would have to be extremely hungry to go after one. It wouldn't just randomly kill a bunch of them.", "Seems theres dozens of dead geese at pretty much every lake right now. I was at Belmar Park the other day and counted at least 20. Its definitely bird flu related, this is probably the worst epidemic of bird flu the US has ever had.", "I saw several dead geese while I was birding on the banks of the Platte this weekend, which is very unusual. Bird flu is no joke. We're super-fucked if this particular strain hops species.", "So if the scavengers/predators eat the geese/birds with bird flu, what are the chances of the flu jumping to those animals?", "We’ve had coyotes &amp; bobcats go after the dead geese carcasses in Louisville - might be shredded from something other than eagles. I hope the eagles stay away so they don’t get avian flu as well.", "It’s because of the avian flu that the geese are dying. Eagles eat what they kill immediately &amp; wouldn’t leave a dead body", "Geese are dying in large numbers from avian flu. I'm not sure if your bald eagle has gone full Hannibal Lecter here--but I love the visual.", "Damn... I thought geese were too mean and sassy to be suspectable to avian flu...\r\n😉\r\nSilliness aside, this is scary. Thank you for the info.", "I was riding along the Platte River between Dartmouth and Florida a couple weeks ago, and I saw probably 15 or 20 dead geese along the riverbank. It's probably the avian flu.", "i've been occasionally seeing dead geese on ice from what i assume is bird flu. i really hope these eagles don't contract it...", "This is awful. The goose could have died from the bird flu. My heart aches for all of our beautiful raptors.\r\n\r\nEdit: you should reach out to the city and let them know. Hopefully someone will come collect and test the goose for Bird Flu. https://www.coloradoan.com/story/news/2023/01/11/fort-collins-sheldon-lake-dead-geese-succum-avian-flu-colorado/69796120007/#", "I’d guess the eagle is scavenging after that goose died of avian flu.", "If you haven't seen it recently, at any given time there's maybe 5-20 dead geese on the lake. It doesn't correlate with temperature drops and most of the corpses are intact unless scavenged so it isn't predators. I've personally called CPW maybe half a dozen times in the past couple months regarding symptomatic geese on the shore and surrounding feeding grounds, limping around in circles like they're having a stroke. They're doing the testing and other lakes in the state have massive avian flu die-offs, 1000+ geese on one reservoir: https://cpw.state.co.us/learn/Pages/Avian-Influenza.aspx", "That is one of the most frequently seen symptoms of HPAI in geese, as it seems to be affecting their neurological systems", "Over this winter? Probably almost all bird populations went down due to the avian bird flu. The dead geese at City Park really stacked up.", "They’re constantly at city park. Last winter they were feasting on all the dead bird flu geese. Just look up.", "Super cool pic, hope the eagles don’t get the avian flu from this meal.", "Lots of dead geese in Loveland. Is it bird flu killing them (eight dead on a very small lake (Upper Hoffman Lake))?  Is avian flu dangerous to predators? Knowledge from any bird-type persons?"], "Topic 6": ["It’s gonna be like that one year when we had the bird flu and all the birds were dying by machete it’s so sad", "Or.. there's an avian flu and some 60mm birds have been destroyed.\r\n https://www.aphis.usda.gov/aphis/ourfocus/animalhealth/animal-disease-information/avian/avian-influenza/hpai-2022/2022-hpai-commercial-backyard-flocks", "Technically still died because of bird flu.", "There is an avian flu outbreak and millions of birds have been put down or died as a result.", "Why did you think the bird died of avian flu?", "Avian flu = millions of dead birds.", "Happy to see fellow bird watchers here. I have never seen so few birds in my life. I am heartbroken by the devastation the Avian Flu is causing.", "They died of bird flu according to the cashier at my local king Soopers.", "Avian flu. They had to kill a bunch of birds recently", "Not a biohazard?? What about the current bird flu epidemic, transmitted in fecal matter, devastating bird populations around the world &amp; making scary jumps to mammals?", "That's not the reasons there are 0 on the shelves... that's because of the avian flu that required a huge number to be killed. \r\n\r\nI hope this isn't an avian flu that can jump to us...", "No, millions of them were killed to prevent avian flu. 85% of the CO population was killed but it's happening all over.", "Bird flu , turns out cramming a bunch of birds into small spaces is a good way to spread disease among the chickens and wild birds as well. The end is neigh", "Not to mention there's a massive ongoing bird flu epidemic around the world. Sick birds are easy targets for cats", "People already die (rarely) from avian flu. Why it is important to never handle wild birds or even dirty bird feeders without protection.\r\n\r\nhttps://www.cdc.gov/flu/avianflu/index.htm"], "Topic 7": ["I would recommend not getting a bird feeder right now due to the bird flu that's going around (to prevent spread from bird to bird)", "I know last summer they were recommending against communal bird feeders because of avian flu.  This year I'd be surprised if the recommendation was different, considering we're still going through a bad case of it in the US.", "Avian influenza is definitely still an [issue here](https://www.larimer.gov/spotlights/2023/01/24/avian-influenza-detected-larimer-county), but I’m not sure how putting feeders out factors in. It has also spread to mammals in the county (warning, potential paywall):\r\n\r\nhttps://www.coloradoan.com/story/news/2023/03/12/dead-skunks-in-larimer-county-test-positive-for-avian-flu/69996339007/#\r\n\r\nHopefully someone with a bit more knowledge on how bird feeders affect the situation can chime in.", "A lot of agencies are currently recommending putting away your bird feeders because they may help spread the current nasty strain of avian influenza.  My family pulled ours just to hopefully protect some of our feathered friends. \r\n\r\nWe still have hummingbirds visiting some of our flowers so maybe try some hummingbird friendly blooms?", "In the Midwest they asked us to keep feeders down due to the avian flu. Nothing out there, yet?", "I guess you.could let them starve after the late freeze but it's not necessary.  \r\n\r\n\"Songbirds, the kind of birds you typically see at bird feeders, are less susceptible to highly pathogenic avian influenza and are unlikely to play a significant role in spreading the virus,” Golder said. \"\r\n\r\n\r\nhttps://kdvr.com/news/nationalworld-news/do-you-really-need-to-put-your-bird-feeder-away-to-stop-avian-flu/", "I was feeding the birds, but with the Avian Flu outbreak I took mine down.   \r\n\r\n\r\nMost birds shouldn't need feeders this time of year, even with snow as there are already seeds and plenty of worms from what I see. Hummingbirds perhaps because of flowers I suppose?  \r\n\r\n\r\nI get so many dissapointed visitors but I also want them to not get sick. Does anyone know much about this flu? Does it kill younger birds?", "Some unsolicited advice to help keep the hummingbirds safe here is a simple recipe for Hummingbird nectar which is 4 parts water to 1 part plain white sugar.  This closely mimics what they find in flowers as far as sucrose content goes.\r\n\r\nIn hot climates, recommended to change to fresh nectar daily. Sugar filled water can spoil quickly in hot temps and spoiled nectar causes the hummingbirds tongues to swell to the point they can't drink then they die.\r\n\r\nAlso, just as a heads up, there is a bird flu spreading across the east coast and a lot of areas have recommended removing bird feeders in the interim but there is conflicting reports about whether or not it is impacting song birds.  It appears to be affecting water fowl and raptors more so but wanted to mention it.", "&gt; Migratory wild birds, especially waterfowls, are the natural host and reservoir of avian influenza viruses\r\n\r\nSource: https://www.woah.org/en/disease/avian-influenza/\r\n\r\nFactory farming is the cause of plenty of problems - this is not one of them. You are simply wrong in everything you’ve posted here.", "Avian flu is decimating birds this year, nobody should have a feeder up at all.", "There are many articles about mycoplasmal conjunctivitis, a bacterial eye disease that infects mainly house finches (and, rarely, other birds in the finch family) and is also called \"house finch eye disease\". Completely unrelated to bird flu. House finch eye disease is thought to spread when the birds congregate around feeders. As others have written, cleaning your feeders every two weeks with a mild disinfectant like 50% white vinegar / 50% water is recommended.\r\n\r\narticle with photos of infected house finches: [https://feederwatch.org/learn/house-finch-eye-disease/](https://feederwatch.org/learn/house-finch-eye-disease/)", "I do recommend taking down the bird feeder for a while with the avian flu outbreak. Unfortunately bird feeders are a huge spreader.", "Avian Flu is **extremely rare** to be detected in any sort of North American songbird/backyard bird. How rare? It has been observed twice. Ever.\r\n\r\n\r\n\r\n* A single Cooper’s Hawk reported in Wisconsin. \r\n\r\n\r\n* A single Blue Jay in Nova Scotia tested positive.\r\n\r\n\r\n\r\n* *Maybe* a crow to really stretch it. Not confirmed. \r\n\r\n\r\n\r\nThe role of songbirds in avian flu is just a big scientific gap. No one really knows for *absolute certain*. Surveillance isn't huge, and that's because we know they aren't a major factor. Right now there is no evidence to suggest songbirds play any real role in the spread of avian flu.\r\n\r\n\r\nAs of this week there have been [5 detected cases of avian flu in Colorado.](https://www.usgs.gov/centers/nwhc/science/avian-influenza-surveillance?qt-science_center_objects=0#qt-science_center_objectsOne) 1 backyard chicken flock, and 4 wild water fowl.\r\n\r\n\r\n\r\n[Here](https://www.birdwatchingdaily.com/news/conservation/avian-flu-infects-at-least-34-north-american-bird-species/) is every known North American bird species (34) that can be infected / carry Avian flu strains. \r\n\r\n\r\n\r\n* Don't go messing around with dead birds. Especially waterfowl. \r\n\r\n\r\n* Got backyard chickens, turkey, geese, ducks, quail? Probably best not to put out a bird feeder. That seems very reasonable, just to be safe.\r\n\r\n\r\n* Otherwise, it would be quite an *extreme* decision to avoid a bird feeder all together IMO. But you should clean them once a month any way (9 parts water to 1 part bleach). Even just to avoid mold and poop build up. \r\n\r\n\r\n* But if it's going to make you feel uncomfortable, theres no harm in keeping the feeders inside this year.", "I'm not an ornithologist but I am a bird watcher and lover and have been reading a lot about the avian flu going around, anyone with bird feeders or baths should remove them from their yards.", "From Wild Birds Unlimited's site, as linked, for the lazy:\r\n\r\n&gt;Avian Flu has been found in a few limited cases in Corvids (Blue Jays, Magpies, Crows, and Ravens) the Corvids who have contracted Avian Flu all appear to have contracted the flu from eating other sick birds, there is no indication that those Corvids contracted it at feeders. In addition, the USDA has reported a total of 4 confirmed cases of Avian Flu in non-Corvid songbirds across the US in all of 2022, this too indicates that songbirds are not susceptible to Avian Flu and the disease is not at risk of being spread at birdfeeders.\r\n\r\n &gt;There is no need to stop watching, feeding, or attracting feeder birds to your yard because of avian flu. We do not recommend feeding or attracting waterfowl.\r\n\r\n&gt;There is no evidence humans are at risk of contracting avian flu from backyard birds or bird feeding.\r\n\r\n&gt;The backyard birds that visit our feeders appear to be significantly less susceptible and much less likely to become a source for the virus.\r\n\r\n&gt;As with any bird or animal, wild or domestic, it is always prudent to take sensible precautions after direct or indirect contact. Be careful around animal droppings or water used by birds and animals; wash your hands after contact with soap and water.\r\n\r\n&gt;It’s always a good idea to practice responsible bird feeding on a regular basis. Clean and sanitize all bird feeders, bird baths, and hardware. If you see or suspect a sick bird we recommend a 10% bleach solution (one-part bleach to nine parts water). For normal cleaning, a solution of half white vinegar and half water is a great natural option. Rinse thoroughly and allow to completely dry before refilling feeders and baths."], "Topic 8": ["H5N1, not H1N5.  I'm not trying to be an obnoxious corrector, and it's probably just a typo, but I think it's worth pointing out.  A man died recently in Mexico of Influenza A novel subtype H5N2, see here:  [https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON520](https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON520)\r\n\r\nA recent update on Highly Pathogenic Avian Influenza (HPAI) A (H5N1):  [https://www.cdc.gov/bird-flu/situation-summary/index.html](https://www.cdc.gov/bird-flu/situation-summary/index.html)", "First, the article says H5N1 isn't transmissible to humans. Not the same as H1N1 (swine flu) that was going around in 2009.\r\n\r\nSecond...you know there are other people in prisons besides criminals, right? Like, you know, staff?", "H5N1 Avian Flu perhaps? Not any way to test for it right now, but I’ve been loosely following the news and saw that cattle workers were being monitored for potential symptoms.", "Anyone wanna buy some h5n1 vaxx?", "There are other things going around at the moment, just remember:  \r\n  \r\n\"It isn't H5N1 unless someone's eyeballs are bleeding!\"^(TM)", "Unlikely but not impossible. Many moons ago when I was in the Navy, I got lab-confirmed H5N1 followed by H3N2 flu within about four weeks. That was a bad month.\r\n\r\nBut OTOH, last year, I got the flu right as I was on the mend from COVID. Had I not been tested, I couldn't have told them apart - achy, feverish, snotty and sneezy with both.", "The opposite: get this person some H5N1 protein samples ", "This is nothing major. H5N1 is already known to be transmissible between birds and humans. It has been for awhile now, it’s nothing new.\r\n\r\nNow, if H5N1 evolved to be transmissible between humans?… that would be the article you should be afraid of.", "H5N1 has a 56% mortality rate in humans. A good vaccine exists but isn't stockpiled. They can produce about 150,000,000 doses in 6 months but need chicken eggs to grow the vaccine.\r\n\r\nThe mammals it's infected aren't necessarily intermediates that we will catch it from. But ferrets upper respiratory tracts are very similar to humans and there are a number of mustelids catching the flu from wild birds. So maybe they will be a good intermediate maybe not. Now let's say a mink farmer is around a bunch of sick tube cats and *also* has a flu strain that spreads well in humans. There's a risk of concurrent infection and a new strain popping up.\r\n\r\nThe good news is it seems like this flu and similar strains aren't very good at human to human transmission. Not that viruses aren't extremely good at finding a way. But until there's evidence of that, just stay away from birds.", "You are mixing up the current bird flu strain (H5N1) with past outbreaks.  The current one sweeping the globe in birds is low severity in humans.  The CDC considers it a low risk to the public.", "Be very careful handling dead birds at the moment. H5N1 is in Colorado in the birds and has killed many and you really really don’t want to get that. It is transmissible to humans from handling dead or infected birds.", "That's not true. The reason most disease experts are worried about bird flu is specifically because it has a much higher mortality rate than the normal flu in humans. The main reasons it's not a huge issue right now is because there isn't any human to human transmission happening for the most part, so a relatively low number of people are catching it. If it were ever to mutate into a human transmissible disease it would be very very very bad. That's why it always makes the news. I'm not sure if we know the mortality rate for this specific version yet since it's new, previous bird flus had upwards of 50% mortality rate in known infected. That's really high. For comparison the normal flu is 2-3% mortality rate.", "Funny you say that but there is a H5N1 vaccine for chickens but the US is choosing not to use it because we’re major poultry exporters. They think that if we start vaccinating our farm birds then other countries will stop buying our exports because they’d be afraid they could possibly carry the flu. But if we don’t vaccinate, doesn’t that risk exist currently? \r\n\r\nHere’s a podcast on it [Today Explained](https://open.spotify.com/episode/6uQVDNE643JxwcX30VcvdK?si=i8InWWnWTN-9TGKeQl4kQw)", "I went to school with a guy who was the military's leading expert on zoonotic transmission of infectious disease and was in charge of developing response protocol for domestic bases in case of an outbreak. We asked him what kept him up at night, expecting it to be ebola or Dengue or some other exotic headliner. He said \"avian flu\". He said it was for one simple reason - while it has a pretty high mortality rate for that type of disease (much much higher than something like COVID or SARS) more importantly it typically has the highest mortality rate among young to young-middle-aged healthy people. He said once they started modeling scenarios with that in mind the consequences were devastating. Picture the economic fallout from 1 million COVID deaths in the US except it would be 5-20 million deaths entirely of young healthy people. So all the people who make and spend the most money, who perform all the critical infrastructure maintenance, provide all the healthcare and childcare, and provide all the law enforcement. Since the military is also mostly young healthy people he said bases would basically have to go into zombie apocalypse lockdown because if it started spreading through the enlisted population it would be an insurmountable national security risk."], "Topic 9": ["Yes, this has been going on for literal weeks. 80% of the chickens got bird flu and had to be culled.", "140 million chickens were culled last year due to avian flu, so yes - there will be a shortage.", "Chickens were culled due to an avian flu", "Highly Pathenogenic Avian Flu has caused culling of chicken populations. Covered here several times already.", "There is an avian flu outbreak and 4.6 million chickens have been culled to prevent futher spread.", "I don't know about the salt that's been a thing since I've been in CO ( 1989)\r\n\r\nSo far as plowing goes due to avian flu they are out of chickens to sacrifice to the Sun God", "140 Million farm birds were culled because of avian flu, so chill out, guy. The ones that are left are laying as fast as they can.\r\n\r\n[link to guardian](https://www.theguardian.com/environment/2022/dec/09/avian-flu-has-led-to-the-killing-of-140m-farmed-birds-since-last-october)", "I have noticed the chicken tenders are about half the size that they were a year ago. I imagine the bird flu slaughtering has had a big impact on them over the last year.", "Lol with bird flu and all the micro plastics in the ocean no thanks! Chicken and fish are not health foods", "we can’t let them vaccinate the chickens with microchips. avian flu is derp state.", "An outbreak of avian flu. They try to control it by humanely culling chickens that have been exposed because otherwise they will almost certainly die of flu. All of this means no eggs. \r\n\r\n[Here’s](https://www.cbsnews.com/amp/colorado/news/largest-avian-flu-outbreak-us-history-killed-more-than-52-million-birds-4-7-million-colorado/#app) an article summing it up!", "of course it will. BTW after the avian flu virus hit where are these cage free chickens at?", "Gov. Polis just ordered a mass chicken slaughtering to eradicate a bird flu breakout"], "Topic 10": ["With poultry, given the commonality of wild birds being primary vector for disease, the control of battery cage environment reduces spread of avian influenza. This is reflected in the academic literature. \r\n\r\nOf course there are mitigants in either environment, but perhaps counterintuitively, the proximity of mass-produced birds / eggs does not make the spread of avian flu more likely than if the birds are cage free and exposed to more environmental factors. \r\n\r\nIn a sentence: the risk associated with close proximity in an industrial setting is outweighed by the inefficiency of biosecurity in a less controlled, or cage-free, etc. setting. \r\n\r\nhttps://www.researchgate.net/publication/298868247_Conventional_battery_cages_and_alternative_poultry_housing_systems_-_Infectiological_aspects\r\n\r\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3924483/\r\n\r\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5906091/", "I am only speaking about the efficacy of avian influenza prevention, not the ethics of industrial agriculture.\r\n\r\nOur families egg farm converted from cages to cage-free and pasture production in 2007. One of the key incremental risks associated with the conversion was higher likelihood of influenza with our birds given their increased exposure to outside, non-controlled vectors of disease.\r\n\r\nThis is the first time in my Reddit history where this part of my life has been relevant in a comment.\r\n\r\nThere are many reasons to support high animal welfare production, avian influenza mitigation is not one. At least I’ve never seen solid scientific evidence supporting that claim", "“Without proof housing” means outdoor bird husbandry … IE free range and pasture. The presence of other birds and the pond is also describing a non-industrial setting.\r\n\r\nEach paper offers citations, reference to, and primary research supporting the risk of avian flu spread is lower in an industrial setting\r\n\r\nEx: \r\n\r\nSimilarly, the retail market share of free range chicken eggs has increased from 10% in 2000 to 40% in 2015 [13]. There is concern amongst poultry veterinarians and industry experts that this growing trend will increase the occurrence of diseases in the poultry industry. Wild birds are known to harbor a number of bacterial, fungal, viral and parasitic diseases that can be transmitted to poultry, and free-range production may increase the potential for diseases to transfer from wildlife to poultry when poultry will have access to the outdoors [10, 14]. Of particular concern to the Australian poultry industry is the avian influenza (AI) virus [7, 10, 15].", "Going vegan prevents the spread of avian flu?", "… less risk. A bunch of comments on hear saying avian flu spread due to factory farming and we should not do it. More avian flu will spread in the alternative so it’s not a great metric to support cage free .. although as you mention there are potential ethical benefits", "Because avian flu and other diseases originates from farming animals and the various practices related to eating meat. Animals are kept very closely together in very unsanitary conditions. It's a miracle that we don't have a major avian flu outbreak more often.\r\n\r\n It's widely believed in the health science community that AIDS jumped from monkeys to humans because someone ate an infected monkey.  COVID is also speculated to have jumped from animals to humans due to animal consumption.", "I’m not sure how these studies help you? From one: \r\n\r\n&gt; If birds are housed without proof housing this practice is considered as high risk to disseminate avian influenza virus [6,23,24,25,26]. Furthermore, constant presence of wild birds or ducks attracted by the pond can contribute to the spreading of the disease.\r\n\r\nSo yeah, factory farms are around because of the demand humans have. Factory farming then spread’s disease like this faster due to issue like your studies point out. It’s almost like we should just stop, so less animals suffer", "Bird flu in chickens is typically spread by wild birds from facility to facility. If an outbreak happens at one site, it will still result in the culling of all the animals at that one site. Cage free isn’t really going to change that.", "Cage free won’t mitigate avian flu outbreaks. It’s very slightly more space than cages but they are mostly still in big buildings and packed tightly on a big floor. They have to have at least 1sqft of space per chicken. Battery cages are way worse because they can’t move at all but a similar amount of space. Some are better than others though. It’s definitely more humane. \r\n\r\nPasture raised is where they actually have space. The eggs are noticeably different too.", "They’ll actually intermingle more without cages. It will probably increase bird flu outbreaks compared to individual cages. They’re still stuffed in a giant warehouse together in one room.", "The way the USDA handles avian flu is when one animal tests positive for it the entire flock has to be killed immediately. \r\n\r\nLots of farmers lost all of their ducks, chickens, and turkeys at the same time. \r\n\r\nSeems a little dumb to me…. How are birds supposed to become immune to avian flu if even the ones who survive the flu or build an immunity get killed with all the rest."], "Topic 11": ["There's an avian bird flu. I have backyard chickens and I wanted to enter some of my rare breeds in the stock show but they have canceled all bird related activities because of the flu. Local poultry swaps have also been canceled. Also chickens don't lay as many eggs and colder weather.  If you Google some news about the avian bird flu you might find some things on how they have to euthanize millions of chickens recently. Ba Gurk\r\n\r\nhttps://www.npr.org/2022/12/02/1140076426/what-we-know-about-the-deadliest-u-s-bird-flu-outbreak-in-history", "Eggs are also up because avian flu forced a large industry wide kill off. Iowa probably killed more chickens than they have residents", "What? There’s avian flu going around and like 80% of our egg-laying chickens died.", "Not sure where the majority of our eggs come from, but both Iowa and Nebraska had millions of chickens killed to prevent the spread of bird flu.", "Avian flu killed hundreds of thousands of chickens. The thing is once it hits your coop, with even just one sick, you have to euthanize all of them.  So for the foreseeable future eggs are going to be expensive.", "Asking about eggs led me to the knowledge of the avian flu spreading through chickens like wild fire. So if my quest for legit information came from something a bit unconventional, it's still a win. \r\n\r\nBut please Mr. Know It All, judge me more for not knowing something.", "Farmers throughout the Midwest killed around 40 million egg laying chickens bc of avian flu back in October. I don’t know how soon they will start hatching hens again, but it’ll take some time for the market to recover from that disease. It takes about 5 months from hatching for a hen to be mature enough to lay eggs. So, it could be as early as spring before we see relief but maybe not until the end of summer for the market to come back.", "It was avian flu.   Farmers had to destroy 75% of the egg producing chickens recently.", "All the avian flu stuff aside (valid yes, but aside), chickens usually take a break from laying eggs in the winter. We as modern humans typically don’t see the effects because the chickens are kept warehoused indoors with controlled lighting to mimic longer days. They actually do not consistently lay eggs year-round without human intervention.", "We killed over 58 million birds in the USA this year. This is the worst year on record for bird flu in USA. There is a very likely chance egg farmers are hurting."], "Topic 12": ["OK (mostly) sincere question, not even (just) being an ass, just genuinely trying to ask you to guide me through the energy-work logic, as someone who does personally fuck with some level of belief in those things *myself* but still thinks the raw milk stance is unbelievably stupid - \r\n\r\n\r\nwhy do you think that making the milk hot and then cooling it down again would damage the \"vital energies\" it provides to you. Would it not, if anything, \"charge\" it to go through this process where we are preparing it to be consumed, and imbuing it with that intention and purpose? \r\n\r\n\r\nYou are right that it sure *definitely* does contain \"living enzymes\" - as well living pathogens and bacteria lmao. \r\n\r\n\r\nI cannot grok why anyone would consider the potential theoretical benefits of this worth the [very real, measurable risks](https://www.fda.gov/food/buy-store-serve-safe-food/dangers-raw-milk-unpasteurized-milk-can-pose-serious-health-risk?gad_source=1&amp;gclid=CjwKCAjwmrqzBhAoEiwAXVpgotXnpoC3h-nDt1q-EdatAGZTTANfWGNXA4naX4tQ4HdclInGVKvUQxoCrH4QAvD_BwE) of catching live e.coli, salmonella, listeria, campylobacter, and even tuberculosis (and now yes, maybe also bird flu, though that's more recent and less widespread as far as we're aware at this point). Even ignoring the bird flu potential, as I do think the risks of that are poorly-understood at this time and likely overblown, regular degular e.coli and salmonella and listeria kill thousands of people every year (^from ^foodborne ^illness ^in ^general, ^not ^from ^raw ^milk ^specifically, ^to ^be ^clear). From that same linked CDC article, it's still plenty possible to get those from raw milk specifically,  though!\r\n\r\n\r\n&gt;According to the Centers for Disease Control and Prevention (CDC), from 1998 through 2018, there were 202 [localized] outbreaks linked to drinking raw milk. These outbreaks caused 2,645 illnesses and 228 hospitalizations. CDC points out that most foodborne illnesses are not a part of recognized outbreaks, and for every illness reported, many others occur.", "Raw milk is unsafe in general regardless of H5N1. Pasteurization exists for a reason. Raw milk carries a ton of bacteria including Salmonella, Listeria and E. Coli. Don't drink raw milk ever. \r\n\r\n  \r\nRaw milk barely has any nutritional value to begin with. Pasteurization barely results in a decrease of vitamins/ minerals because there are so few to begin with. [https://pubmed.ncbi.nlm.nih.gov/22054181/](https://pubmed.ncbi.nlm.nih.gov/22054181/)\r\n\r\nCalcium and phosphorous (which are what you actually benefit from in milk) are really heat resistant [https://pubmed.ncbi.nlm.nih.gov/27612307/](https://pubmed.ncbi.nlm.nih.gov/27612307/)\r\n\r\nIn proteins, Casein protein is heat resistant. Whey is less so, but studies conclude Pasteurization doesn't really change Whey protein levels. [https://juniperpublishers.com/jdvs/JDVS.MS.ID.555822.php](https://juniperpublishers.com/jdvs/JDVS.MS.ID.555822.php)\r\n\r\nUltra high temperatures actually result in the body being able to better process milk's proteins: [https://pubmed.ncbi.nlm.nih.gov/19022955/](https://pubmed.ncbi.nlm.nih.gov/19022955/)\r\n\r\nNo correlative link has been established between raw milk and preventing asthma and allergies. \r\n\r\nFinally on the microbial level, everyone refrigerates their milk. You harm microbial elements by refrigerating it. \r\n\r\nI will die on this hill. Never drink raw milk. I will lose my mind if I hear another person advocating for raw milk.", "It's a shame to see so many people chastising others for buying or drinking raw milk, which I assume is based in fear due to the spreading Bird Flu panic. At the end of the day, it's a personal choice. Raw milk is said to contain vital energies and living enzymes, which some believe nourishes body and soul.", "Milk (when pasteurized, which all grocery store bought milk is) is not affected by the avian flu since the heat pasteurization inactivates the virus.  \r\n\r\nhttps://www.fda.gov/food/alerts-advisories-safety-information/updates-highly-pathogenic-avian-influenza-hpai#:~:text=The%20study%20–%20the%20only%20one,H5N1%20HPAI%20virus%20in%20milk.\r\n\r\nI also work in the field. Your milk will be fine.", "I have no personal preference for whether or not people eat dairy, but just for the sake of clarity -  this article is if anything a red flag for the conditions of both the animals and employees actually living and working in factory farms, not indicating that dairy products themselves are currently unsafe for consumers; there has been no evidence whatsoever of dairy products on the market testing positive for containing Avian Flu. The 4 human cases mentioned in this article have all been dairy farm employees who got sick from close contact with infected cows (if you're arguing that those poor conditions are a reason to *boycott* dairy products, carry on - as long as we're all clear that the linked article is not saying you could get bird flu from yogurt from the store).", "Animal agriculture is more protected and insulated from regulation than the oil and gas industry. They get insane amounts of subsidies to hide the true cost of meat and dairy. They're able to prevent scientists from testing animals for bird flu. They actively spray piss and shit onto people's property. They rely on migrant workers, including children, who endure amputations and arthritic inflammation. They greenwash their outsized environmental pollution impacts by falsifying data on claims such as regenerative farming. Their products are carcinogenic, cause diabetes and heart disease, yet do not need to inform consumers of the health risks of eating their preferred diet of meat and cheese 3x a day.", "Well at least on the bird flu front, all four cases including this one so far have been dairy workers who are in close contact with cows, not people who got sick from milk (pasteurization is actually pretty rad for preventing things like that). It would be a lot more likely, and *is* a valid concern, that those dairy workers could spread a bird flu strain that's jumped to humans to other people in their outside lives - but at that point, your milk consumption (or lack thereof) is pretty irrelevant!", "&gt; Still, the FDA is conducting further research by attempting to grow the virus from the genetic remnants of H5N1 found in retail milk in order to assess whether live virus is found in those samples. Those results will be available in the coming days, according to STAT News.\r\n\r\nThis is incorrect. Genetic remnants cannot be grown into active virus. \r\n\r\nThe qPCR analysis helps determine if the virus has been in the sample at some indeterminate point in time, but cannot distinguish if the genetic maternal originates from active or inert virus. The samples that tested positive on PCR were inoculated into chicken eggs, which were then monitored for growth of the virus.\r\n\r\nAnd some of those results were released this afternoon. This far, no active virus was found in the qPCR positive milk samples, suggesting that pasteurization is effective at fully rendering the virus inert.", "Appreciate the thoughtful response! I used deaths as a metric because I was comparing to deaths from lightning strikes, and I couldn't find stats for injuries.\r\n\r\nThe threat of pandemics does change the stakes, and as dairy can be a vector for H5N1, I think it would be prudent to stay away from raw milk until we have a better sense for the risks associated with that virus. As with most contagions, risk multiplies in factory farms (with tens of thousands of animals in close proximity, and weakened immune systems from poor living conditions). Small operations tend to be more resilient in those regards, but I would still want my milk tested on a regular basis.\r\n\r\nCulture-wise, I see this more as an establishment vs. anti-establishment issue, but as Trump-era Republicans have begun to cast themselves as the anti-establishment party, it makes sense that they would fold this into their rhetoric. The parallels between COVID are obvious, but there's room for nuance in both cases.", "Is there a single case, like in the entire world, of a person catching H5N1 from drinking raw milk?"], "Topic 13": ["Likely.  85% of Colorado hens have been killed off by avian flu. Not just a Colorado problem.", "Avian flu is far from a Boulder exclusive problem", "&gt; I have no doubt that bird flu and other sickness has reduced availability of eggs in the immediate short term by some fraction.\r\n\r\nIf by some fraction, you mean a really large one, like 7/8ths, then yes.\r\n\r\n&gt; Avian flu has killed off 85% of Colorado’s egg-laying hens\r\n\r\nhttps://coloradosun.com/2022/11/22/eggs-cost-prices-avian-flu-bird-inflation/", "[Bird flu wiped out more than 85% of Colorado's commercial hen population](https://www.denver7.com/news/local-news/bird-flu-wipes-out-more-than-85-of-colorados-commercial-hen-population) in the last year", "If you read the article it states that the water fowl migration helped exacerbate the avian flu in Colorado.", "There is, has to do with the Avian Flu. Colorado lost a shitload of birds in the past 3 months", "If there is an impact, I imagine it is small. Last I heard 85% of all egg laying birds in Colorado were killed due to the avian flu."], "Topic 14": ["#Timely Notice regarding COVID and other respiratory diseases.\r\n\r\nPlease note that as of recently (May 2022) Denver has seen a large rise in COVID cases and, anecdotally, I've known several people to have gotten a bad strain of a flu-like virus, but testing negative for covid. There is also at least one reported cases of [Avian Flu in Colorado](https://denver.cbslocal.com/2022/04/28/colorado-man-tests-positive-avian-flu/), but the risk appears to be low.\r\n\r\n**Recent Covid News:**\r\n\r\n- [What You Need to Know About Omicron 3's Rise in Colorado - Westword 5/3/22](https://www.westword.com/news/colorado-omicron-3-covid-rise-update-14004391)\r\n\r\n- [Wastewater shows new spike in COVID cases in Denver area - 9News 5/6/22](https://www.9news.com/article/news/local/next/covid-wastewater-spiking-denver-metro-area-may-2022/73-51a589d1-4da3-403e-8d39-a12ea583fc75)\r\n\r\nIt is recommended to avoid large crowds, wear masks, and get vaccinated to help mitigate these risk.", "Part of the concern is that flu is a weird fucking virus and if you co-infect with two strains of flu at once, they can swap parts of their genome to create a new flu. So current HPAI is not easily transmissible between humans, but if someone catches it from, say, working at a chicken farm, or handling a wild carcass as a good samaritan trying to clean up, and either already has or shortly after catches the standard seasonal flu shit can get real fucky, REAL quick.\r\n\r\nIt's known as antigenic shift, it's rare but it's what caused the swine flu outbreak in humans back in 2009. [https://en.wikipedia.org/wiki/Antigenic\\_shift](https://en.wikipedia.org/wiki/Antigenic_shift)\r\n\r\nThat's part of why there's concern and why eyes are on it even though the risk of infecting humans is low, and the risk of spread human-to-human is even lower. If you see a dead bird, do not handle it, call it in. Low is not zero. Denver's asking you to call 'em in to **311**. You can call Colorado Parks and Wildlife in other areas.", "Consider contacting the Colorado dept of agriculture animal health and see if they (or what agency) wants to collect them for testing. There is an outbreak this year of the Avian Influenza H5N1.\r\n\r\nSo far only a person had it in Colorado, but confirmed avian cases in neighboring states.", "#Timely Notice regarding COVID and other respiratory diseases.\r\n\r\nPlease note that as of recently (May 2022) Denver has seen a large rise in COVID cases and, anecdotally, I've known several people to have gotten a bad strain of a flu-like virus, but testing negative for covid. There is also at least one reported cases of [Avian Flu in Colorado](https://denver.cbslocal.com/2022/04/28/colorado-man-tests-positive-avian-flu/), but the risk appears to be low.\r\n\r\n**Recent Covid News:**\r\n\r\n- [Denver COVID cases rising, city changes level  - KDVR 5/13/22](https://kdvr.com/news/local/denver-covid-cases-rising-city-changes-level/)\r\n\r\n- [Colorado projects COVID hospitalizations could hit 500 by June as Denver moves to “yellow” risk level - The Denver Post 5/14/22](https://www.denverpost.com/2022/05/14/covid-colorado-hospitalizations-cases-model/)\r\n\r\nIt is recommended to avoid large crowds, wear masks, and get vaccinated to help mitigate these risk.", "From the article:\r\n\r\n&gt;In Colorado, there has been one case of an individual contracting avian flu from an infected bird. The case occurred in Delta County this April, when an individual came in direct contact with diseased poultry by doing culling at a commercial farm. The individual did not experience any severe symptoms, and there was no other transmission following this.\r\n\r\nI would also note that a Google News search shows other articles about this subject and it looks like the issue is with birds. It's a disaster for agriculture due to how contagious and potentially fatal this is for birds.\r\n\r\nHowever, it  does not appear to be a major issue with humans at this time--certainly not the next COVID-19, if that's what anyone has in mind.", "Merely tongue in cheek. Colorado is currently in the middle of an avian influenza AND an equine influenza outbreak (unrelated strains; avian is H5N1 and equine is H3N8).\r\n\r\nWe're all wiped out from COVID restrictions, but these hits keep coming and while these two outbreaks are mostly confined to animal populations, it's always ever a short genetic wiggle away from getting a foothold in the human population. Let's just say that these are the days you might consider donating a gift basket to your local epidemiologist."], "Topic 15": ["Depends on what you want. Wanna stop shit like the avian flu wiping out wild birds? Then just stop eating bird flesh and eggs. Wanna slow deforestation and climate change and also stop spreading zoonotic diseases in general? Stop eating all animal products. You okay with the current global situation? Continue eating animals.", "It's really not a \"secret govermenment\" thing or anything; it's the avian flu that has been going around for a few years. You know, the reason (partially, also corporate greed, but that's another discussion) eggs are so expensive. It's literally in the article.\r\nYOU may have just been trying to be funny, but some people really need to visit an agriculture center or talk to a farmer every now and again.\r\n\r\nAnimals have viruses and bacteria that can be given to pets and humans. Don't touch dead animals, especially not with your bare hands. And if you do, for pete's sake, wash them thouroughly after BEFORE you touch anything or anyone else.\r\n(Sincerely, your friendly grew up in the country/on a farm neighbor.)", "Even if they were used, the whole practice is super fucked up.  Chickens are the most abused animals in this planet. 9.5 billion are killed in the US each year.  They are also an enormous liability.  Bird flu has like a 50% mortality rate in humans. \r\n\r\n\r\n If we love our children, planet, and communities then it's time to stop putting meat on the table every single day.  Think 8oz a week or less. "]}