{"Topic 1": ["Wow if all food prices weren't going up week by week...the constant return of bird flu (mostly in the form of higher prices)...would seem suspicious. \r\n\r\nThe cost of food is just one form of pressure being applied to us now.", "https://news.yahoo.com/inflation-egg-prices-show-tacit-221217481.html\r\n\r\nThat only amounts to about 5% of the total egg-layers in the country. It does not, in any way, make up for the fact that prices increased by over 130% for customers, and the largest egg producer (who, by the way, *did not experience a single case of bird flu*) experiencing a **960% increase in profits.**", "Honestly this food is ridiculous and I forget which subreddit it was but people posting egg prices tells you a lot and I know there were issues with the avian flu, but holy hell 8 bucks for a normal carton of 12 white eggs? No thank you mam. Also, I am semi worried this weather throughout California's inlands may actually hurt the crops and cause even more increases to food across the country.", "And it must have happened something like this...\r\n\r\nCompany 1: *how about you give all your chickens avian flu so I can profit when the price skyrockets?*\r\n\r\nCompany 2: *I don't see how that benefits us, but sure whatever*", "That makes me even more angry. It proves they had no reason to jack up the price of eggs yet they still did and made a 700% increase in revenue.\r\n\r\nAt least the avian flu excuse made sense. We have less chickens so they give out less eggs. Supply goes down, demand did not, so price goes up. This situation is supply stayed the same, demand stayed the same, so price goes up because of corporate greed.", "A Cobb salad with EGGS AND CHICKEN. Have you not been following the bird flu shenanigans that raised egg and chicken pricing.They increase costs and profits. Go grocery shopping if you're that mad about restaurant prices. Sorry you're lazy and need on demand food. I made an Italian Cobb salad at my house today for $5 because I'm not lazy. You're out of touch. When the rains quits touch some grass.", "Also, I think it is disingenuous to shuck the crux of the argument.  Due to bird flu and an irregularity in chicken prices.\r\n\r\nHow about colleges, you think they're fairly priced?", "Yeah, simple.  The primary issue of my salad price going up is bird flu.\r\n\r\nWhy is gas going up, why are college universities unfairly priced, why are we losing our buying power on the american dollar?  Why is our government not investing our tax dollars into education, why is the mortality birth rate climbing?  Can those be explained with bird flu?", "They will never go back to where they used to be, they don't give the money up, it is a ratchet effect.  It's even more apparent when you realize avian flu explains like a 5% change in egg price yet they doubled in a month anyway and egg producers raked in record profits as a result.  Now that they're just making 66% bigger margins than they ever had before we are saying thank you", "You do know the reason for the  increase in the cost of eggs had far more to do with the outbreak of avian flu that killed a large amount of poultry livestock in the course of a couple years than anything related to the cost of raising them and farming eggs, right? Or are you just running off at the mouth without knowing the facts?\r\n\r\nAlso you specifically said “it’s a commodity that’s regulated by the government”. So which part of government regulates egg prices? Or were you just talking 💩 there too?", "The price of chicken? \r\n\r\nNot because of the worst bird flu on record? https://www.nbcnews.com/science/science-news/avian-bird-flu-egg-prices-rcna66273\r\n\r\nIf a record amount of the product dies off, of course the prices will rise.", "The recent increase in price of eggs is directly related to the shortage of chickens caused by the avaian bird flu in 2022. Inflation surely affected the price someway but is not your cause for issue.", "Industry concentration can certainly be a factor, but are you contending that the concentration of power you cite as the cause of higher egg prices only came into being during the pandemic, and wasn't present before? \r\n\r\nBecause eggs at Aldi were like $0.88/dozen pre-pandemic and its associated stimulative economic measures. In fact, at one point in 20198 or 2019 they were under $0.50/dozen at Aldi and I joked that the birds might go on strike. Then they got up to the $4 - $5 range, and now are $2.xx. \r\n\r\nThese prices don't seem to correlate well with the degree of concentration in the industry. Was concentration really low in 2019, really high in 2022 and now decreasing again in 2023?\r\n\r\nOr is it more reasonable to look at market issues like avian flu, seasonal demand patterns, and feed and transportation costs?\r\n\r\n\r\n&gt; **Why are egg prices so high?**\r\n\r\n&gt;Since the start of 2022, highly pathogenic avian influenza has led to the deaths of about 58 million birds. It is the deadliest outbreak of all time and the worst one since 2015, when 50 million birds were culled, according to U.S. Agriculture Department data.\r\n\r\n&gt;U.S. egg inventories were 29% lower in the final week of December 2022 than at the beginning of 2022, according to the USDA. More than 43 million egg-laying hens had died as a result of the malady by the end of December. \r\n\r\n&gt;“Lower-than-usual shell egg inventories near the end of the year, combined with increased demand stemming from the holiday baking season, resulted in several successive weeks of record-high egg prices,” USDA economists said in a January research note.\r\n\r\n&gt;Egg prices have also increased as part of overall food inflation driven by rising costs of labor, ingredients and logistics. Higher feed and transportation costs for producers mean shoppers will continue to face elevated egg prices even when the bird flu’s effects diminish, said CoBank ‘s Mr. Earnest.\r\n\r\nhttps://www.wsj.com/amp/articles/egg-prices-shortage-avian-flu-11673629381", "not disputing those numbers at all, but:\r\n\r\n- egg prices are primarily determined by consumers, not by producers. eggs are a weird industry\r\n- the egg price spike was primarily caused by a supply shortage, because millions of egg-laying birds had to be killed, because of the avian flu outbreak\r\n- this price spike coincided with peak egg demand (which is around the holidays)\r\n- the company in the article, Cal-Maine successfully avoided avian flu outbreaks at their facilities. we should not be punishing them for that", "Unless I’ve missed an update, I believe DNR is still recommending not feeding birds due to the avian flu - the reason eggs have tripled in price, and other chicken products are so much more expensive.", "BWW fries their wings in beef tallow. That's the reason they tasted better than those fried in seed/vegetable oils. I'd imagine wing quality has gone down due to cost cutting and bird flu wiping out large flocks of chickens intended for consumption.", "I think the death of 58,000,000 chickens might have something to do with the price of eggs as well…\r\n\r\nGreed is a factor, but so is avian flu.", "Consider that they all have to go cage free...that's a large investment for egg producers, then increase cost of feed, utilities (chickens have to be kept warm) gas, payroll, numerous outbreaks of Avian flu which resulted in millions of chickens being killed to stop the spread. That's why eggs are so expensive right now.", "Sure, but by 40%? Especially considering that this bird flu hasn’t been impacting prices since August 21.", "The avian flu was the short term supply issue. Exactly! But now people are thinking that eggs are caused by the raise of inflation, so now that people are seeing them go down people are going to hoard. The hoarding will rise the price back up again if more people start to hoard."], "Topic 2": ["I heard the bird flu is in town.", "Could be bird flu related. I know it's in Newaygo.", "Oh you got that bird flu, they're going to talk about you on the news ", "Okay who had Bird Flu on their 2022 bingo card?", "You got the bird flu now. I’m sorry.", "Oh no, a bird flu?!?  Say it isn’t so!", "#Bird flu", "Those aren’t on display this year, they are all being kept inside because of the bird flu.", "Or bird flu, wash your hands", "Bird Flu🐔🐔", "I wouldn’t. Birds are dropping avian flu like confetti out there.", "Just don’t do it. Especially with avian flu everywhere.", "Did anyone get bird flu test done?", "A hiker told us there used to be 200 or more Cormorants and avian flu got 100 or so"], "Topic 3": ["This is H5N1, not a typical seasonal flu variant which are usually H1N1 or H3N2. At the moment it’s not transmitting human to human, so its not nightmare inducing.\r\n\r\nIf it gets sustained human to human transmission this is a holy shit everybody run sort of pandemic. Covid had a mortality rate between 1 to 2 percent, maybe slightly more in the beginning. H5N1 has a &gt;50% mortality rate. Not to be taken lightly.", "If H5N1 ever mutates to human to human transfer there won't be schools to shut down. A near 50% fatality rate is pretty much game over.", "Guys, there’s a strong possibility it’s H5n1. You need to get tested. Rapid tests don’t work on this strain. Go to the ER, ask for a PCR test if they have it, and for God’s sake wear a mask. \r\n\r\nConjunctivitis is a major symptom of H5N1 avian influenza in humans.", "Have you read up on the symptoms of H5N1 and seen the recent news on it?", "I'm not sure any covid testing happening currently is accurate because we have so many variants out there now. Also, H5N1 is about to become a real problem for the general public. Masks help prevent catching all these airborne diseases.", "Dunno why this thread is being suggested to me, but I posted about this back in February. I live in BC. I thought I was dying and went to the ER twice. Doctor said it was Flu A after testing me. I wonder if it was H5N1. Never ever have been that sick in my life. The doctor in The ER said he’s never seen so many young adults this sick in a long time.", "That could be a new strain of COVID, sometimes new strains do not show as positive on the new tests.\r\n\r\nThere's also a risk that this could be the feared Human to Human contagious H5N1 Bird Flu, within the last week, it another farm worker in Michigan was found to have it, but this time, with the virus in the lungs. Being in the lungs is the.... big deal issue with H5N1. \r\n\r\nAnyway, maybe get your doctor to have your test sent to the CDC.\r\n\r\nIf you aren't dead yet... you'll likely still survive.", "When folks start dropping dead in numbers (H5N1 has a 50% fatality rate in humans) they'll wear them on their own.", "Ionia County has become the ground-zero for the spread of the H5N1 virus, long seen as a pathogen with the potential to cause a pandemic", "Ideally into a more prepared state than we were for COVID, which it sounds like so far given, as a precaution, millions of H5N1 vaccines are in production", "You say that, but you can literally look up images of h5n1 and see it’s tubular. Human influenza doesn’t look like that, but bird flu sure does", "\"This 2005 electron microscope image shows an avian influenza A H5N1 virion.\" ", "Just make sure to get your tendies to 165°F and everything will be fine. This H5N1 dies with normal cooking temps.", "HPAI (along with H5 and H7 strains of low pathogenic avian flu, and Newcastle which can be clinically indistinguishable from HPAI) has been a reportable disease in poultry for ages.. it's not like influenza surveillance is new. It's considered a matter of national defense since it could have an utterly devastating economic impact on our poultry industry. \r\n\r\nAnd they're watching crossover events with good reason; the 1918 H1N1 \"Spanish flu\" pandemic likely got some of its genes from an HPAI strain, and the 1968 H3N2 outbreak was an avian strain that crossed into humans. There's good reason to be watching infections in cats and dogs, since they have much more exposure to humans and could serve as a \"mixing vessel\" for a better human-adapted strain."], "Topic 4": ["STAT reports that long-standing divisions between the USDA and FDA over food regulation could hamper the government’s response to H5N1 bird flu in cattle, said experts. The number of infected herds has risen to 49, including 14 in Michigan and 13 in Texas.\r\n\r\nWe included their article in Ag Insider's Quick Hits today: [https://thefern.org/ag\\_insider/todays-quick-hits-may-16-2024/](https://thefern.org/ag_insider/todays-quick-hits-may-16-2024/)", "CDC Confirms Second Human H5 Bird Flu Case in Michigan; Third Case Tied to Dairy Outbreak?\r\n\r\nhttps://www.cdc.gov/media/releases/2024/p0530-h5-human-case-michigan.html", "paywall.\r\n\r\nalso Michigan Radio had a Stateside Podcast about this:\r\n\r\n[Stateside Podcast: Two human cases of bird flu in Michigan (michiganpublic.org)](https://www.michiganpublic.org/podcast/stateside/2024-06-05/stateside-podcast-two-human-cases-of-bird-flu-in-michigan)\r\n\r\ncliffnotes:\r\n\r\n* respiratory issue was related to milk droplets entering lungs for a worker\r\n* milk did get in one man's eye which expressed itself as conjunctivitis but never respiratory\r\n* the virus \\*is\\* present in meat but everyone's a little freaked out because it's uncharted territory so cook your meat\r\n* I guess Michigan does a LOT of testing but it's relying on the herd owners to do it", "As a public health nurse, this is a pretty good answer. Call you local health department. Speak with communicable disease and they will guide you. (Commenter is right, probably won't hear back until Monday, I'm sorry.)\r\n\r\nHere's some info on this (linked below) although things are rapidly changing right now with Highly Pathogenic Avian Flu. Branch county is not currently identified as a michigan county with HPAI so this finding is of a bit of significance. \r\n\r\nDon't handle them with your bare hands. If possible keep them away from other animals especially cats as they are having quite poor prognosis. \r\n https://www.michigan.gov/mdard/animals/diseases/avian/avian-influenza/report-sick-or-dead-birds\r\n\r\nMore on HPAI in michigan https://www.michigan.gov/mdard/animals/diseases/avian/avian-influenza", "And Montcalm, according to the MDARD article that cbs cites but seems to be broken: [MDARD - Highly Pathogenic Avian Influenza Detected in Three New Michigan Dairy Herds](https://www.michigan.gov/mdard/about/media/pressreleases/2024/04/12/highly-pathogenic-avian-influenza-detected-in-three-new-michigan-dairy-herds)", "&gt;The Kent County Health Department (KCHD) enforces the Housing Regulations for Kent County, MI to ensure that households and properties are maintained in a proper sanitary and non-hazardous condition to prevent illness and injury. **Concerns regarding the sanitary or hazardous conditions of a particular household or property can be reported by calling (616) 632-6900, or emailing** [**KCEHmail@kentcountymi.gov**](mailto:KCEHmail@kentcountymi.gov)**.**\r\n\r\n[Access Kent](https://www.accesskent.com/Health/Environmental/housing.htm#:~:text=Health%20Department,-Home%20Health%20Department&amp;text=Concerns%20regarding%20the%20sanitary%20or,emailing%20KCEHmail%40kentcountymi.gov)\r\n\r\nThe geese issue could \\*fall under a [Nuisance Wildlife](https://www.michigan.gov/dnr/managing-resources/wildlife/nuisance-wildlife) issue. They cancelled pick up and relocation in 2023 because of avian flu, but it might have been restarted. DNR might be able to help.\r\n\r\nIs there a Property Management number you could call directly instead of relying on a desk worker?", "virtually no residential areas in detroit are more vacant than a handful of blocks. the article mentioned she had horses, goats, and other animals (not named) not just some chickens 😑 even with chickens there’s literally avian flu spreading and michigan is one of the states being affected, avian flu has now spread to cattle which then spread to a man in texas which gives the possibly of rapidly infecting humans at a dangerous rate and is actually deadly 🙄 it’s a current literally perfect prime example of why this shit can’t be allowed unsupervised and without going through the proper legal process/ safety precautions.", "I don’t have a source for anyone getting sick with bird flu because it hasn’t happened (yet). However, there have been 2 cases in Michigan of dairy farmers catching bird flu (I think both were dairy farmers but I know at least one was for sure) from their cows. Those cows pass the virus into their milk and it can very easily infect a human. It doesn’t sound like a case of “if” but more like “when”. The more these people keep drinking infected milk, the more likely bird flu will mutate like covid did to jump from human to human. \r\n\r\nTo the point I was making about them getting sick, they are already making themselves sick on raw milk by drinking those pathogens. The reason raw milk was banned in the US to begin with was because it accounted for a quarter of all food borne illnesses in the US.", "i’m clearly commenting on the mf animals she already had on her land which was horses and goats (other animals too which weren’t named) 😐 nowhere in that article does it mention chickens yet you’re commenting about chickens? bc you mentioned chickens I gave a clear reason why allowing them without proper approval is literally dangerous for her neighbors. here’s a cdc article about backyard chickens and bird flu, hope this helps your delusions 👍🏻 https://www.cdc.gov/flu/pdf/avianflu/avian-flu-transmission.pdf"], "Topic 5": ["I know an avian flu had a big impact. But as a backyard chicken person, my hens have barely been laying for months which is very unusual. I've found many others having the same problem and the culprit seems to be we have all been using the same feed. I do wonder if the commercial industry is having a similar problem in addition to the bird deaths.", "From your own source: \r\n\r\nA deadly and highly infectious avian flu has forced US farmers to kill millions of egg-laying hens, reducing the country's egg supply and driving up prices. But Cal-Maine said in its earnings statement that there have been no positive tests for avian flu at any of its owned or contracted production facilities.", "The one on Lake Mich used to be my go-to for chicken when I didn't want to drive all the way out to New York, but the last time I got some-- about a month or so ago-- it was just some sad, scrawny pieces, and the price (such as with everything) was up. I figured it might be that avian flu thing going around cramping the supply.\r\n\r\nHave you had it recently? Curious if it's getting worse all over.", "Herbruck's detected avian influenza in their operations. They've killed and are disposing of 6.5 million chickens. Turns out a running egg production is smelly, but a[ dead chicken operation is even smellier. ](https://www.thedailynews.cc/articles/ionia-county-poultry-ranch-forced-to-dispose-of-nearly-6-5-million-chickens-due-to-avian-influenza/#//)", "The chickens were required to shelter in place to protect the population from spreading bird flu. The hens got separated from the roosters. Now we are dealing with an egg shortage.... 🤯😅😂\r\n\r\nThose poor, poor rosters.", "Avian Flu has destroyed the chicken farming in the USA \r\n\r\n&amp;#x200B;\r\n\r\nhttps://preview.redd.it/hqdnw0bykadc1.png?width=1012&amp;format=png&amp;auto=webp&amp;s=9fbe6094f87c1d4449ec9195ee50140b59bd3914", "If it's bad chicken, the precautions could be due to the avian flu that's currently going around U.S. fowl and livestock. Maybe have to check that out before sending people out of the country.", "Supply issue caused not by inflation, but by massively spreading avian flu killing off laying hens around the country.", "It had absolutely nothing to do with the worst outbreak of avian flu at all. It totally had to do with the Trillion dollars borrowed by our government. Idiocracy hard at work."], "Topic 6": ["This is something that I've been keeping close tabs on because we raise our own ducks and geese.\r\n\r\nThis particular strain has been going through bird flocks from Asia to Europe and now to the US and North America like wildfire. Waterfowl apparently don't show any symptoms, just mysteriously die. Dryland birds like chickens and turkeys show symptoms but die quickly, and the entire flock gets very sick very fast and often dies off within days. It is only jumped to a couple of people, and they were ones who worked closely with sick animals in not so clean conditions. The odds of this bird flu jumping to humans at this point, I think, is pretty low given that it has been spreading around the world with migrating birds and affected many small flocks and commercial flocks as well. A whole lot of humans have been exposed with no sickness. It also does not seem to be jumping to other mammals.\r\n\r\nThe infected flock in Michigan is a homestead flock not far from me, and there are a lot of us in Southwest Michigan who have small flocks. We are keeping our birds inside their duck yard when we have been allowing them to free-range. They are recommending that people keep their birds either inside a coop that cannot be infiltrated by wild birds or do what they can to keep food and water away from wild birds and follow serious biohazard protocols. Gloves only for the barn, boots only used in the barn, stuff like that.\r\n\r\n\r\nEdited to fix speech-to-text errors. Sorry about that.", "And then we get bird flu!\r\n\r\nHonestly though, it's so fucking frustrating to have so many predictable and preventable diseases that are now becoming major issues because of warmer temps bc of climate change, suburbs encroaching into forested areas and disturbing the predators that keep the rodents in check (rodents host the ticks from the nymph stage to adults), and shitty farming practices that create epicenters for disease breakouts", "FWIW, as someone who follows this for work, it's not sudden. \r\n\r\nThis round of bird flu has been ongoing since early 2022, and it pops up again when the migrations start, so early spring-late spring and early fall-late fall. \r\n\r\nThere are a few different pathways (Pacific, Central, Mississippi, Atlantic) birds tend to follow, though it'll obviously differ based on specific species. \r\n\r\nIt gets reported more in states with more producers, as would be expected. \r\n\r\nThe last BIG outbreak before this one was in 2014-2015 and kind of died off. This one has been basically ongoing and just flares back up with migration. The wiki article has more specifics in the history section. https://en.wikipedia.org/wiki/Avian_influenza\r\n\r\nIt's a little more concerning now that it's been found in multiple states in multiple *dairy cows*. It's been popping up here and there in mammals but not consistently, this is new.", "Wellllll... are they? Avian flu is carried by wild birds that travel to all farms. I prefer shopping local and patronizing small farms, but be mindful that the little farms may not have as robust biosecurity and monitoring practices.", "When you say sus, are you referring to human indirect intervention like rat poisonings or sus due to avian flu (or just \"fowl\" play?)\r\n\r\nI've recently moved to AA and despite this cloud cover, the crows roosting every evening has been quite the sight!", "Last year in June there were news reports about 1500 terns found on Islands in Lake Michigan dead of avian flu. Waterfowl, seagulls, and shorebirds commonly catch avian flu, and corvids such as jays, crows, and ravens are known carriers of West Nile virus. Since bird diseases can often spread to people, It's a good idea to fill out the form and upload photos to the DNR on their website.\r\nhttps://www2.dnr.state.mi.us/ors/Survey/4", "It's this. \r\n\r\nI took an orphaned goose into a bird rescue place by Ann Arbor about 2 weeks ago, and they said the bird flu is so bad that they have to separate the birds and euthanize any showing symptoms, ahead of an autopsy.\r\n\r\nFeeding birds right now is spreading it, as is the mating season.\r\n\r\nIt's definitely a problem, and it's definitely not the Sparrow hospital building going around killing birds across the state.", "I know this is a bit of an older post, but curious if you saw many seagulls? My family and I visited Lake Huron this weekend and literally only saw 3! Seemed odd. I was hoping it was just too windy or something and not the ongoing bird flu."], "Topic 7": ["Sorry asking because google was unclear - if I have no chickens but have a bird feeder should I still take it down? Like am I increasing spread of bird flu ? I get the same chickadee every morning and then some cardinals usually", "You might check local feeding recommendations.  With the current outbreak of avian flu, they're recommending that you take down your feeders to avoid birds congregating and spreading it.", "Note that avian influenza is still a concern. DNR recommends cleaning feeders every other week with a 1:10 bleach:water solution.", "Pretty bird! I had an evening grosbek at my feeder, he was ticked because I didn't put food out last year, but bird flu.\r\n\r\nI should try to put oranges out. That's what they like, right?", "Hello u/dreadedowl!\r\n\r\n The title of your post differs from the actual article title and has been removed. Please review [Rule #6](https://www.reddit.com/r/Michigan/wiki/index#wiki_rules) in the r/Michigan subreddit rules. Feel free to delete this submission and resubmit with the correct title, or contact the subreddit moderators if you feel this is an error. Further details: \r\n\r\n**Posted Title:** Remove bird feeders and baths according to this FREEP article. Is this something we really should be concerned about doing? I've fed our birds every year for 20 years in the same area. Won't they starve if we take them all away?\r\n\r\n**Actual Title:** DNR: Remove feeders as bird flu cases increase\r\n\r\n**Similarity:** 23%\r\n\r\n\r\n\r\n*Please contact [the moderators of r/Michigan](https://www.reddit.com/message/compose?to=/r/Michigan) if this bot is misbehaving.*", "Avian flu isn’t spread via the fecal-oral route. You can eat it all you want. Contact with respiratory droplets from live birds is the problem. Bird to farmer to us…"], "Topic 8": ["All of the above.  \r\n\r\nCovid, flu a, flu b, bird flu transmitted by cows, norovirus,  RSV, regular ol cold. \r\n\r\nEven being immunized against some of these doesn't prevent you from getting sick. It can just help reduce the severity and duration of the illness.", "why would you ask this, especially when we have known cases of bird flu infecting cattle here? 😩", "Covid had documented cases well before it crossed into the US of it having a vector of human contact. There is yet to be a case of human contact causing another person to get avian flu. The only people who are sick with it are those who are in close contact with dairy cows or poultry", "Avian flu in cows", "&gt;You found a way to make sick cows a political device\r\n\r\n[Hmmm... you can read more about the dangers of bird flu affecting humans here...](https://www.cdc.gov/flu/avianflu/avian-flu-summary.htm) spoiler, it's the Centers for Disease Control website.\r\n\r\nBut don't worry, nobody ever turned the CDC into a political device.  And btw, if you enjoy living, you should stick up for informed political activists."], "Topic 9": ["&gt;  they will probably start advocating for drinking raw milk\r\n\r\nIf you spend any time on rural local facebook groups you'll find lots of people seeking raw milk for \"reasons\".  Unless you're making cheese that idea flies in the face of all logic already.  Pasteurization was such a huge step for safety but they'll play their pretend facebook scientist game to find flaws in pasteurization.  Of course they'll follow that up with thinking that the raw milk of bird flu carrying cows would be some panacea.  It's all so frustrating.", "\"Raw milk sales rise despite bird flu warning\" (https://www.nbcnews.com/health/health-news/raw-milk-sales-rise-bird-flu-warning-know-unpasteurized-dairy-rcna152163).\r\n\r\nThere are a large number of American adults (lets call them 'MAGA', for short) suffering from oppositional defiant disorder.", "I heard that people think the raw milk acts as a vaccine or something giving you anti bodies for h5n1.", "Raw dairy is big nationwide.  Even more so now, some people think if they drink it,it will somehow prevent them from getting the bird flu.", "Source for someone contracting bird flu from drinking raw milk?"], "Topic 10": ["Brought Toni’s by Factory Farming! This will continue until the public at large has had enough and we move away from factory farming and just accept fewer eggs and other animal products in our diet, because the more local alternatives are more expensive, yet also much less likely to create these kind of results.\r\n\r\nThis strain of Avian Flu has apparently jumped to Dairy Cows in another state AND from the cows to at least one worker.", "There is a war in Ukraine. The avian flu was especially bad this year wiping out chicken and egg farms. Years of drought and increase cattle supplies (like feed) forced cattle farms to sell off cows. The cost of feed is also impacting other livestock farms. Cost of gas raises delivery costs.", "The cost of feed for livestock has gone up due to drought, war, and the pandemic. Many cattle farms sold off cows to survive. The amount of beef available on tte market is much less than it used to be. As for chicken. The avian flu was very bad recently which wiped out major chicken suppliers. If avian flu is detected in one of your birds you have to dispose all of them….think thousands of birds. That not only decreases the amount of chicken available but eggs as well", "Farmers get tax breaks and such, but the industry is setting farmers up for failure. I’ll provide a link to an article that highlights common struggles in dairy farming, but there are issues in other segments of farming as well. Plant based large-scale farmers are typically under contract to purchase specific seed, and the seed is usually modified so they aren’t able to save seed from harvest to replant, meaning they always have to buy seed; oftentimes crops are grown in soils that are exhausted due to industrial farming, so they also are forced to purchase fertilizer; with the changing weather patterns, after these expenses sometimes crops even fail and then they make no money. In a lot of situations, farmers get very little profit off of their goods, which puts them in a cycle of debt and poverty, like the article states about the family owing hundreds of thousands of dollars on used farm equipment. There are tons of facets. I mean, some farmers now have to kill their entire flocks of chickens because of avian flu, that’s a huge financial loss. In summary I think industrial farming just isn’t working for our changing climate and for our consumer system that’s screwing not only the farmer, but the land. Here’s the article, but feel free to google a bit more and find more info for non-dairy farmers - it’s rampant and has kept me away from my dream idea of owning a farm. \r\n\r\nhttps://time.com/5736789/small-american-farmers-debt-crisis-extinction/", "Well, food scarcity is just going to get worse. The weather, war etc this year has damaged crops. Also a lot of cows have started to be culled or have died bc bird flu, but also cows produce less milk when they have bird flu, so it follows that dairy products are scarce. I’m not sure which farm, but one in Michigan killed 10% of their cows. "], "Topic 11": ["In the US there have been no known transmissions of HPAI to humans yet. The virus is fatal to poultry and represents a threat to producer flocks and wild birds.", "HPAI is mostly spread in the US by migrating wild birds. So, spring into summer and then again fall into winter. Not suspicious.", "yes. i wouldn’t take the chance. you know\r\nit’s coming from somewhere that has HPAI positive poultry.", "They don’t really want to be a reason for farms getting HPAI. So they send a directive to farms stating the conditions for MDARD coming back to farms like “no new cases for 60 days for us to venture into farms”. MDARD will go out for emergency reasons. So because of a new case recently the deadline has been extended"], "Topic 12": ["MASK UP!\r\n\r\nIf the bird flu won't kill you, the murder hornets in a few months will.", "Bird flu kills birds. Cats kill birds (have indoor-only cats, people!). Birds kill birds. \r\n\r\nAnd badly-constructed bird nests kill birds. /r/stupiddovenests", "Is feeding birds ok right now with the bird flu?"], "Topic 13": ["Unless all these people are spending a lot of time around infected animals there's no reason to think it's bird flu. There's no indication that bird flu is spreading person-to-person at the moment.", "It's not the new Avian flu that is starting to spread? I think it recently jumped to humans?", "I figured either Avian flu concerns or simply an oddball animal lover somewhere might have a vested interest. That was why I bothered to throw it out there. I already know nature would do its thing one way or the other."], "Topic 14": ["Rob Schneider, the right wing ,\"comedian\" anti vaxxer, was screaming about bird flu being the next govt conspiracy.  He also said that he wouldn't get a bird flu vax.  That 60% number should scare off even the more hoo hoo people.  1% was already causing 9/11 numbers of deaths every day.  All this stuff should be appropriately frightening.", "They’ve already produced millions of bird flu vaccines in case you wonder where this is headed.", "If bird flu comes we are toast. Covid proved it."], "Topic 15": ["Other diseases are certainly a concern but post Covid is what’s got us disabled and if you’re protecting against Covid you’re also protecting against nearly all viral diseases and infections and likely cautious about things like measles and bird flu as well. I’ll repost in maybe a week with the immunocompromised bit though, thank you!", "It's good information to track, the more cases of bird flu that jump from livestock to humans the more chances it has to jump from person to person. Lots of pandemics are traced to a novel zoonotic virus that jumped over, then was able to jump inside human populations. Learning about new jumps isn't fear mongering unless that information makes one scared.", "I don't disagree that collecting and tracking data is important. The new strain of bird flu is for sure something we wanna keep an eye on to monitor its spread and symptoms.\r\n\r\nI was commenting on people's reaction to the information. Comments like \"we're all gunna die\" and calling it the next pandemic before we really have a gauge of its impact isn't helpful and helps to create a culture of fear"], "Topic 16": ["Good that they're being tested for Avian Flu; my understanding is that it's been pretty off the charts in North America this year, no? I recall PSAs about taking down bird feeders, not to mention chatter from virologists fretting about the next spillover.", "Just put of curiosity, how concerned are you about avian flu right now? Family friends are kinda freaking out but they have a large brood of a few dozen"]}