{"Topic 1": ["Inflation, bird flu, Covid……", "Oh no! Bird Flu incoming?", "Right as bird flu is popppff too. Nice", "War (Ukraine), drought (Europe, Asia, North America), pestilence (bird flu) probably played a part too.", "Bird flu’s a-commin.", "Explains the bird flu. Now, how do you explain your monkeypox?", "Boomer Remover 2: I gots Bird Flu", "Highly pathogenic avian influenza. No bueno.", "I didn’t even think about bird flu! Thanks!", "Covid is so over. Bird Flu! Is the hot new scary disease that you NEED to be CONCERNED about!", "It's good to hear that some areas have no apparent impact from the Avian flu.", "[Avian flu article](https://www.science.org/content/article/we-re-nervous-deadly-bird-flu-may-be-north-america-stay)", "With bird flu going around, do not pick it up or mess with it", "The fact that your convent about people who dont agree with you. Listen, stay boosting. You probably need your election season c0vid, bird flu, combo. 2 at once.", "Bird Flu.  Mask up!", "I do think I saw something the other day about avian flu ramping up, could be an explanation.", "Bird Flu. \r\nGonna die.", "Bird Flu Platter…? That’s a Hard Boiled Hell No!", "They made up bird flu to disguise that they're phasing out old surveillance technology."], "Topic 2": ["The price of chicken quadrupled for wholesale compared to 2020… not only that labor costs have skyrocketed as well. Ultimately it’s up to you to decide if it’s still worth the price. Tbh you should expect more price increases…the bird flu hasn’t even affected the industry atm, and we aren’t even sure if it’s fully contained yet. \r\nMaybe the question isn’t “what’s the deal with Hot Chicken Takeover,” but “what’s the deal with this world right now?”", "Keep in mind a major part of the price increase is due to increased wage costs.\r\n\r\nNext is that the US chicken supply was gutted, well terminated, because a few thousand birds were infected with bird flu.  Even though they were mostly isolated in a small local farm, the FDA mandated hundreds of millions be terminated WITHOUT testing to confirm infection.  Along with destruction of hundreds of millions of eggs per year since.  Again, without testing to confirm infection.\r\n\r\nSupply has never recovered and therefore costs are higher.  Heck, even grocery store prices for chicken are still crazy high.", "Egg prices aren’t just inflation, they’ve been hit by avian flu. Birds from bald eagles to chickens to neighborhood sparrows have been affected.", "Didn’t know that bird flu only affected meat chickens. Chickens at mass farms were affected too. \r\n\r\n\r\nQuote from The Hill reporting on the current state of our meat and egg farm. \r\n\r\n“Plus, egg prices haven’t fully recovered from the ups and downs of the past two years. In 2022, when bird flu knocked out 10% of the country’s laying hens, prices skyrocketed.”\r\n\r\nhttps://thehill.com/homenews/nexstar_media_wire/4579276-chickens-and-cattle-hit-with-massive-bird-flu-outbreak-will-food-prices-go-up/amp/\r\n\r\nPlease keep it in reality.", "So a continuous up tick in likes for this posting and the continuing down voting of counter points. Yes I would say that gives me the evidence to make my claim. \r\n\r\nSo this administration has nothing to do with prices going up. That has to do with corporate greed and price fixing plus other reasons. For example the price of eggs. The price of eggs was affected by a bird flu that wiped out millions of our chickens. Both meat ones and egg production ones.", "Egg price has been so volatile due to Highly Pathogenic Avian Influenza over the last two years infecting flocks in the US resulting in lower egg production. I doubt \"record profits\" is a term that anyone in egg production over the last decade is familiar with.", "For those wondering why eggs skyrocketed in cost, it's because this has been the deadliest year for bird flu ever, possibly, and millions of egg-laying hens were put down (when a farmer has an outbreak, they generally kill all their remaining birds -- even healthy ones -- to prevent spread to humans). Expect prices to remain high for several months as the industry slowly recovers.", "The plural of “Anecdote” is not “Data” \r\n\r\nH5N1 has been devastating bird populations, especially predators going back to January of 2022. It’s part of the reason why chicken and egg prices went up so much. \r\n\r\nFortunately songbirds seem to have been missed by it. \r\n\r\n[something from the Toledo Blade.](https://www.toledoblade.com/local/animals/2022/04/04/avian-influenza-taking-toll-on-birds-of-prey/stories/20220403065)", "&gt;as the industry slowly recovers.\r\n\r\nbefore anyone asks: no the industry isn't just butchering the female egg-layers for those $2/lb chicken breasts.   the chicken breed used for male/meat chickens is different than the one used for egg-laying and is less susceptible to bird flu.\r\n\r\nI would expect the \"egg\" industry to expand breeds a little bit, and maybe reduce scale of operations by spreading out, to avoid massive losses. But since egg is a staple of breakfasts and recipes I suspect the industry is [largely still making profits](https://www.marketwatch.com/story/egg-producer-cal-maine-swings-to-q2-profit-amid-rising-prices-2022-07-19) even during this difficult year."], "Topic 3": ["I believe there is also a bird flu going around which is causing many of the birds to be quarantined for their safety. When I went a few weeks ago the flamingos and penguins weren’t out, and the aviary was closed as well.", "One thing to be aware of with penguins is that there is a very nasty avian flu going around. None of the Ohio zoos have taken procautions yet but other zoos have taken all birds of exhibit so I would check ahead of you are going for penguins.\r\n\r\nAlso Cincinnati has the Newport aquarium which has penguins too. I like the zoo better though.", "Kids also love the LakeShore Live Steamers train rides at the Lake Metroparks Penitentiary Glen Park in Kirtland.  There also is the excellent Kevin P. Clinton Wildlife Center there featuring animal \"ambassadors\" when open (currently closed due to the Avian Influenza epidemic)\r\n\r\nUnfortunately, there are no train rides scheduled for the weekend of the Mentor Perchfest.\r\n\r\n[https://www.lakeshorelivesteamers.com/pub-sched.html](https://www.lakeshorelivesteamers.com/pub-sched.html)\r\n\r\n[https://www.lakemetroparks.com/parks-trails/penitentiary-glen-reservation/kevin-p-clinton-wildlife-center](https://www.lakemetroparks.com/parks-trails/penitentiary-glen-reservation/kevin-p-clinton-wildlife-center)\r\n\r\nFor persons willing to drive a further 20 minutes east from the Mentor Lagoons, there is another long Lake Erie wild beach and an observation tower at the Lake Metroparks Lake Erie Bluffs Park.  While there, check out the two excellent private campsites overlooking Lake Erie and available for rental; these arguably IMO are the best campsites in Greater Cleveland and perhaps the best in Ohio on the Lake Erie shore.\r\n\r\n[https://www.lakemetroparks.com/parks-trails/lake-erie-bluffs](https://www.lakemetroparks.com/parks-trails/lake-erie-bluffs)\r\n\r\n[http://ianadamsphotography.com/news/picture-ohio-lake-erie-bluffs-lake-county/](http://ianadamsphotography.com/news/picture-ohio-lake-erie-bluffs-lake-county/)\r\n\r\nKids love observation towers (bring binoculars) and the 12-story Kalberer Emergent Tower at Holden Arboretum, where there also is the Murch Canopy Walk, is tough to beat.", "Hippos (tucker and fiona) were out today and it was like 33 degrees. The water is warm. There was steam rising off it. Rinos, bongos, kangaroos, little penguins, ringtail lemurs, meerkats, ostrich, kudu, impala, and okapi will be off exhibit. Outside birds are off exhibit right now because of the bird flu. Everything that is in a building will be on exhibit. Everything in cat canyon tolerates cold and has access. Red pandas love winter. Everything in wolf woods is out. Go down at 2:00 and stay for the lights.", "krohns conservatory. its wonderful and next to the art museum. then check out the aquarium, currently theres bird flu around so you cant get the penguin back stage pass which is a bummer because those guys are great and you get to play with them with their little toys. a nice restaurant is symphony hotel", "Oh no! Are the flamingos and penguins still out? They were when we went a few weeks ago, but maybe there’s been another spike in avian flu cases. They’ve also had a few animal deaths over the last few months (including the capybara 😭).", "There's a bird virus going around. They're protecting the penguins from getting it. \r\n\r\nFrom their site: \r\nhttps://fb.watch/d7GdmwdhOI/\r\n\r\n\"Where are the birds?\r\nMany of our birds have temporarily moved indoors or inside a protected habitat. This is as a precaution for our birds’ safety as cases of highly pathogenic avian influenza have been detected in Ohio. Currently, all of our birds remain healthy.\r\n\r\nThere is no apparent risk to humans at this time. For our birds here at zoo, the risk comes from native birds who land during spring migration.    \r\n\r\nWe know you love our feathered friends as much as we do. The health and welfare of our birds is our top priority. They will all return to their outdoor habitats as soon as the risk of exposure is low.\"", "Yes, I went recently and was disappointed to see the flamingos weren't out due to some bird flu.", "Man, its stuff like this that makes me enjoy my 40min commute to work in c-bus.   \r\n\r\n\r\nI love my dog, but we wonder why bird-flu and COVID and all that stuff spreads.........  \r\n\r\n\r\nI will also say this same thing has been happening on Airplanes, I fly a lot for my job and my lord pre-Covid once in a great while someone would be traveling with an Emotional Support Animal it would be typically some young girl, now I've seen Big Dog's Traveling with Big-Men as Emotional Support Animals its crazy.   \r\n\r\n\r\nSame with Pre-Boarding people who aren't truly disabled are using this to board the plane earlier. On a flight 2weeks ago there were 48 Pre-Boarding Passengers (Usually maybe 10-max is the standard at CMH)"], "Topic 4": ["You’re* but seriously have you not seen the news? Bird flu has killed MILLIONS of birds this year", "My mom says the same. There was a huge bird flu last year that killed like 4 million or something. (In Ohio) We kept finding dead birds all over the playground where I teach. Like 2 or 3 each week. It's so sad. I guess there is a book called Silent Spring about the death of birds. Its terrible.", "don't look now but this year's bird flu is killing lots and lots of mammals and apparently freaking out a few scientists by how easily and often it seems to be jumping from one mammal to another.  like, i believe i heard that it wiped out an entire seal colony's  pups this year.\r\n\r\neggs are going to go back up in price\r\n\r\nthey've had a few animal &gt; human cases too.", "That’s not the main problem, 2022-2023 has been the one of the worst year of bird flu in US history, 53 million birds in the US culled. Anytime there is a outbreak they kill all the birds healthy and non, to limit spread to other birds and people.", "Bird flu going globally, has a 80 or 90% kill rate in some instances.  For a while the dnr was tracking this.  No clue if they still do.\r\n\r\nEdit - Here is a source about it: https://www.theatlantic.com/science/archive/2023/02/avian-bird-flu-virus-outbreak-epidemic/673058/", "They need to be taken out of the wild. Bird flu could easily spread to cats, who may give it to us. Not to mention they are driving birds to extinction.", "Schiller park. Please don't feed them. Bird flu is going around and you're encouraging the spread of this very deadly virus by grouping the animals together.", "It was also the worst year ever for bird flu."], "Topic 5": ["Ohh okay. Sorry, I thought you were trying to justify feeding ducks. My guess as to the sign would be because of how much more migratory geese are but I could be talking out of my ass. In general tho, the bird flu is highly contagious and any precaution helps. Feeding any wild animals is always highly discouraged and is almost always bad for them.", "Yes but there's a huge difference between wild city geese and a deer, especially when there's a problem with bird flu going on. It's just not a great idea. It's not something you should encourage.", "I've always put my food waste outside at the very least if not tossed it where I know critters to be.  I am pretty confident and ignorant so it will be tough for me to no longer throw old and stale French fries up in the air near seagulls in busy parking lots and laugh at the mayhem although much more effective than a sign could be has been the ongoing Avian Influenza epidemic. I am afraid to be near birds with that ongoing.\r\n\r\nThat said (and with a sarcastic streak to boot), I have witnessed first hand (but not by my hands) how regularly feeding geese completely upsets the migratory habits of Canadia Geese.  They are supposed to migrate and eat plant matter near or in water, feeding them regularly causes them to settle at one pond year round.", "ducks and geese are all waterfowl and all can spread bird flu or any other disease. Feeding either of them low quality foods like bread is also not good for them at all health-wise.", "There has also been a bad bout of Avian flu. Saw whole groups of dead geese in the summertime. I found a sick baby bird in my yard once and nowhere would take it because it was a) an invasive species and because b) the avian flu going around.", "That bird flu variant has been devastating migratory foul (except for geese, of course) and raptors across the US."], "Topic 6": ["That could be either from the derailment or bird flu... Should probably have them tested.", "Did they have their chickens tested for high-pathogen avian influenza (HPAI) which has been documented for the past 12-18 months wiping out backyard flocks all around the state?\r\n\r\nJust saying this is much more likely the cause than due to the train derailment that happened downwind.", "Per the [CDC’s page](https://www.cdc.gov/flu/avianflu/hpai/hpai-background-clinical-illness.htm) on HPAI.\r\n\r\n“*Signs of HPAI in poultry **can include sudden death**; lack of energy, appetite, and coordination; purple discoloration or swelling of various body parts; diarrhea; nasal discharge; coughing; sneezing; and reduced egg production, or soft-shelled or misshapen eggs.*”", "Have they tested the dead chickens for bird flu?", "Nearby where? Near the derailment site or near OP’s location?\r\n\r\nNearby and downwind/downstream of the derailment, then I’d say yes, it would be a valid concern. However, OP described her location as both upwind and upstream of where the chemicals were released, and the Ohio Department of Agriculture is legitimately concerned about monitoring all known outbreaks of HPAI, so I was simply stating that her neighbor should have their chickens tested, if they haven’t already, rather than assuming it’s related to the NS disaster.", "I've been seeing a ton of dead birds, both full size, nestling and fledglings, even more noticeable because I have a puppy now. Likely roaming cats, sadly. No real way to tell if it's poison without sending them out for testing, although they might be able to test the robin for bird flu."], "Topic 7": ["I’d argue she’s seeing more squirrels so they only look busier. Their population has exploded due to avian flu killing off a significant number of Raptors, thus putting less pressure on their population.", "Never said I disagreed.  I know avian flu has been a massive issue as of late. Was just saying that I wondered if I am seeing more because they don’t have coyotes to compete with.   \r\n\r\nNow for songbirds, it could take out some of the blue jays that seem to have created a colony near by.", "I think the avian flu that went around last year or whenever impacted the food chain. Less birds of prey means more rabbits and squirrels. More of those means more food for coyotes. They seem bigger/ healthier than ever and as others have said, more bold. My theory is they have less competition for food, so they are working their way into the city and eating up all the critters that weren’t necessarily there before due to the birds.", "Yeah, but according to an earlier post, home farmers are too dumb to know what they're doing /s\r\n\r\nCorporatism is a disease worse than this bird flu.", "Avian flu required millions of domestic birds to be culled this year/last year, so I suspect that would hinder a lot of exhibition for poultry. Unfortunately in the pandemic, many older farmers have also passed away, and farming is already a declining profession with a high average age. As others mentioned, the price to raise livestock is high right now, so there may be fewer schoolkids showing animals. \r\n\r\nThe best way to keep these traditions alive is to take up the spade yourself, even if all you have is a balcony or community garden."], "Topic 8": ["The Meijer in Mentor is much cheaper than nearby GEs, especially if you use the Mperks discounts.  And ALDI and Marcs typically are cheaper than Meijer on many items, although Aldi house brands IMO may not be as good as Meijer house brands, most especially if you desire salt free or low fat options!  Fortunately, the Mentor Meijer and a Wal-Mart, Target, Sav-a-Lot, ALDI, GE, Trader Joe's and Marcs, all are located within 3.3 miles of the Mentor Ave. strip in Mentor and Painesville Township.\r\n\r\nE.g., a couple days ago I bought a dozen jumbo eggs at Meijer for $1.69, a superlative price today given the bird flu.", "Eggs have come down in price and are beginning to normalize at prices higher than before the avian flu led to millions of birds being culled, but far below the peak. Simple Truth Natural Cage Free Eggs are $4/doz.\r\n\r\nStill, OP is way off base thinking that small, local egg producers selling their eggs at a farmers’ market are going to be anywhere near as low as the prices of industrially produced eggs in a grocery store. Even if they’re sold at cost, that cost also has to take into account transporting the eggs to the market and standing there all day to sell them. I don’t know about OP’s time, but my time is worth more than $10/hr. The economies of scale and having shelf space in a self-service venue like a grocery store are what make eggs affordable, so OP should just stick with store-bought eggs if they don’t want to pay the premium for direct-to-consumer eggs produced by local farmers.", "It's not just the price of feed - H5N1 has also done a number on poultry &amp; egg prices.\r\n\r\nBudget &amp; local/sustainable food is kind of an oxymoron. You are going to pay a premium for free range eggs and meat, generally speaking", "Try one of the indoor farmers markets, either at Crocker Park or Shaker Square. Don’t expect to score eggs week 1 in the winter with bird flu savaging the hen population, but ask about reservations for next week. If you live on the east side, Patterson’s fruit farm has eggs. I think Sages does, too.", "The egg price thing is a twofold problem. First, there was a bad avian-flu that caused something like 50 million chickens to be euthanized. But then came the 2nd problem, mega-corporations that control the egg industry used the avian-flu as a reason to price gouge despite supply returning to normal."], "Topic 9": ["Hot chicken has been not fairing well compared to other Columbus restaurants I’ve been to since the onset of the pandemic, other than the ones that have closed down, obviously. \r\n\r\nI know the bird flu has been a serious problem for them, though the couple times I went, the chicken was one of the only things that have stayed consistent in quality. Both times all their sides were noticeably worse. I don’t think their Mac is homemade anymore (or at least its more apparent it’s made elsewhere) and the beans were really stale too. Have they been this way before the pandemic and I just now notice? Or is this a recent development? I don’t think they’re changing the tea as often or putting lids on the top of their canisters, one time my friend found a fruit fly in his tea. Overall it seems things have gotten more lax there.\r\n\r\nI don’t know if they were just having an off-day both times, or if only the Easton Location is bad, but I just figured the supply chain problems have been making them cut a lot of corners. Even compared to other restaurants around though, hot chicken seems to have been struggling pretty bad. It’s a shame, really…", "But that doesn't seem to prevent their stores from having drive thru lines that wrap around the building.\r\n\r\nAlso, bird flu is making chicken scarce for every chicken place.", "Avian flu.  They are culling birds by the millions to try to curb the spread. As a result, all chicken products are more expensive, and restaurants are serving smaller pieces to keep costs down.", "Starting to see some cost relief from suppliers. Beef is supposed to have a bad year and with bird flu who knows about poultry."], "Topic 10": ["Bird flu wouldn't spread like it did if they didn't pack them in with no room to spare. Corporate greed has consequences in nature and consumers pay the price.", "I'm really hoping a nice bird flu will help ease the pressure on the housing market", "I wonder if the bird flu thing going around hasn’t messed with supply. I’d imagine everyone is trying to buy up the chicks right now.", "Well that is partially due to the ongoing avian flu issue with poultry farms.  I am just thinking about margins and what consumers are willing to pay."], "Topic 11": ["First covid, some companies had to shut down or limit workers to keep a distance. Then there was a situation, with beef and cows I don’t remember exactly but beef went up to like $7 per pound. Then we couldn’t get gloves or certain things because hospitals needed them first… and the list goes on…. Now we are dealing with the bird flu wiping out the chickens. \r\n\r\nIt’s just shot after shot and it keeps getting harder and more expensive. :-(", "If I worked in a job that put me into face to face contact with a lot of people every day I'd make the effort. Right now all my interactions are 100% voluntary. It' just cheaper and easier to wear a mask when I have to go out.\r\n\r\nSave the vaccines for those that truly need them. Some years there are shortages. I haven't heard anything yet how the bird flu culls are affecting the supply of available vaccine.  I won't be surprised to hear there are shortages this year.", "That union protects cops from accountability. We need the police union like we need a bird flu outbreak.", "It'll be super cool if companies stopped building these sites over our wetlands. We only have 1.8% of them left. Idc what you build, just bulldoze somewhere else. Man-made wetlands are not equal to the ones that are removed. \r\n\r\nOh, and guess which governor removed wetland and ephemeral stream protections under the last administration that denied adding wetlands to the Clean Water Act? \r\n\r\nHint, the same one who's responsible for the largest bribery scheme in Ohio's political history where First Energy owes the state over $300mil, rolled back food safety during an avian flu outbreak, literally forced state parks to allow fracking, tried to remove birth control, says we can't teach sustainability in college, teacher's can't protest, won't allow state employees to work from home, OH YEAH and got paid THOUSANDS not to strengthen restrictions on railroad safety right before the train derailment AFTER THE LARGEST BRIBERY SCHEME TO BE BROUGHT INTO COURT. There's more but we don't have time for that today. \r\n\r\nHe is a puppet to whoever writes the largest check. Those extra 1,000 support jobs won't go to ohio citizens, they'll be outsourced. The 230 will be the lucky ones but I guess as long as our college education is going down the toilet it's either work for Amazon or the steel manufacturers"], "Topic 12": ["This is nonsensical. \r\n\r\nSo let me get this straight – you want the government to take more of people's money as a threat for them to not sell their business? \r\n\r\nAnd your reason being is because you think that you know X market better than somebody else? \r\n\r\n&gt;Instead of taking a big payout, it's better to keep the company healthy and paying you for decades to come.\r\n\r\nThere's no guarantee that it'll pay for decades to come. Maybe the market gets saturated with fried chicken joints. Maybe fried chicken stops being trendy/desirable. Maybe there's a \"health\" push and people stop buying your product. Maybe a strain of bird flu wipes out every chicken farm in the country and suddenly you don't have a product.  \r\n\r\nWhy on earth are you against people cashing out when the moment is right? Just because a brand is worth a bunch of money now does not mean that it will be worth a bunch of money in two years.", "&gt;Eggs? One of the food items that have increased in price the most in the past year?  \r\n&gt;  \r\n&gt;Processed food does tend to be cheaper, even if they need to use Whole Foods as their main ingredients. Process foods are able to use Whole Foods that tend to be cheaper. Ever heard of corn syrup? Why do you think corn is a main ingredient in the vast majority of processed foods.  \r\n&gt;  \r\n&gt;Finally, I find it incredibly ironic that you criticized my point of view for being to simplified, yet the second I bring up economic concepts that are just outside of Econ 101 you disengage and call it a “word salad”. Pick a side man\r\n\r\nok, ok.  so i just smoked a bowl which tends to increase my tolerance for all kinds of pain, including the psychic pain incurred by reading this and the sadness i feel for you to believe all that makes sense.\r\n\r\neggs went up because of shortages due to bird flu, not demand due to poor people getting snap benefits. they're still a great source of protein and dirt cheap compared to say steaks, so your point is meaningless and one i figured you'd latch on to because it's *so fucking simple* and requires no thought past surface ones.\r\n\r\naside from the capitals on 'whole foods' which i'll assume your phone did for you, you're fucking nuts!  why do you think corn syrup is cheap again?  did it occur to you that the starting material must be even *cheaper*?  so much so you can process the shit out of it and still make money.\r\n\r\nhow about we just mill it into taco shells and give them away.  giving them away will cost more than the fucking taco shells.  labor is much more of a cost in any foodstuff than the actual food, that cost is included in your retail cost.\r\n\r\nyes, *your* grasp of economics is certainly just a shade past econ 101, and it shows.\r\n\r\nlets start with the bias you show when you categorize food assistance as \"free money\", shall we?  what IS free money to you?\r\n\r\ndoes someone who inherited a house they never lifted a finger to earn receive 'free money'?  how about if they sell the house, buy bonds with that money and get interest every year without lifting another finger?  is THAT free money? \r\n\r\nor, even if they earned it working, and live off the interest, is that free money?\r\n\r\n how about banks that use your deposits to buy bonds and capture that interest?  that free money?  or if they lend against said bonds to capture MORE interest from someone buying a house?  they didn't create that money, or produce goods, not at all, nowhere along the chain, so, is that free money?\r\n\r\ni think farmers are just fine with food subsidies, or they should be.  they're still getting paid no matter who consumes it and it benefits all of society when everyone is fed.\r\n\r\ncreating false dichotomies with 'poisons' isn't thinking through the problem, it's avoiding thinking.", "That's not how economics works.\r\n\r\nGrocery stores have very [low margins to begin with: 1%-3%](https://www.marketplace.org/2022/05/13/how-do-grocery-stores-make-money-when-their-profit-margins-are-so-low/). They aren't making gangbuster profits on your decision to buy a cheaper brand than something more well-known or expensive.\r\n\r\nYou absolutely should go frugal if you want to keep your budget in check. Skip the processed items and cook from scratch. Meal prep. Plan. Coupon. Shop around for deals from other stores. Skip the organics or the \"all-natural\" lines that just cost more without providing any tangible benefit.\r\n\r\nThere are bigger issues as to why prices have crept up. The [avian influenza outbreak decimated chicken populations](https://6abc.com/eggs-egg-shortage-prices-why-are-so-expensive/12719329/) at the same time that demand was increasing. Supply chain disruptions. The conflict in Ukraine. Transportation costs. Increased consumer spending. Etc."], "Topic 13": ["No worries. I don’t hold particularly optimistic beliefs about animals that are mostly seen as a resource, but these guys aren’t getting the worst livestock experience. Although I do wonder with Avian flu threats what that looks like for small flocks too.", "over aggressive control freak cops did cop things that had nothing to do with any of the information involved. they got mad at him because they thought he was too loud, ffs. read up on it.\r\n\r\nanimals exposed to the smoke and any vapors i'm sure are impacted, that's not a surprise to anyone, why would it be a surprise to you?  they ordered evacuation immediately after the crash and expanded it for the burn-off.  anyone with a brain took heed and moved their animals as well.  i think it would be a stretch to think they weren't offered any assistance to do so.  where were all these great country neighbors i hear about all the time?\r\n\r\nthe most i've seen reported is a fox (which is an exotic pet and shouldn't be one imo) and some chickens.  damn near anything kills chickens, so that's not a surprise. it could have been bird flu even.\r\n\r\nwho was losing money? either the RR's are so filthy rich, or they're not. make up your minds\r\n\r\nthere ARE legitimate concerns about water and continued volatile compounds at the site, but frankly, you stand next to a diesel truck for a few minutes and you're getting just as much crap in you.\r\n\r\ni mean, it's up to you what to believe, but not everything is a bloody cover up or conspiracy.  i wish you peace of mind and a good resolution to all this. i'm sure it sucks.", "Im sorry for my hostility, tbh im in a shitty mood and seeing this shit in ohio is just depressing. I just dont want people to disregard the deaths of animals such as chickens to bird flu, yes it very well could be. But look at the reports of people in the area - chickens literally dead overnight, foxes falling ill, countless fish floating down the river dead, and civillians reporting a chemical taste in the air. The plume looks post apocalyptic and it irritates when people say its just bird flu. Just lets the corporations responsible for this hide away while people debate why animals are dying whether things are safe etc. They want people to argue and there to be confusion because then they can hide behind it."], "Topic 14": ["So no one is gonna complain when the price of eggs goes back up after another bird flu cull, right?", "Bird flu screwed up prices of chicken and eggs as well. Here's an older article about it,  https://pbswisconsin.org/news-item/what-the-2022-bird-flu-outbreak-means-for-wisconsin-poultry/", "Eggs are sort of special situation, because of the Avian flu they've culled millions of chickens.\r\n\r\n36 million have been culled in 3 months. This has dramatically raised chicken and egg costs.\r\n\r\nhttps://www.vox.com/future-perfect/23053296/bird-flu-chickens-turkeys-cull-depopulation-ventilation-shutdown\r\n\r\nThis isn't to say it doesn't suck and prices aren't rising, but eggs are a special situation."], "Topic 15": ["The flu? With you working at the CDC and all you should know the flu is colloquial for influenza and the vaccine has two A strains and one B strain of the most virulent strains for the season. Some of these strains aren’t endemic. We had avian flu about a decade ago. Influenza also kills millions a year. Same with RSV in older adults and neonates. That’s why we vaccinate. Are you getting the RSV vaccine?\r\n\r\nI never said certain risk populations should not be vaccinated. I said the populace as a whole has no need. There are many coronavirus strains. They cause colds. Just like this one anymore.", "Also a lot of birds aren't available to see due to the avian flu", "Bad avian flu this year.  Nationwide shortage."], "Topic 16": ["Idk, I'd hang on to them for H5N1, at least until we have enough vaccines ready to go. Human to human transmission seems inevitable at this point, and 51 farms have already had livestock test positive for the virus.", "H5N1 may not be dead there", "Yeah H5N1 is wildly out of control everywhere. You should expect to see more dead birds, avoid them."], "Topic 17": ["Apologies for my poor grammar it must be the bird flu. Chickens are dying cause of bird flu, but the most recent deaths of chicken, foxes, fish can be explained by ground watee pollution why are u so against that possibility it completely plausible", "No offense to OP, but this post is a prime example of conspiracy thinking. I’m not calling you a conspiracy theorist, I don’t know you and I don’t know how serious you are about this idea. But I like breaking down this kind of thing…\r\n\r\n“I found a dead bird in my yard. There are no apparent injuries, so the explanation isn’t obvious.”\r\n\r\nThere’s nothing wrong with this as an observation by itself, but the next step before adopting any explanation would be to come up with a testable hypothesis. “I don’t see another explanation” is not the same thing as “there is no other explanation.” It’s called an argument from ignorance fallacy: I don’t know any other explanation, so I’ve adopted this one. \r\n\r\n“There are harmful chemicals in the air due to the East Palestine incident. Last night it rained and now there’s a dead bird. Could it be related?”\r\n\r\nAgain, as a question, there’s nothing fundamentally wrong with asking this. But a suggested explanation shouldn’t be adopted without clear evidence. “It’s possible” is not the same thing as “it’s actual.” Plus, one would need to demonstrate that a specific explanation is even possible before offering it. Has it been demonstrated to be possible for chemicals to travel from East Palestine to Dayton through clouds and rain? If it’s not shown to be possible, it’s not a candidate explanation. \r\n\r\nAnd correlation is not causation. “My rooster crowed this morning and the sun came up. My rooster must have caused the sunrise!” Two things happening near each other doesn’t mean there’s a causal link. \r\n\r\nFurther, we have a single dead bird being floated as a possible pattern. We haven’t established a pattern yet, but let’s say we did. Let’s say more dead birds are found… maybe 5, maybe 10, maybe 1000. Maybe every single bird in Ohio drops out of the sky and dies. We would still need evidence to demonstrate a link between the events in East Palestine and the death of the birds. Simply assuming or asserting a connection is not sufficient, it must be demonstrated. \r\n\r\nMaybe, as another commenter pointed out, it’s avian flu. Maybe there are toxic chemicals in the air from the train derailment AND there’s also something else killing birds. Both could be true. Conspiracy thinking tends to adopt a simple explanation quickly, without considering all options. (Simple meaning satisfying to the person; it doesn’t mean conspiracy theories can’t be complex or complicated. Look at the various features included in OP’s potential explanation)\r\n\r\nConspiracy thinkers also fixate on anomalies. They focus on specific details which stand out or don’t seem to fit, while sometimes ignoring or missing other data. There may be hundreds of living birds flying around OP’s house, but they’ve focused on the dead one. If this is done intentionally (pointing to specific examples that match the theory and ignoring examples that don’t), it’s called cherry-picking.", "I mean you could provide evidence that bird flu had nothing to do with it, but you won’t, there’s no reason to be hostile, the most likely thing is avian flu"], "Topic 18": ["With the bird flu going around I wouldn't. But that's just me lol. I joke about putting a whole one in my air fryer often but I don't think it's a good idea 🤣", "Prevailing winds are from West to East. It is highly unlikely that chemicals from the EP situation made it here. As another commenter said, bird flu is much more likely.", "Saw signs there saying they aren't doing it this year due to bird flu"], "Topic 19": ["Didn't they have to cull like, millions of chicken due to some strain of avian flu?", "From what I heard, there's been an avian flu outbreak and a lot of chickens were culled to prevent the entire population from dying out."]}