{"Topic 1": ["When raising chickens for consumption in Europe, they don't do some of the things we do over here. They are required to clean out the chicken barn between rounds of rearing chickens, we just throw the chickens in on top of the excrement the last batch left.  \r\nWhen we do clean out the barns, we feed the crap left behind to the cows, who are literally eating chicken crap, and we wonder why bird flu is showing up in the milk.  \r\nAnything for cheap wings I guess.", "We as a country allow the practice. How do you think the cows are getting bird flu?\r\nSome agriculture practices are better than others. Not everyone farms to the lowest common denominator, but some do.\r\n\r\nIt’s not best practice to regrind old meat with fresh meat and sell it as hamburger, but it got done a lot until people started dying of e.coli and HUS syndrome.", "The price of eggs has gone up due to outbreaks of avian flu in chickens.  Even if only one chicken tests positive for avian flu they have to kill the entire flock.  This has caused a big reduction in egg production.\r\n\r\nI haven't been to our local Wegmans here in NC recently to see if they've raised the price here again.  The last time we went there, which was before Christmas, the 18 count eggs were 2/$8.  2/$14 sounds about right compared to other stores in my area.  Our local Food Lion is selling 18 count eggs for $7.49.  A dozen is $5.19.", "We culled 49 million chickens last year. \r\n\r\nThat's 49,000,000 chickens that were killed, and discarded. \r\n\r\nWe didn't eat their meat, they aren't laying eggs. They're just rotting in a landfill. Avian flu tore through the barns like nobody's business. Its why the cheap eggs are gone and the more expensive eggs are roughly the same price - because they had less loss due to better animal husbandry and reduced spread of disease.", "We don’t eat the egg laying chickens. Different farms. The egg layers aren’t being hit as hard by the avian flu.", "You can also find an open letter from the CEO of Exxon to Joe Biden basically saying that they're never expanding refinery capacity unless the federal government pays to build it for them.    \r\n\r\n&amp;nbsp;   \r\nThe company that owns Eggland's Best, Land o' Lakes, and a bunch of other companies is jacking up egg prices despite not being affected by avian flu, because they can.    \r\n\r\n&amp;nbsp;  \r\n\r\n\r\nIt really isn't good that we have companies that can essentially punish the electorate for voting in politicians they don't like.  Someone should really do something about that.", "So you think the culling of millions of egg laying chickens in response to the worse avian flu outbreak this country has seen is a scam?", "Wages have increased, as well as supply chain costs. You might've missed that an avian flu wiped out millions of birds? Prices rise on variable other than wages. I know that's hard to comprehend simply than bemoaning \"greed\".", "I agree. Factory farming is painful and brutal. The USA goes out of its way to hide it with AG gag laws. It’s not small farms. Corporations. \r\nI’m not against hunting as people are then out of the brutal pain of factory farms. The avian flu in cows is definitely a wake up call.", "Imagine if you will when a gallon of gas costs over $5.00 per gallon and you have to go see a gastro specialist at Temple University twice a month and you live over two hours away.  \r\n\r\nNow imagine further you have to go to the doctors office 3-4 times a week.  The office is about 13 miles away.\r\n\r\nOh yea can't forget about the bills....  PP&amp;L rates have almost doubled, and even the chicken and eggs you buy have gone up in price because of the Avian Influenza.  Luckily your lease is locked in, and now your vehicle needs 4 tires and a control arm for inspection.\r\n\r\nOh yea almost forgot have to arrange a graduation party for your son...\r\n\r\nImagine doing that on only $3000 total....  Welcome to my world 🌎🌎🌎", "Avian influenza is hitting a lot of egg producers. Prices and shortages are going to continue to rise for a while still.", "Yes, there is a huge problem with birds dying from bird flu right now, which is also why eggs are so expensive, leading to higher breakfast prices too.", "People keep mentioning wing prices there is a massive avian bird flu going on and they are slaughtering chickens to slow the spread. This is why most places are charging market prices. I frequently eat at PAPA rocks In haymaker. Great food and the pricing has not really changed since the pandemic started. That being said the wing pricing was the only thing on the menu that did change, it went from 12 bucks for a dozen to like 15 or 17 and they have really good wings not whole wings but still really good. As for over priced and not good pizza caliente pizza is over priced and there pizza is mediocre to say the least.", "This absolutely isn't the cost with Eggs. And wasn't the cost with natural gas. Those were supply-side forces driven by bird flu and the Ukrainian War, respectively. Gasoline, on the other hand, did have a disproportionate cost against supply.\r\n\r\nWhile gasoline is a good example of this, not *everything* is corporate greed. Sometimes it's just market forces.", "Small flock egg farmer here with a lot of research into the industry. 100% price gouging happening here. Bird flu only effected 6% of the laying hen market at any time. Feed costs were up about 20% in 2021 but have largely stabilized since. Prices for eggs have gone up, on average, about 100% since 2021. Explain how that isn’t gouging?", "I mean, I am; others said it better elsewhere on this thread, but it's more environmentally conscious, less cruel to living animals, less likely to be contaminated (see: the bird flu ravaging dairy cattle in TX and OK, mad cow disease, salmonella in chickens and eggs, and a whole host of other issues) and very likely to be much cheaper for the majority of Americans (I'm sure that 'real' meat will still be around as a luxury item, though).  Whenever we set up bases / colonies off earth, we could have 'fresh' meat without having to ship and care for the animals en route or at the far end.\r\n\r\nAlso, as a long-term science fiction nerd, I just think it's cool as hell.", "Damn that avian flu caused egg prices to soar so much even KDKA out here tryna finesse some eggs…", "That price gouging ripples down the supply chain, though.    \r\n\r\n&amp;nbsp;  \r\n\r\nExample:  \r\nDuring the avian flu stuff Cal-Maine, a company that has cornered a huge segment of the egg market in the US, raised prices immensely to price gouge *despite not really being affected by the avian flu*.   This resulted in a 700%+ increase in profits for Cal-Maine.    \r\nhttps://www.businesswire.com/news/home/20221228005357/en/Cal-Maine-Foods-Reports-Record-Results-for-Second-Quarter-Fiscal-2023   \r\n&amp;nbsp;  \r\nThis price gouging up the supply chain directly impacted the bottom line for breakfast restaurants at the bottom of the chain, who were forced to cut into or negate their entire profit margin so that companies like Cal-Maine could post record profits.   \r\nhttps://www.cbsnews.com/pittsburgh/news/restaurant-owners-feeling-the-pinch-as-egg-prices-continue-to-dramatically-rise/   \r\n\r\n&amp;nbsp;  \r\nIt's all dogs eating other dogs all the way down.", "Well since the Avian Flu is threatening large portions of our livestock (and maybe us next) and nothing is really being done quickly about it, maybe it's something that should be looked into. It would be way better for the environment, better for animals, and at this rate, better for our health since factory farming is so disgusting.", "Factory farms are why I'm off chicken.   \r\nI'm not vegan or anything, but I don't eat birds. I'm convinced our chicken farms are our versions of \"wet markets\" and the next pandemic will be an avian flu and come out of Iowa.", "While it's *possible* that there is unethical gouging of egg prices going on, I haven't seen any evidence for it, only claims. I *have* seen evidence for tens of millions of birds being killed due to HPAI, so I am inclined to believe that until otherwise.\r\n\r\nI would be curious to see data of bird population against egg prices; I'd expect only a short speculation period when supply dropped (because eggs go bad), so if prices continue to rise disproportionate to culling effects, then I might start believing the corporate conspiracy theory.", "From what I have [read](www.cnbc.com/2022/11/11/why-egg-prices-are-surging-but-chicken-prices-are-falling.html) it is a confluence of a few factors:\r\n\r\n* Around 35 million layers have died, which is around 10% the population\r\n* HPAI is mostly affecting layers\r\n* This led to a supply problem with eggs; to meet demand, eggs need to be shipped further,\r\n* Shipping is still recovering from COVID, meaning the increased shipping costs (gas prices and wages) increase egg prices further,\r\n* Inflation is around 8-10% so any increases in the price are in addition to already spiking prices\r\n* Holiday is peak use time for eggs\r\n\r\nThere's certainly the potential for gouging on the tail of this HPAI wave and the holidays. But we would expect to see prices continue to rise while holiday demand and HPAI supply issues level out. I haven't seen any evidence of that. Certainly not enough to say that the increases are \"100% price gouging.\"", "Recent bird flu epidemic caused prices to shoot up as well.", "There was an issue recently that caused them to spike. A few months ago they were roughly the same price as I've always paid. \r\n\r\nI think that avian flu that's going around hurt lots of chicken farms n", "This is the primary driver for inflation in chicken prices. Due to avian flu we are culling millions of chickens. https://www.google.com/amp/s/amp.theguardian.com/science/2022/apr/28/egg-factory-avian-flu-chickens-culled-workers-fired-iowa"], "Topic 2": ["SB 979 is super important with bird flu popping up in cows now.", "Absolutely stupid and dangerous to consume raw cows milk products right now with bird flu being found in like, all of our dairy supply. It is legal though, as long as they have a permit.", "Yeah I wouldn’t drink it because there’s a strain of bird flu that has been spreading to cow herds throughout the US.   Pasteurization makes the milk products safe from this, but raw milk will spread it.", "Yeah but be clear pasteurization makes milk from cows carrying bird flu safe to drink.  It’s not in all the dairy supply, but rather in a few different herds in a few different states.", "For real yo! 20% of tested dairy products in the USA now contain bio markers from the animals having bird flu. A couple of smaller South American countries have just banned the import of dairy from the USA. Do t worry though, the FDA says if it’s homogenized that there is nothing to worry about. Considering the money tied up in this industry and the liars that make up the FDA, I’m quitting dairy for a while.", "Probably need to rethink the selling for animals as well. The bird flu in raw milk has already killed several cats. \r\n\r\nhttps://thehill.com/homenews/administration/4636692-cats-died-after-drinking-raw-milk-from-cows-infected-with-bird-flu-cdc/\r\n\r\nhttps://www.cbsnews.com/news/cats-died-after-drinking-milk-bird-flu-infected-cows/", "Does boiling? I've been wanting to get more into cheese making, and the form of cheese that I make involves boiling the milk. But if the milk has been hyper pasteurized it doesn't boil and curdle the way you need to for cheese. And unfortunately, it does not say on the label if it has been hyper pasteurized or singular pasteurized. So I was thinking if possibly getting unpasteurized milk for the cheese, but if it's not going to kill viruses like bird flu then it's not worth it.", "that is a very specific example of a zoonotic disease that didn't kill people, which is fantastic \r\n\r\nthat said, we still have to worry about Bird Flu, TB, Brucellosis, and other diseases that can be passed through unpasteurized milk ....", "They are finding remnants of the bird flu virus in pasteurized milk right now.  It hasn’t jumped to humans yet but if it mutates and makes the jump to pigs, we are next.  I strongly recommend not consuming raw milk. If bird flu makes the jump to humans it will be catastrophic", "With Bird Flu on the rise in cows on top of salmonella, I would steer clear. It’s usually safe for animals but some human think it’s healthy", "A week or so ago, there were a bunch of news articles about how fragments of the bird flu virus were found in pasteurized milk across many states. So the virus in milk is more widespread than a couple herds in 3 states BUT the pasteurization process kills it so the pasteurized milk is safe. I think that's what the person you were talking to meant, not that active bird flu was in milk in PA.", "Just as bird flu starts to make ground with dairy cows? Unpasteurized milk is one of the few ways to get it outside handling the cows themselves.", "People are literally buying up all the raw milk so they can “immunize” themselves against bird flu.  They are so fucking stupid.", "&gt;Also what is the common threat to people near people who drink raw milk? Almost nothing if not absolutely nothing. \r\n\r\nBird Flu, which is now in our cattle, and spreadable to the rest of the population.", "Are aware of the avian influenza epidemic in cattle?    Drinking unpasteurized milk could allow H5N1 to infect a human being and could start an epidemic amongst humans.", "You need to be a daredevil to drink unpasteurized milk right now.  H5N1 is a real risk.", "Thank you for bringing up the cheese in your final point, sincerely. I am a big fan of cheese in general. Somehow of late, that fact has gotten me pulled in alongside raw milk drinkers and I'm like? I've straight up avoided any and all raw dairy products since the news broke ago about H5N1, please tell me y'all aren't STILL drinking raw milk out here...\r\n\r\nI'm not sure if the 60+ day aged cheeses are as safe to eat as pasteurized dairy right now in terms of this virus, but genuinely, doesn't feel worth the risk.", "No yeah, fellow raw cheese enjoyer here. So in the US, the aging process takes care of basically 99% of what could kill you from what I understand as a pure, layman consumer.\r\n\r\nBut what I haven't gotten is reputable confirmation on is whether those 60+ day aged raw cheeses are safe to consume with H5N1 present in our cattle stock. So I've (sadly) avoided picking any up the past few grocery runs. Not worth the risk.", "What you linked:  \r\n\r\n&gt;Additionally, as a reminder, while CDC believes the current risk of A(H5N1) infection to the general public remains low, high levels of A(H5N1) virus have been found in unpasteurized (“raw”) milk. CDC and FDA recommend against the consumption of raw milk or raw milk products. The risk of human infection from drinking raw milk containing live A(H5N1) virus specifically is unknown.", "Show me where there has been a tranmission through the gut from raw milk in that study?\r\n\r\nHow many Amish have bird flu?\r\n\r\nOhhh that's right. Zero.", "There was bird flu transmission to cows which also spurred the emphasis on pasteurization.", "Okay, all for personal freedoms until it hurts someone else. Have you heard of bird flu? It’s how the world ends. Maybe quit the dairy for a bit. We don’t need this becoming endemic."], "Topic 3": ["Correct, from what I've read, avian flu is much less likely to affect songbirds.  Now I guess if you bring hawks and eagles into your feeders....", "Pa Game Commission had no official statement on Avian Bird Flu and bird feeders. They had a statement last year to take them down, which was for an unrelated and mysterious disease that has not been released to the public, and I haven't heard anything about from wildlife friends either. \r\n\r\nThe source I posted is the Cornell University. They are known for their outreach for birds. \r\n\r\nThe PA Game Commission does not have a page related to Avian Bird Flu, but they have done public interviews saying that bird feeders are low risk-\r\n\r\nhttps://www.fox43.com/amp/article/news/local/avian-flu-bird-feeder-safety-pennsylvania/521-c79f8119-d9cb-4784-8fd9-ade39bcb914f\r\n\r\n\"While feeders do lead to a congregation of wild birds, feeding isn't considered a significant HPAI driver,\" said Travis Lau, the communications director for the Pennsylvania Game Commission. \"The birds most affected don't often visit feeders.\"\r\n\r\nAlso, vultures do not visit bird feeders either, nor are they closely related to song birds. If anything, they may be feasting on dead and dying backyard and/or large farm chickens not properly disposed of that are carrying Avian Flu, which would be a much bigger concern because chickens, like many fowl, are very susceptible to it. Lancaster County has been hit bad by Avian Flu because of all the chicken farms there.", "If you're referring to the mystery ailment around the time of The Cicadening, that warning was lifted last autumn. If you're referring to bird flu, [PA Game Commission says just clean your feeders as often as you can](https://www.pgc.pa.gov/Wildlife/WildlifeHealth/Pages/AvianInfluenza.aspx).", "Hi! I am going to say this - I am guessing the article is about the bird flu. I am keeping up on this because I have chickens. Give me a couple seconds and I’ll come back after reading the article. \r\n\r\nBut before I do, the person didn’t say anything about cats giving birds a disease. Rather, outdoor cats kill birds. To the point where they no longer exist in an area or want to live in that area. Also, that cats should be kept indoors, which I agree with (So do High Queen Margo the Destroyer and Jack 🐱).\r\n\r\nEdit: fucking fantastic, not the bird flu. Another thing to be on the look out for, “conjunctivitis or neurological problems”. Charlotte Roost, Hen Solo, the others, and me, thank you for sharing this info. I wish the article stated what it was, I assume virus? For bird flu, they suggest putting a cover/tarp over the run so that flying birds bird poop doesn’t get in the run, and also not letting the chickens out of the run (so many chickens screaming and yelling at me at the beginning of this summer for not letting them out). Ugh. Again, thank you for sharing this article. Hopefully the cats don’t eat these birds because, oof.. wild.", "The thing about Avian Flu is that it really doesn't impact song birds at bird feeders, so bird feeders are considered low risk for Avian Flu. They don't even transmit it easily. The big group it does is waterfowl, which aren't big on bird feeders, but people still feed them at the park.\r\n\r\nhttps://www.allaboutbirds.org/news/avian-influenza-outbreak-should-you-take-down-your-bird-feeders/", "About 100 black vultures dies of avian flu over in Lancaster county this year. They aren't waterfowl or song birds but the visitors to bird feeders don't have to be either. My mother loves feeding birds until she realizes she set up a hawk feeder.\r\n\r\nAlso, your article says no officials stated to removed bird feeders to help stops the spread. The pa Game Commission as well as many other state wildlife agencies all said to do just that.", "Met with a biologist from the Game Commission, who said I wouldn’t have a definite answer for awhile, unfortunately. \r\n\r\nHowever, he didn’t seemed to think it was the avian flu… he bet that either someone sprinkled rat poison &amp; spoiled their food source, or it was a mating pair that got into a fight with another pair of birds over territory.\r\n\r\nI’m currently speaking with management of my apartment building to see if they can use another method of pest control that won’t harm the owls.", "Contact the game commission if you come across another dead raptor. They seem to be more susceptible to the current HPAI strains than other birds, from what I understand.", "HPAI is likely to be an issue again this summer at bird feeders.  Please make sure to regularly disinfect your feeders and pay attention to the Game Commission and Health Department for updates pertaining to the potential dangers of leaving up a bird feeder this summer &lt;3"], "Topic 4": ["They want the bird flu in there.  They think it will make them immune to it.  Idiots falling prey to conspiracies.", "Technically they are right, bird flu can't infect you further if you are already dead from it.\r\n\r\nAll true Trump voters know this one weird trick for outsmarting Fauci!", "All I learned from the pandemic is that if we ever get a super deadly bird flu or something, a quarter of the country might get themselves killed just to prove a very dumb/incorrect point.", "Public health is everyone’s concern.  Idiots are trying to infect themselves with bird flu.  Before you know it, we’ll have human to human transmission and then that’s it.  A deadly flu pandemic is on the horizon.  Influenza is far worse than covid.", "That man, while doing a valuable public service, singlehandedly killed the pretzel industry.\r\n\r\nI don't even give a fuck if I get avian flu from birds pecking at them either. \r\n\r\nIce cold coke and a piss pretzel. \r\n\r\nNothing better.", "Yeah yeah and the same media sensationalism said Trump was the end of the world, just like they said about GWB, the hole in the ozone layer, ISIS, the bird flu, etc. Yet we're still here", "It's going to be hard to blame a viral bird flu on Joe Biden, I think."], "Topic 5": ["Again with the avian flu?", "Possibly avian flu; don’t handle and maybe report", "It was some kind of avian flu not corona. But yea", "Don't touch and report them. Could be Avian Flu or West Nile.", "Avian flu… CDC wants people to report it.\r\n\r\nCall PA ag office, apparently. \r\n\r\nhttps://triblive.com/local/regional/avian-flu-cases-on-rise-in-pa-officials-ask-public-to-report-dead-birds/#:~:text=Sick%20or%20dead%20domestic%20birds,at%20877%2D724%2D3258.", "Bird Flu Type C?", "Coronaviruses have been around for many decades. I’m sure more “bird” flu strains will just happened to pop up too."], "Topic 6": ["You explained why you don't like the aviary, but why not the zoo?\r\n\r\nAlso, animals do cycle through exhibits and may have to be taken off exhibit. Many birds are not in outdoor exhibits right now due to avian flu too. And lastly... Animals hide and need privacy. They may be in there, just hiding away though.", "The only thing I'll add regarding the zoo; I don't know if this'll be true depending on how early in April that OP is going to visit, but they have no birds outside. No eagles, flamingos, penguins, emus, not even the wandering peacocks. The indoor bird exhibit is closed. Signs say it's due to strains of bird flu found in other parts of the US.\r\n\r\nSo not really a huge deal but we went last week and it was a bummer to not see the eagles.", "Pretty sure I saw a dead baby bird sometime a week or two ago so not sure it’s related to that. Maybe the avian flu going around? Lots of avian zoo exhibits closed to keep them isolated from the wild birds because of it.", "This wasn’t the answer though. We went in 2021 when all the outside birds were first brought inside. It was because of avian flu. I think the birds died or they got rid of them. They had new meerkats recently and they also all died from some mysterious virus. The bears are leaving this year as well. I just don’t think the people there upkeep anymore.", "Avian flu is more likely the reason (the Zoo had signs posted all over last weekend explaining this). Migration season and erratic climate also doesn't help.", "Unfortunately all the trails in the area are closed right now due to avian flu outbreak. You can still watch the eagles hunt though. I was just there this morning lol."], "Topic 7": ["Good old bird flu. Those birds need the damn vaccine. Big Pharma got this 🤪💉🤣", "Well if you don’t want to get bird flu from the chicken…", "Do you want bird flu? Because that's how you get bird flu", "Oh you wish\r\n\r\nI joined a chicken group on Facebook(yea yea I know, moving on) cuz I was thinking about getting a couple a while ago, and when the avian flu shit went down initially everybody was screaming their heads off about it being a false flag government control thing.", "*opens backpack*\r\n\r\n\"I got your covid vax, your monkeypox, bird flu, swine flu, ebola, ubola, polio, rabies, scabies, measles, mumps... whatever fix you need boss\""], "Topic 8": ["Edit: so bird flu unfortunately represents only one issue here.", "And never mind that pesky bird flu.", "Just wait for the cold+ pink eye = Bird Flu.", "There's bird flu, you shouldn't have one up."], "Topic 9": ["It helps spread disease like avian flu between species that would only interact at your feeder.", "Unfortunately, bird feeders are really spreading bird flu in the wild populations.", "https://whyy.org/articles/how-backyard-chicken-owners-are-protecting-their-flocks-from-the-deadly-avian-flu-outbreak/\r\n\r\nThe bird flu has been spreading in Europe the past couple of years and is now very much here. This article says PA has 2nd highest number of affected birds in the country.", "The huge captive factory farm bird populations  are what allows bird flu to take hold."], "Topic 10": ["The H5N1 looks like no joke when it comes to avian flu.", "H5N1 is going to make quick work of a loooooooot of people lol", "Ahh, what‘s a little H5N1 flu virus?", "Keep your eye on the H5N1 subs"], "Topic 11": ["You make a good point. There’s no objectively correct answer to the question of how far the government should go in curbing people’s freedoms in the face of disease outbreaks. Most people agree that short term restrictions are appropriate to save lives. \r\n\r\nIn the case we’re talking about here I think it’s important to remember that person to person transmission of avian flu is rare. \r\n\r\nAn uptick of avian flu is certainly something that folks should consider when deciding whether or not to purchase raw milk but I don’t think we’re at the point where it’s appropriate to ban it. At least not personally.", "Agreed. Plus more activist type communities should be supporting health, prevention, and mitigation of their true to their inclusive morals. Asking people to wear a mask for an hour or two is not a big deal and would keep the band safer and everyone else safe. Wish I had known about this before they dropped the reqs. There is so much misinformation, denial, and apathy in these comments alone regarding covid, masks, and vaccines in general, and we wonder why people are sicker longer and more often, why people are flakier, angrier, more impulsive. Our own gov and health authorities are letting us down, public health has become individualized and politicized. We’re on the brink of Avian Flu which is even deadlier jumping to humans, and it all boils down to cognitive dissonance, laziness, and the refusal to do something mildly inconvenient for a short period of time. This timeline sucks.", "I don't see how my comment lacked nuance, but let me try again...\r\n\r\nThe real problem is that COVID is not a *major* virus, but it's also not a *minor* virus. A *major* viral pandemic would be something like H5N1 (the one most of us in the research community have been worried about for the last decade-and-a-half). The case fatality rate of H5N1 is close to 60%...so we wouldn't be talking about millions of dead, but more like *billions* of dead.\r\n\r\nAt the same time, COVID's case fatality rate is still greater than *literally any other currently circulating disease*. It's greater than HIV (with modern treatments). Without vaccination it's greater than malaria. Even *with* vaccination it's in the same ballpark as malaria, and malaria has a much more limited range. 2 years into the pandemic, and the statistics just recently released show that for those age 45-54, COVID was the leading cause of death in the US...more than cancer, more than heart disease, more than car accidents.\r\n\r\nSo, calling COVID \"minor\" depends heavily on how you define that term. If I asked you if a 1% case fatality rate was \"minor\", maybe you'd say yes. In that case, COVID, at a case fatality rate of somewhere between 0.1% and 0.05% would qualify as \"minor\".\r\n\r\nBut would you call the communicable disease with the highest case fatality rate of any disease currently circulating in the human population \"minor\"?\r\n\r\n...I guess it's all relative.", "Not immunocompromised but yes still cautious.  The amount of dead birds has us concerned about h5n1 as well.  I've never really cared if people wear masks in public, people do it all over the world it's only odd in America because people politicized it."], "Topic 12": ["If the bird flu hits hard again, we will look back at this and say that we were warned.", "is this good or bad for bird flu", "It’s probably fine, just be careful of bird flu", " Must be the bird flu going around.  Google it ,it was here last year it not as bad"], "Topic 13": ["Can hummers spread bird flu?\r\n\r\nI wanna hang out my sugar feeders but I don't want the virus to spread.", "Please do not get a bird feeder right now due to the very serious bird flu that is decimating birds in the US. If you have a feeder, please take it down for now", "Remember the order to take down bird feeders to combat avian flu? 4D chess. The lantern flies are their new feeders.\r\n\r\nSTRIKE, MY FEATHERED FRIENDS! DRIVE THEM OUR LANDS! *Please? I'll get y'all a nice suet cake in reward.*"], "Topic 14": ["i don't know who is responsible for testing dead birds for bird flu, but i think you did the right thing trying to find the person. Hopefully someone knows, because this should be checked out, even if it turns out to be nothing to worry about (like flying into windows or something)", "Confirmed bird flu in our area. NJ has confirmed cases of this atleast I’m sure it’s in Philly as well", "My dad has been in Abington's ER for almost 48 hours now. Docs keep saying they're gonna admit him and take him upstairs, but the inn is still full I guess. \r\n\r\nWear your masks, influenza A (aka Bird Flu) is apparently kicking the region's ass right now."], "Topic 15": ["H5N1 is killing birds and other wildlife all over the world. Keep your cats and dogs away. I’ve seen news articles about both getting H5N1 from sick birds and dying. It also has like a 50% mortality rate in humans if you manage to get it. So don’t touch the dead birds.", "Ugh yes h5n1 has also been on my radar. Have you seen a lot of dead birds around Erie?  Masking is such an easy thing to do to mitigate the spread of many different diseases, I hate that it became politicized instead of normalized.", "Ugh that’s really concerning. Is anyone monitoring the wildlife around here in any capacity to determine if h5n1 is the cause?  \r\n\r\nYeah I am in the same boat. I just mind my own business and leave people alone and that is generally reciprocated. I’ve only been bothered about masking once and I wasn’t even in Erie when it happened. People here don’t seem to care too much, but I also don’t take go many places to test that out haha"], "Topic 16": ["See if you can find a local farmer. The giant aggro corps have been hit hard by the bird flu", "you may not want to do a feeder during this Bird Flu pandemic."]}