{"Topic 1": ["I don't know if you've been paying attention but we're kind of in the middle of a giant multi-generational societal collapse.\r\n\r\nAnd there isn't just one singular cause of it, it's multi-systemic, though a major root of the problem is \"capitalism\" and the way it sets up society in an exploitative and alienating fashion. Over the past roughly half a century or so in America, but elsewhere as well, we've seen this accelerate. There have been some partial advancements here and there, but we've also seen massive increases in inequality; massive growth of unchecked power of the wealthy and powerful; demonization of the poor and the sick; destruction of community and increasing alienation; and so on.\r\n\r\nThis whole crisis has accelerated substantially over the last decade and continues to ramp up year over year. You have massive assaults on civil liberties and free expression; on the concept of an open and inclusive society; on the very foundations of democracy. In the US we have seen this very clearly with the GOP making a long-term play to undermine democracy in multiple ways. First through the use of gerrymandering and voter suppression at the state level, then even more extreme measures culminating with a half-organized attempt to execute a coup last year. And all of this may sound far fetched and unbelievable but this is the reality of the world we live in, and it doesn't change being real just because it sounds extreme, it *is* extreme, but it's the truth. The truths of project REDMAP and of *intentional* voter suppression are well documented, even The Economist downgraded the US to a \"flawed democracy\". And this is part of a larger trend across the world, a world where democracy is a shadow of what it was and where most major world powers are controlled by aggressive extremists is very much a possibility in the next few years.\r\n\r\nMeanwhile, the governments and institutions that exist at present are today substantially in crisis. Many of them are crumbling or being actively deconstructed by powerful hostile forces. Many of them do not serve the public interest well, many of them are corrupt, many of them have shown that they are not up to the challenge of the present moment. In the 20th century there were many, many challenges that society faced but even though there were many failures there were also many successes. In 1900 the average American didn't have indoor plumbing or electricity, antibiotics didn't exist, and you had a pretty iffy chance of even surviving to adulthood due to the omnipresence of different diseases and environmental hazards, but there were vast improvements over the 20th century. Lately we've been coasting on those gains and ignoring the continuing work that needs to be done.\r\n\r\nToday we are faced with innumerable other crises that require enormous civilizational level investments to tackle but the elites and the powerful are largely not on board with putting in the work. We have numerous ways in which things like our land and water use and the way we grow food are not sustainable. And this has been a crisis brewing from well over a century ago. In the American Southwest water use has never been sustainable, and it's been clear that we are just operating on borrowed time. And yet despite that obviousness and the fact that the systems we put in place to manage those resources have been obviously broken and obviously corrupt for *decades* we haven't put in the work to tackle those problems. Those in power have largely been complacent, hoping that the disaster will blow up in the next generation's face instead of theirs. Well, we're finally getting to that blow up.\r\n\r\nThis is, of course, hugely compounded by climate change. Another slow rolling disaster which was apparent on the horizon even in the mid-20th century but has been met consistently mostly by complacency by our power structures and governments. Which isn't to say that we haven't made some progress on it, but we haven't made anywhere near enough. Either in terms of the damage to the environment that is done by our activities or to building a society and an economy that is resilient to the inevitable damage that will result from climate change. And now those chickens are coming home to roost. We are seeing decade by decade, year by year, day by day, and hour by hour how these hypotheticals and these predictions for \"the future\" are translating into practicals for the present. We have experienced smoke season year after year in Seattle (which, illustratively, is the result of a combination of the impact of climate change making wildfires more severe and harder to control along with poor land management). Last year we had the life threatening period of the heat dome in the PNW, a story that we are now watching play out elsewhere across the globe in different areas and different times year after year (this year it's India/Pakistan and then the middle east, though now there's a crazy series of heat waves in the midwest and northeast). We've watched the looming drought develop in California and the Southwest. We've watched the record breaking floods and tornadoes and hurricanes. We recognize fully that we are in that shitty part of the post-apocalyptic movie during the starting credits where news stories are playing and explaining how the apocalypse began and we don't like that feeling at all.\r\n\r\nAnd we see the same pattern. The public is overwhelmingly onboard with dedicating sufficient resources to tackle these problems like any responsible civilization should. And yet, our government continues to do next to nothing, in stark repudiation of the public will and public *necessity*. This is not a tenable situation.\r\n\r\nThen we have the pandemic (for future readers this refers to covid-19, not bird flu or monkeypox), which has been mishandled by most governments of most developed countries. It's great that we got vaccines fairly quickly but that's not enough, what we needed was more societal support for public health. We needed people to understand that when it was necessary to do large scale lockdowns they would be married with support (in the form of food and other vital services and potentially housing as well) for the duration necessary. We needed to be able to have a society that drove down disease incidence to a level where it could then be kept under control through track and trace efforts, the way many other dangerous infectious diseases are. But we didn't get that. Instead we got a chaotic piecemeal approach that left us with a combination of years of partially enforced and partially effective restrictions and years of wave after wave after wave of disease.\r\n\r\nAnd I haven't even covered America's policing crisis. Folks have awareness of all of these things whether they understand their causes and details or not. People perceive the alienation and the hatred that has been fermented and fomented in America for decades. We live in a culture that produces suicide murderers as a casual byproduct. These are just an everyday occurrence in America which don't even ping the radar unless more than a handful of people die. Our society is sick on a grand scale, and these are the obvious symptoms of it. Individually we might be able to protect ourselves against this sickness through robust support networks made up of our friends, family, coworkers, maybe our personal wealth, etc, but for those without such physical or interpersonal resources to fall back on there is no protection from the reality that we live in a harsh dehumanizing hellscape.\r\n\r\nMeanwhile, all of these vast global level crises (the climate disaster, the pandemic, the war in Ukraine, the threat of WW3, etc.) causes people to think more deeply about value and meaning in their own lives. They step back and realize that they have substantially been abused and misused by society and specifically by our economic system. We work in demoralizing jobs that give us limited autonomy and limited slivers of time in which to be ourselves and to properly live. And we don't like it. We wonder \"what's the fucking point of spending all this time working for others just to pay rent and feed ourselves when the apocalypse is looming\". And that forces us to re-evaluate the value of everything we do or are forced to do regardless of how closely the threat of death and destruction looms, because everyone of us will die eventually, and whether that's next year or a few decades away the question of how we spend that precious coin of the time we have to live is still critically important. Increasingly people have been unsatisfied not just with how they are spending their time but more so with the options given to them. It used to be that it was much easier to make some sacrifices in terms of your standard of living to open up opportunities for making big changes in your life (going to school to change careers or pursuing personal projects or simply giving yourself more free time and more autonomy by living more humbly) but slowly year by year those opportunities have been swept away and lost for average folks. Increasingly people have gotten locked into lives they have limited control over. You can't change careers or take a break because you're saddled with student loan debt or high rent. And increasingly people end up stuck in lives where they just wonder what the point of even existing is. When you see horrors happening routinely (race massacres in US cities, crimes against humanity in Ukraine, the climate apocalypse looming, the rollback of civil rights, a million Americans dead from covid, etc.) you really start to question the value of the life you're living right now and what it even means to live a rewarding life and you start to wonder how doing so in the near-future is going to even be possible for you and your loved ones.\r\n\r\nPlus it's been extra gloomy in Seattle far later in the year than normal, and that always lowers people's spirits a little.", "They gassed like 50 million chickens and turkeys this month for bird flu, are the thinking people going to attend to that?", "Chicken prices are up something like 30% since the first of the year due to bird flu killing 100+ million chickens in the US alone.", "Bird flu is leading to farmers having to kill tens of thousands of birds so Chicken is going to be expensive for quite a while", "Bird Flu is causing prices to rise.", "You have to be aware there is a bird flu epidemic that is killing entire flocks of chickens. The epidemic is destroying poultry operations. It is transmitted from farm to farm by wild bird that visit the chickens and leave droppings behind.", "They should be.  I live in East King County where backyard chicken flocks for personal egg consumption are normal and the buzz about chickens has been the bird flu.  If someone loses a laying hen it's not being replaced anytime soon thanks to the bird flu as everyone is hording their laying hens.  I've even seen some people get a rooster, when available, with the hope that they can make their flocks self-sustaining for a little while.\r\n\r\nKeep in mind too that it's winter so laying hens are producing fewer eggs as well.  So there are multiple pressures driving up egg prices which has to extend to farmer's markets.", "To be fair, organic is just a marketing gimmick. If the cost gets over what you want to pay just buy conventional. Both are safe or they wouldn’t be on the shelf.\r\n\r\nI have family that supply agricultural products to farmers here in WA. Legally organic just means “use pesticides from the 70s” more or less, and some of that junk needs to be used way more frequently and is way more toxic than the kinds developed over the last 50years or so.\r\n\r\nAs others have said, this example is due to bird flu.", "Turns out there's an egg shortage all over. They're slaughtering whole county's worth of flocks over bird flu.", "Bird Flu has make chicken significantly more expensive.  Withthat in mind it would seem unlimited chicken anything would be eliminated as a result.", "The shortage is due to bird flu", "Something like 50 million chickens have died of bird flu. How could that not create a shortage?", "Hey dude, I'm not your bro... \r\n\r\nIt was only a matter of time before someone that wasn't \"a nauseatingly educated lib\" like myself was going to ask the question \"why are eggs so scarce and expensive?\".\r\n\r\nAlso broheim, because of the bird flu who's stupid enough to give up leads. No one knows when the \"bird flu\" will subside.\r\n\r\n\r\nEdit: my spel1ng arrer  has ben corected. Thanks u/Visual-Beginning9814", "Egg prices have skyrocketed due to a mass culling of chickens caused by bird flu. It's not Beth's or even inflation's fault.", "I mean sure, I don't disagree with that, but also there's 40+ million fewer chickens laying eggs in America due to bird flu.", "Mass inflation, a global pandemic, corporate greed, a few wars, roe v Wade getting overturned, mass shootings basically daily, bird flu killing a bunch of chicken, Airbnb's and the rich buying apartments and raising rent\r\n\r\nOh wait that's just the past few years", "Bird flu has to be factoring into this and egg prices, right?", "We've dealt with bird flu before and it was never this bad. These price raises are just profiteering.", "The bird flu mostly affected laying hens because those chickens take longer to mature before they can produce eggs. Chicken for meat is ready for butchering 9 months after the egg hatches.", "Egg prices are from bird flu.", "Yes bird flu... A small reduction in supply and yet profits up 600%? I'm saying these are all cases of \"never let a crisis go to waste\" followed by gouging. Corporations are flexing their power and hiding behind this stuff.\r\n\r\n\r\nhttps://www.reuters.com/business/retail-consumer/us-lawmakers-seek-answers-egg-companies-record-high-prices-2023-02-16", "Fresh Del Monte and Pilgrims Pride have not posted particularly favorable profit margins lately, granted.  BASF is primarily a chemical producer, so I'm not sure how they're relevant here?\r\n\r\nLooking at the others:\r\n\r\nIf memory serves, Tyson Foods is a major producer of poultry, so they would have been impacted by the bird flu.  I suspect that this is at least part of the cause of the steep drop-off in all three of their profit categories (gross, operating, net) after the quarter ending June 2022.  Prior to that, they posted three consecutive quarters of record-high net profit, and four consecutive quarters of record-high operating and gross profit.\r\n\r\n* https://www.macrotrends.net/stocks/charts/TSN/tyson-foods/profit-margins\r\n\r\nYour General Mills link actually shows that net profit has been broadly rising since May 2015, with a more definite growth trend since February 2019.  Net profit has been at historically high levels above 14% since May 2022.\r\n\r\n* https://www.macrotrends.net/stocks/charts/GIS/general-mills/profit-margins\r\n\r\nCargill is privately held, so data is harder to come by.  But apparently their fiscal 2021 profit levels were the highest ever in their 156-year history.\r\n\r\n* https://www.bloomberg.com/news/articles/2021-08-06/crop-giant-cargill-reports-biggest-profit-in-156-year-history#xj4y7vzkg", "Multiple on multiple bird flu out breaks, combined with COVID screwing up supply chain issues. Both occuring so close together are hurting chicken and egg prices for both raw and prepared products.", "I’m guessing bird flu may have had a component to this.  Compound the loss of cheap labor and voila- expensive chicken.", "Companies made record profits during the pandemic. Calling it merely \"inflation\" is such a convenient scapegoat for them that makes it sound like they didn't use this disaster as a way to squeeze Americans even drier. \\*Some\\* of it was genuine supply chain issues (like with bird flu affecting egg production over the last couple of years) but now that supply chains have normalized and employment is recovering, prices have not dropped and wages are not reflecting the new cost of living.   \r\n\r\n\r\nMajor chains have been nakedly profiteering  via price gouging, and you don't have to look very far to see a shitload of their CEOS being dumb enough to announce it out loud with either their actions or calls to their investors. Blaming the stimulus checks is ridiculous."], "Topic 2": ["Over in Jefferson County they had an Avian Flu outbreaks in the bird colonies that nest there (Rat Island). Then it spread to marine mammals. So I'd give anything dead a wide berth just in case and report it.", "Call Seattle EHS. They actually do want to know about this stuff because Avian Flu is on the rise and they can test the bird to see why it died.", "Report sick/dead domestic birds to Washington State Department of Agriculture's Avian Health Program: 1-800-606-3056.\r\nReport online sick/dead wild birds suspected of avian flu to the Washington State Department of Fish &amp; Wildlife.\r\nYou’ll probably still have to throw it away yourself.", "There’s Sardis Raptor center out in the county. They rehab injured raptors, so eagles, hawks, owls and anything else they have room for. We took some trout out there from opening day and donated em and got to walk around and stuff.\r\n\r\nLooks like they are by appointment only due to avian flu: https://www.facebook.com/SardisRaptor?mibextid=LQQJ4d", "This is my third time trying to post this, and it keeps deleting it because I added a photo to it, so here it is without the photo.\r\nI woke up to my dogs having \"caught\" something and were pawing at it in the yard. It appeared that they had caught a crow and it didn't look alive anymore. About 25 mins later, the girls (my dogs) went wild and asked to go outside, only for me to discover that the crow was moving! Naturally I kept them inside and gaged the situation. Some crow friends came down and foraged with him trotting and bouncing around, but it was clear he couldn't fly. I did what you SHOULD NOT do, which is catch him with bare hands (due to the current avian flu), and attempted to place him high up on a tree. He rolled over and fell, flopping away from me so I gave up and began to look for wild rehab places around here. Thankfully, both Raindancer Wild Bird Rescue and Dr. Cuthbert out in Gig Harbor stepped up to help. I caught the little corvid again, and drove him to Dr. Cuthbert's, where he got (free) treatment and specialized care (we donated to his rescue).", "I would contact animal control for your county and then I would contact Dept of Fish and Wildlife. You have to document document document everything.  If that flock of ducks has Avian Flu and he's not being responsible about it, Dept Of Fish and Wildlife can encourage him to speed up the process.", "Hey y’all! Your local stranding network volunteer here! I figured since this post has gotten pretty popular, I should chime in :) \r\n\r\nSo in a situation like this, the best thing to do would be to get out of the water and away from the animal. It may just be curious, it could be feeling territorial, but regardless of the motives of the seal (and those big puppy dog eyes luring you in for a cuddle) it’s still a wild animal weighing anywhere from 200-300lbs, 5-6’ long, armed with sharp teeth and sharp claws on it’s flippers, and an infinitely better swimmer than you could ever hope to be. You don’t want to be on its bad side! Pupping season hasn’t started yet so there are no babies or juveniles out in the water, only adults. Juveniles and pups are just as much of a risk to a human, they possess the same teeth and claws, the same diseases, just in a smaller package. \r\n\r\nI can’t personally recall reports of seals harassing and injuring swimmers in Whatcom county waters off the top of my head, but a seal DID harass and [bite a swimmer](https://www.kiro7.com/news/local/very-very-rare-woman-recovering-after-being-bitten-by-seal-san-juan-islands/3VEKPLDNBZCCZLGOFPDTFQA2KI/?outputType=amp) this summer off San Juan Island. This is NOT a common occurrence by any means but it’s also something you want to avoid. \r\n\r\nIt’s absolutely not worth the risk of injury to your self or the risk of habituating the animal to human interaction. If the animal becomes too comfortable approaching humans, it puts this animal in danger. Not everyone shares the “cute water puppy” sentiment and there are some people with very strong opinions on harbor seals who will not respond kindly to being approached.\r\n\r\nThere are some VERY serious health risks involved in interacting with seals. The greatest concern is HPAI (avian influenza). This virus is present in harbor seals in Washington state &amp; is NOT something you want to catch. There’s also the very serious risk of “seal finger” - a very aggressive, difficult to treat bacterial infection that can come from seal bites or interaction with pinnipeds when you have an open wound. It can take months to treat &amp; cause permanent damage to the infected area. Here are some articles on guidelines for interaction with seals given the current HPAI outbreak &amp; info on seal finger.\r\n\r\nhttps://www.fisheries.noaa.gov/feature-story/highly-pathogenic-avian-influenza-found-seals-marrowstone-island-puget-sound\r\n\r\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2827281/\r\n\r\nUltimately - seal’s are friends, not foes, but the kind of friends we admire from a distance because they’re loud, smelly, and have a bad sense of appropriate boundaries. Maintain a minimum distance of 100yds and let wildlife remain wild! If approached by an animal, do your best to maintain that distance and if the animal continues approaching humans please call us at 360-966-8845 and we can assess the situation and make sure the animal is safe &amp; not a risk to itself or others.", "If you're finding dead birds in the yard that don't appear to be window strikes, you may want to contact the Dept of Fish &amp; Wildlife and report it. If they appear to be the same species, I would definitely call. It's entirely possible that there could be a virus in the population (avian influenza?).\r\n\r\nhttps://wdfw.wa.gov/newsroom/news-release/call-toll-free-line-report-dead-wild-birds", "&gt;\tAn outbreak of avian influenza, also known as bird flu, is impacting wild birds including Canada geese, snow geese, bald eagles, and other raptors. State officials are asking people who encounter sick or dead wild birds to alert WDFW using the agency’s [reporting tool.](https://lnks.gd/l/eyJhbGciOiJIUzI1NiJ9.eyJidWxsZXRpbl9saW5rX2lkIjoxMDEsInVyaSI6ImJwMjpjbGljayIsImJ1bGxldGluX2lkIjoiMjAyMjA2MDcuNTkwMjg3NjEiLCJ1cmwiOiJodHRwczovL3N1cnZleTEyMy5hcmNnaXMuY29tL3NoYXJlL2EzODRlOTBmNjk3NDRmMmU4NDYxMzVhOWNlODAwMjdmIn0.-46pzyB5mxn3tlwA_EX7bXYBnuWg3xqsbFMnHjxu6Rg/s/1375727226/br/132541402290-l)", "Just call them. They can also warn you about certain animals being off view due to births, introductions, bird flu, etc...", "I've been wondering the same thing this year. In the summer where I live, there would normally be a loud, beautiful cacophony of bird sounds for about a half an hour around dawn. This year, it was about a third of the volume of previous years. I've also seen less birds, and have seen birds dead on the ground with no sign that they were attacked. The bug population was also noticeably diminished.\r\n\r\nIt's only anecdotal info. My best guess is the summer droughts have taken a cumulative toll, and maybe some bird flu. I should take the time to see what studies are saying. I live in Glacier, so it's a rural spot with mainly native plant species.", "If there's a wave of Avian Influenza affecting the crows in the area probably put out a notice for people to take down their bird feeders, not to feed the crows, make sure their dogs don't go through any remains, etc.", "It does look distressed - seen a few songbirds with avian flu looking like this… but none so far this year to be honest. You can call WHS Wildlife Rehab tomorrow and they have a pretty good process - typically quarantine and nursing back to health whenever possible https://maps.app.goo.gl/dsh9nTLrpiihzqnv8?g_st=ic\r\n\r\nTreat as if sick + quarantine rules… do not bring into your home, wear gloves…etc", "The disease that prompted the advisory to take down bird feeders was salmonella being spread by a population of out of season pine siskin. This was killing many local birds who shared feeders with them. Avian flu had nothing to do with it.", "Idk about noise and I don’t care or know about pickleball. But they’re planning on cutting down 6 trees so far to make the additions. The bird population in that park is already going through a severe decimation from avian flu.", "This is sadly likely; there has been a particularly bad outbreak of avian influenza this year, with a recommended moratorium on feeding birds issued for most if not all of the year.  Crews had to go out and haul migratory bird corpses out of Wiser Lake a month or two ago because so many birds were dying.  :(", "Unless you have a tree in your landscape. Plant a baby tree in every sprinkler section and I’ll see you on the other side of the fence on Monday, 10-6 pm. We can stand on our soap box of trillions of gallons of water and argue whether the birds are more important suffering from bird flu or the bees suffering from colony collapse. We can get u/excelsiorbanjo to hold out a measuring tape and decide who’s right.", "It was closed because of the bird flu. Almost all the open aired bird exhibits were closed.\r\n\r\nThey should be opening again once they are given the all clear.", "Check and see if the tropical rainforest exhibit is open.  It was closed due to the avian flu.\r\n\r\nIf it is open it is worth going and warming up in the rainforest surrounded by birds.", "Any place that has birds will almost certainly be closed to the public because of the risk of tracking in avian influenza.", "Doesn't sound like the case in this instance based on what you described but please be advised that there are documented incidents of Highly Pathogenic Avian Influenza in birds recently here in town. More info including how to safely dispose and report incidents: https://westseattleblog.com/2022/11/west-seattle-wildlife-suspected-local-case-of-highly-pathogenic-avian-influenza-and-what-you-need-to-know-about-it/", "I just checked and didn't see any notices for our area pertaining to avian flu and taking bird feeders down. If that changes, orgs like the Seattle Audubon will make an announcement similar to the one they made last year regarding the salmonella outbreak caused by the pine siskin irruption:\r\n https://seattleaudubon.org/2021/01/20/seattle-audubon-supports-wdfw-guidance-to-limit-the-spread-of-salmonellosis/\r\n\r\nThat article is good because it also explains how to spot sick birds and what to do if you see any. If there's an announcement later about an outbreak in our area, I'll try to remember to post a link in this sub. I'm sure there are others who would do the same, too.", "I thought I saw a recent notice asking people to not refill bird feeders because avian flu is still spreading. Is that not the case?", "This is no joke. I follow a hobby farm page (not local - Knucklebump Farms in Florida) and they lost 95% of their birds to avian flu. You might know their emu, Emmanuel “don’t do it”. He is paralyzed and they are rehabbing him. It’s so tragic."], "Topic 3": ["No, not avian flu.\r\n\r\n\r\nhttps://www.seattletimes.com/seattle-news/bird-feeders-can-go-up-again-but-remain-vigilant-washington-state-officials-say/", "You want Avian Flu? Cause that’s how you get Avian Flu.", "I’m sure it’s just a coincidence that avian flu is on the rise. More like *Aviation* flu amirite", "I'd think that avian flu would make granting this birthday wish inadvisable this year.", "It’s Avian Influenza.", "Avian flu… it’s real.", "Yup, I called. They are off exhibit due to avian flu", "What companies did avian flu wipe out?", "Be curious if some of the group has altered their daily route/destination, or if they’ve gotten hit by the current Avian Flu outbreak.", "Don’t do it. I personally would appreciate it and that you’re willing to offer a space for them. But right now the problem is there’s a rampant spread of avian flu especially in WS. If you can get in touch with @kersti_muul_wildurbanity on IG, who is an expert and local.", "avian flu", "Sardis is only open to the public by appointment. The avian flu devastated them.", "Looks like avian flu is complicating things but you could reach out to Sardis Raptor Center https://m.facebook.com/SardisRaptor", "Contact the Sardis Raptor Center. I know they stopped taking volunteers at the height of the avian flu outbreak, but I haven't heard much since.", "Avian flu is going around again", "Avian Influenza is bad, but you really gotta watch out for Avian Affluenza.  Just drunk flying everywhere, knocking down neatly stacked inventory.", "Gloves. \r\nNo glove. Use a bag. \r\nDouble bag it. Garbage. \r\n\r\nFix it app if you suspect avian flu.", "I'm only finding symptoms for humans online and not for birds. Breadsticks was sneezing for weeks so if it was Avian Influenza I imagine they wouldn't be going on for weeks with it.", "What are the signs of avian influenza in birds?\r\nEarly detection of HPAI in birds is important to stopping its spread. Infected poultry, and possibly pet birds, may show one or more of the following signs:\r\n\r\nSudden death with no prior signs\r\nLow energy or appetite\r\nPurple discoloration or swelling of various body parts\r\nReduced egg production, or soft-shelled/misshapen eggs\r\nNasal discharge, coughing, or sneezing\r\nLack of coordination\r\nDiarrhea\r\n\r\n[https://www.avma.org/resources-tools/animal-health-and-welfare/animal-health/avian-influenza/avian-influenza-companion-animals](https://www.avma.org/resources-tools/animal-health-and-welfare/animal-health/avian-influenza/avian-influenza-companion-animals)", "So pooooossibly not Avian influenza. Breadsticks was sneezing a bit for 3-4 weeks (though it was occurring more frequently as time went on) but that could have been anything considering they weren't displaying the other symptoms.", "Well they were sneezing for weeks before so if it was Avian Influenza they would have died much sooner before.", "The avian flu is still going on.", "I created a monster because NOBODY wants Covid no more, they want bird flu, I'm chopped liver."], "Topic 4": ["Bird flu maybe", "Probably too young to fly well, you can try to move him but prepare to be dive bombed and watch out for bird flu", "Great timing with norovirus and bird flu.", "I think their is a bird flu going around", "...nah, the bird flu.", "Post bird flu.", "Bird flu is going around. Just saying.", "Have fun with bird flu lol", "Hope it doesn't get bird flu from its prey.\r\n\r\n:(", "Bird flu was never this bad before.", "Bird flu still having an impact I guess?", "Now there’s been one death confirmed caused by bird flu 😱.", "You can’t bring eggs over the border because of the bird flu.", "[link](https://www.reddit.com/r/economy/comments/10hsxek/high_egg_prices_should_be_investigated_us_farm/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\r\n\r\nThere is actually some questions surrounding the validity of bird flu claims.", "Hope you didn't touch it. Bird flu is jumping to mammals frequently now."], "Topic 5": ["The point is, their portrayed lack of empathy towards the human population is less likely to win the war on healthcare.  Let’s mask the hypocrisy of our politicians playing Doctor and forcing a vaccine while polio comes back, fentanyl is considered terrorism to an extent, guess was bird flu is back, square Enix is honorable enough to hold its launch date for the upcoming FF7 release, Qled TVs for 800$, listeria, and don’t even get me started on homie Jeff lol. 😆 \r\n\r\nImagine getting all those sick people in a hospital where the human-hosts are already colonized by this yeast. Guess what happens next???\r\n\r\n98 year old granny stays on life support in pain whilst family disputes the politics about who gets what. Then instead of letting granny go in peace, we’re facing some hospital staff having to avoid confrontation and being “offensive” based on an idea social media made “ideal” to what we all should look and feel. Haha 😂 then while all those beds are taken by the nearly deceased, insurance companies stop paying and surely you know they fire their hospital staff when they don’t get the answers the like. \r\n\r\nSo basically what I mean is. It is as bad as it looks, your method of trolling is unintelligible and you need to start worrying about the potential of an uncomfortable, painful imminent death.\r\n\r\nStop spreading your cancer and open your mind to something else rather than poisoning Reddit threads with your ignorance to 5 major diseases among us with a mortality rate greater than 60%. Capiscolo.??", "hate to burst your bubble, babe, but it's not that small a fraction. and the longer people pretend covid isn't a risk to EVERYONE's health, the more disabled people there will be. \r\n\r\nalso, have you happened to notice measles is having a renaissance, and tuberculosis is on the rise, and humans are starting to get bird flu? it's almost like letting a literal global pandemic continue to play out is decimating our immune systems or something...\r\n\r\ni'm sure you and everyone else who's deluded themselves into thinking they have some kind of superhuman immunity will be fine, though! you're not like other people\\~", "literally google, bro. there are lots of studies on how covid affects your body in the long-term and how it resembles hiv/aids, and i’m not going to copy/paste every one i’ve ever read. \r\n\r\nyou’re right, we’ll all continue getting exposed to it. and then we’ll all have to deal with being disabled and experiencing surges in other diseases like, measles, tb, and bird flu because our immune systems are shit.", "The problem isn't being generally courteous to others. It's people like you want to force what you think is \"empathetic\" onto everyone else. It's the authoritarian fervor that you approach a public health crisis that caused opposition. If you could justify lockdowns again, you are the type of person who would advocate for them.\r\n\r\n\r\n\r\nBelieve me, I was the first into the bunker in 2020. In hindsight, it did a lot of societal damage and should not be repeated absent something like a mutated H5N1.", "The people downvoting, you guys are absolutely fucking doomed. If you don’t care about service workers, I’m assuming you’re also not protecting yourselves. Good fuckin luck. Next is gonna be h5n1 and that’s a 50% mortality rate so maybe my downvotes will get cut in half.", "I think this was probably the 'test pandemic'  Humanization of H5N1 is probably next.  \r\n\r\nAlso, post pandemic: Why does everyone in Bellingham now drive like they are survival contestants in a Mad Max multi-player game?\r\n\r\nDid everyone forget that in real life, no one actually respawns? Was the empathic gene mutated/deleted by Covid? Or did I just grow soft?", "I mean the whole country decided disabled lives just weren't fucking worth it. Over and over. For years. \r\n\r\nGot me wishing bird flu really does have a 40% mortality rate when it jumps to human to human", "OK, let's inject some sanity because people are fucking clueless constantly apparently.\r\n\r\nhttps://www.cdc.gov/poxvirus/monkeypox/transmission.html\r\n\r\n&gt; The virus enters the body through broken skin (even if not visible), **respiratory tract**, or the mucous membranes (eyes, nose, or mouth). Animal-to-human transmission may occur by bite or scratch, bush meat preparation, direct contact with body fluids or lesion material, or indirect contact with lesion material, such as through contaminated bedding. **Human-to-human transmission is thought to occur primarily through large respiratory droplets**.\r\n\r\nMind your bodily fluid exposures, avoid contact with someone's blood, use protection with sex with strangers, wash your hands, wear a mask around strangers indoors, you'll probably be fine.\r\n\r\nThe only way this'll go badly is if the public completely ignores sensible precautions and goes crazy and the government completely mishandles the response.\r\n\r\nAlso, you should be more concerned about H5N1 anyway, even if it ends up skipping humans it's going to be a major catastrophe.", "&gt; ...\"you should be more concerned about H5N1 anyway,...\"\r\n\r\nSincerely asking, how come?", "Let's hope H5N1 doesn't take flight seeing how we dealt with that paradigm shift", "H5N1?", "Are we on H5N1 now? Seems like just yesterday it was H1N1. Oh the memories…"], "Topic 6": ["There was a dead bird at the end of my driveway that I sprayed with a shit ton of lysol before touching it. Then I put it in its own trash bag and tossed it in the trash. Not about to be spreading the bird flu and becoming patient zero of the next pandemic or something.", "This particular strain can be spread by feces, saliva, and bird snot IIRC. One example of a transmission mechanism is where a farmer or visitor to the farm steps in bird poop, leave the farm without properly disinfecting their shoes, and spread it to other properties. \r\n\r\nWA state has a video about commonly asked bird flu questions here:\r\n\r\nhttps://agr.wa.gov/departments/animals-livestock-and-pets/avian-health/avian-influenza/bird-flu-2022", "How are we ever going to have the next bird flu pandemic without piles of decaying bird poop?", "Super duper health hazard. Bird flu isn’t a joke, and coming in contact with feces from birds isn’t the best thing for anyone to touch or inhale.", "That stuff will give you bird flu… why do you think that's in our milk supply now? You need to cleanse it out with enough colloidal silver to turn you into a smurf.", "Bird flu is still very much a thing right now. Wash your birdbaths every few days with bleach.", "I still remember the one tine that PAX spread bird flu and a bunch of people got sick *and it spawned a comic and shirt and changed social norms at PAX forever*. \r\n\r\nNerds are better than this."], "Topic 7": ["H5N1 is a flu strain, and more specifically references highly pathogenic avian influenza (bird flu) which has been ripping through wild and domesticated bird populations around the world over the last few years and has hit a substantial uptick this year especially as it has migrated to the Americas, resulting in hundreds of millions of birds that have been killed by the flu or culled in an attempt to keep it from spreading.\r\n\r\nSo far this strain has been very rare in humans, with cases being limited to individuals who work closely with birds. However, it has a high mutation rate as all flu strains do, as well as being subject to standard flu strain creation mechanisms. So the worry that a strain which is as transmissible person to person as typical human flu strains are is a serious potentiality. So far this strain has a roughly 30-80% case fatality rate in humans, which is, uh, let's call it eye opening, though there's a lot of variables involved.\r\n\r\nThe bad news is that the potential for a highly transmissible in humans strain of avian influenza definitely exists and could hit the world with a pandemic problem that would make covid-19 look like a walk in the park. On top of that it's devastating many bird populations and has likely already been a major factor in the extinction of some endangered bird species. Especially it has had and will continue to have a major impact on the poultry business, which just adds to the whole mess of food production and availability that's going on globally right now. And to add to that there's the even worse news that because of the nature of how immunity is acquired for the flu as well as the rapid evolution of flu viruses vaccines just aren't terribly good.\r\n\r\nIf you asked an infectious disease expert in, say, 2018 what they were worried about in terms of the next pandemic in humans they would have told you the flu, specifically the H5N1 strain, but we ended up getting hit by a different bullet, this time.\r\n\r\nIf you've got a sinking feeling in your gut now, here comes the good news. In the last few years education and control efforts have reduced the number of human cases of H5N1 from a high of dozens of cases per year in the early 2010s to just a handful a year in the late 2010s and then to incredibly isolated incidents in the last few years. Also, spread of the flu is highly controllable by wearing a mask in public, limiting exposure, and washing your hands. Such measures are much more effective against the flu than covid, so much so that the precautions over the last two years may have resulted in a few previously circulating flu strains to go extinct. So there are effective means of control if a deadly flu strain did pop up.", "Evolution takes time. Bird flu for example was first discovered in the late 1800s and likely existed for longer but didn't make the jump to humans until 1997. I'm not saying it is or isn't covid, just that it could make sense that a virus we've only seen in one species that's newer could only just now be making the jump to another resulting in a completely unknown deadly disease.", "I don’t know.  Although animals experiencing the H5N1 avian flu disease for the past two years are definitely in a global flu pandemic.  Fingers crossed it doesn’t jump to us.\r\n\r\nThe main difference between flu and Covid is that in an average year flu kills about 386,000 people globally.      \r\nAveraged over the past 3 years, Covid has killed 8,000,000 around the world *annually*.  So it’s an order of magnitude more deadly.  \r\n\r\nAnd that’s not counting the [65 million+](https://www.nature.com/articles/s41579-022-00846-2) (*as of last January*) around the world who have long-Covid.", "&gt; Do you have sources for this? That case fatality rate is extreme!\r\n\r\nStats are on wikipedia (with sources): https://en.wikipedia.org/wiki/Influenza_A_virus_subtype_H5N1#Transmission_and_host_range\r\n\r\nThe cases are kind of all over the place so it's very hard to generalize case fatality rates, especially as the cases range over a huge diversity of countries in terms of economic and development levels. But overall fatality rates are shockingly high.\r\n\r\n&gt; &gt; \"...as well as the rapid evolution of flu viruses vaccines just aren't terribly good.\"\r\n\r\n&gt; Agreed. Due to the rate of antigentic variation, right?\r\n\r\nPartly, but it's actually much worse than that due to quirks in the human immune system which are aggravated with the flu. There's a phenomenon which has been given the name [original antigenic sin](https://en.wikipedia.org/wiki/Original_antigenic_sin) which basically results in your immune system plowing whatever furrow it previously did when it comes to tackling a particular disease or even set of diseases (though there's a lot of complexities here I'm glossing over for simplicity's sake). And this can lead to weak immunity depending on differences between the strain you first acquired immunity against and a later strain. For the flu what happens is that you end up with stronger immunity against the type of flu strain you were first exposed to, and weak immunity to certain other variations. Because your immune system can't \"lose\" against the inactivated flu virus in the vaccine it's not going to learn that it's weak immunity against a particular strain wasn't enough, it's just going to intensify that weak immunity rather than switch antigenic targets to something more effective.\r\n\r\nIn short this means that there can be a limit to how effective a flu vaccine can be for a given individual when the vaccine is based off of live or dead viruses. And this could be a reason why seasonal flu vaccines are usually only modestly effective on average. However, this might be more controllable with the magic of mRNA vaccines and other advanced vaccine technologies, but we are only just beginning to put in the work there and it may take years to pay off.\r\n\r\nSo the other good news is that potentially within the next couple of years we could see some highly effective mRNA based universal flu vaccines introduced, and these could be broadly protective against seasonal flu and new pandemic flu strains that might pop up, including H5N1 variants.", "Maybe read YOU OWN FUCKING LINK before correcting someone:\r\n\r\n&gt;Examples of **different influenza A virus subtypes** currently endemic in animals include H1N1 and H3N2 in pigs (different strains than those found in humans), H3N8 in horses, H3N2 in dogs, and H5N1 in wild water birds and domestic poultry.", "[WHO report - 18 January 2023](https://www.who.int/emergencies/disease-outbreak-news/item/2023-DON434)\r\n\r\n&gt; \"This is the first reported case of human infection caused by avian influenza A(H5) virus in the Latin America and the Caribbean region. Work is ongoing to further characterize the virus. \r\n\r\n&gt; Currently, available epidemiological and virological evidence suggests that influenza A(H5) viruses have not acquired the ability for sustained transmission among humans, thus the likelihood of human-to-human spread is low.\"\r\n\r\n&amp;\r\n\r\n&gt; \"The reported case does not change the current WHO recommendations on public health measures and surveillance of influenza.\"\r\n\r\nViruses mutate rapidly and all the time, and that is normal/expected. Antigenic variation permitting human to human transmission is a concern, but if the WHO suggests that possibility to be low with *this isolate*, then I am not immediately concerned."], "Topic 8": ["Even if you could do this in the past, it’s unlikely you wouldn’t be able to do it now due to avian flu risk. The zoo is extremely protective of their penguins’ health and have contact super locked down.", "Don't bother going to the zoo anytime soon; the elephant has TB, the Tapirs have some affliction on their feet, no Walrus, Arctic fox closed, shark/Sting ray aquarium closed, puffins and penguins are not out because threat of bird flu, and RIP Blizzard. I have mixed feelings about zoos anyway, but took my kids this week and every other exhibit is closed.", "I googled \"point defiance zoo penguin\" it came back with this helpful link https://www.pdza.org/animals/rocky-shores/penguin-point/ looks like they do have them and are currently in an off exhibit area due to a bird flu outbreak.", "Just a heads up, there’s bird flu going around.  The penguins and budgie buddies at the zoo weren’t out because of it.", "We went last week on Saturday and penguins &amp;puffins  were not out to view due to avian flu. You may want to call ahead!"]}