{"Topic 1": ["Oh definitely. The main driver of egg prices right now is the bird flu killing millions of egg laying chickens. The chickens we eat for meat are divergent enough they are not impacted by this strain  but yeah farmers are culling entire flocks because of this", "No, but they're\r\n\r\n* a common product that many or most people use\r\n* that doesn't have 100 variants (compared to a loaf of bread:  which brand?  what kind?   A \"grade A\" white egg is a \"grade A\" white egg, everywhere in the U.S.)\r\n* that's traditionally been cheap (possibly due to government subsidies?  I don't know)\r\n* and is currently far more expensive (due to inflation, poultry culls due to bird flu, probably other factors)\r\n\r\nSo they make an easily understandable barometer of the consumer economy (and pain point if you do buy a lot of eggs) for people to discuss and generally gripe about.", "Turkey burger has gone from $1.29 to $2.49 over the past 18 months.\r\n\r\nYou can't blame the retailers for the increase in prices of eggs though.  Feed prices went up, and a lot of laying flocks had to be destroyed due to avian flu.", "My educated guess? The $7.98 egg supplier has been hit by avian flu while the cheaper has not (yet). Who knows, maybe the brown eggs will match that insane price soon enough. A new food product I bought 6 weeks ago for $5.99 is now $7.99. It’s insane.", "May of 2023 specifically for eggs? Or are you talking in general for commodities across the board? Or? \r\n\r\nthe egg thing is due to avian flu", "Or, in the case of eggs, avian flu.\r\n\r\nA federal jury just found several major egg producers guilty of price fixing from 2008-2014.\r\n\r\nEverybody who thinks this started in 2008 or ended in 2014, raise their hands!\r\n\r\nNobody? Good! We're on the same page.", "Wife mentioned today eggs were around $6 for regular brands.  Looked it up and singe spring waves of bird flu have been going through wgg laying populations and those are driving up prices (along with increased fees costs and increased energy/fuel costs, and increased demand for more profits, etc).\r\n\r\nOrganics are competitive right now, but people will eventually notice the cost difference and increased demand will drive those prices up also.", "Organic eggs are surprisingly cheap right now. Avian flu &amp; increased feed prices, paired with the continued demand increased the price of standard eggs astronomically. These hasn’t impacted organic or free range as much. Once standard eggs meet the price of organic, you’ll see organic jump up too.", "The largest part of the price increase in eggs is this - \r\n\r\nhttps://www.foodsafetynews.com/2022/12/avian-flu-this-year-results-in-record-bird-kills-raising-consumer-prices-for-eggs-and-poultry/\r\n\r\n\"This year’s deadly avian flu outbreak has busted through all previous records, killing so many birds that shortages are contributing to egg and poultry price increases for U.S. consumers who are already plagued by food inflation not seen in 40 years.\r\n\r\nHere’s the situation report:\r\n\r\nThe highly pathogenic, highly contagious avian flu has led to the deaths of 52.7 million birds between February and December. That exceeds the previous record of 50 million during 2014-15.\"", "Apparently there is avian flu going around that is restricting the supply of eggs. That's probably why the price is astronomical.", "And especially since the inflation was mostly caused by higher corporate profits, high oil and wheat prices due to the Russian invasion of Ukraine, and the avian flu causing poultry and egg prices to rise.\r\n\r\nDark Brandon Rises.", "I heard grain prices due to the Russian invasion of Ukraine and avian flu are cutting into the number of chickens available to lay eggs driving up prices.", "That one to be fair is a product of the avian flu that hit the Americas. I live in England and I can still get half a dozen eggs for about $1.75 at my local store. Eggs may be the one thing we *don't* have crazy inflation on here yet, so it's interesting to see how bad it is in North America this year on that.", "It makes some sense when you think about the reason for the price increase.\r\n\r\nIt's the caged birds that are a breeding ground for viruses, and they were worst impacted by this strain of bird flu.\r\n\r\nFor your pasture raised hens, it's just business as usual.", "The 2021-2022 round of inflation was caused by:\r\n\r\n* [Corporations increasing their prices greater than their costs increased](https://www.latimes.com/business/story/2023-05-10/column-these-are-the-companies-whose-thirst-for-profits-drove-inflation-higher), generating more profits for themselves\r\n* The Russian invasion of Ukraine [increased oil prices](https://www.google.com/url?sa=i&amp;url=https%3A%2F%2Fwww.bbc.com%2Fnews%2Fbusiness-60509453&amp;psig=AOvVaw3FPuUE_CcjvyGEkZHDiAid&amp;ust=1691886017200000&amp;source=images&amp;cd=vfe&amp;opi=89978449&amp;ved=0CBAQjRxqFwoTCKClpvHs1YADFQAAAAAdAAAAABAE)\r\n* Russia and Ukraine are major wheat producers and exporters [the conflict drove global prices higher](https://www.npr.org/sections/goatsandsoda/2023/02/27/1159630215/the-russia-ukraine-wars-impact-on-food-security-1-year-later)\r\n* Increasing wheat prices pulled the prices of other grains that could be feed substitutes higher\r\n* Avian flu caused the price of poultry and eggs to go up, increasing inflation.  Prices of other protein sources were pulled up as a secondary effect."], "Topic 2": ["We have not been filling any feeders because of bird flu in the area.  I know it is primarily an issue among song birds, not sure about hummers.", "Are we supposed to be feeding birds? I know there was a warning to take down feeders because of the bird flu. Is that not an issue anymore?\r\n\r\nI haven't filled my feeders since last year because of the bird flu.", "I just managed to answer my own question. From WI DNR: [https://dnr.wisconsin.gov/topic/WildlifeHabitat/disease.htm](https://dnr.wisconsin.gov/topic/WildlifeHabitat/disease.htm)\r\n\r\n\"Based on research findings, songbirds are considered a low-risk species   \r\nfor infection when in their natural environment. At this time, we are   \r\nnot recommending that people take down their bird feeders, however, if   \r\nwaterfowl are attracted to bird feeding sites, we recommend   \r\ndiscontinuing those feeders during this HPAI event. \"", "\"Based on research findings, songbirds are considered a low-risk species for infection when in their natural environment. At this time, we are not recommending that people take down their bird feeders, however, if waterfowl are attracted to bird feeding sites, we recommend discontinuing those feeders during this HPAI event.\"\r\n\r\n\r\n\r\nhttps://dnr.wisconsin.gov/topic/WildlifeHabitat/disease.html", "Hummingbirds don’t congregate at feeders and aren’t at risk of avian flu. Also, please don’t parrot inaccurate information without checking the DNR website. The DNR is not recommending removal of bird feeders, unless it’s attracting geese and ducks. False information like this could result in starvation of early migrators that depend on human supplied food. Hummingbirds are much more likely to die from inappropriately cleaned feeders and starvation than coming into contact with seabirds, which I highly doubt are eating from hummingbird feeders.", "Due to the Avian Flu, I removed the bird feeder and emptied the bird bath.", "“House” sparrows aka English Sparrows are introduced/invasive and suck. Outcompete local species. Also, HPAI is flaring up again right now, best to keep feeders away until it’s gone.", "Didn't know that HPAI was flaring up, thanks for letting me know! Guess I'm saving on seeds for the time being!", "Bird flu spreads at feeding stations. Don’t feed the birds.", "I still would; I don't see how the existence of bird feeders would affect their behavior in a significant way. If they contract symptomatic avian flu, they contract it. There's not much you can do about that.", "**Update:** The link I found below is no longer active, but here is a link to a blog post from Madison Audubon regarding Avian Flu, bird feeders and other precautions you can take to prevent the spread.\r\n\r\n[https://madisonaudubon.org/blog/2022/avian-influenza-in-wisconsin](https://madisonaudubon.org/blog/2022/avian-influenza-in-wisconsin)", "Avian flu is what killed the Bay View eagle, please keep the feeders down for now to reduce close contact.", "AFAIK the bird flu is still spreading. Bird feeders can become a hub for that infection", "The Illinois DNR has asked everyone to put away their bird feeders and baths. Avian flu has been detected in Wisconsin too. Make sure to clean your feeders weekly."], "Topic 3": ["As the climate warms we will def be dealing with more and more tick borne illness and bird flu and all that. Better funding for public health would be neat.", "Counterpoint: avian flu is spreading from birds to mammals that portend a jump to humans. We should not be increasing the density of livestock in urban areas, especially livestock in the midst of their own pandemic. Is the risk of Madison being ground zero for an avian flu outbreak worth a couple more eggs per day?", "We aren't anti science. I've been receiving news about it since mid March when it was unknown what was the cause of disease was. The bird flu has a high morbidity but a low mortality. Causing low milk production in 2+lactation cows. The milk was thick and abnormal without a high high somatic cell count(SCC). A high SCC would indicate an infection.\r\nThere are no quarantines  between states because it's being passed by migratory birds.", "This is a crime to animals, earth and humans. Greed, greed. \r\nIt is happening here in Washington County near wetlands.\r\n Poor cows, what a life. Bird flu may take care of this. Nature has her ways.", "Bird flu has now infected dairy herds.  Bird flu has been transmitted to at least one worker on a dairy farm.  World wide more than 800 people are known to have contracted bird flu, the fatality rate for humans infected with bird flu is 52%.\r\nThe CDC is urging that people not drink unpasteurized milk, that veterinarians and people working in meat packing plants wear full protective clothing including goggles when coming in contact with the bodily fluids of cattle.  There are real health concerns about CAFO’s under normal circumstances, and even more urgent concerns with bird flu. I recently learned that farms are permitted to feed the straw used for laying hens to cattle, one potential method of transmission to dairy cattle.", "The State Legislature is completely dishonest and cannot be trusted to manage these funds. They also are only in session for a few months each year.\r\n\r\nIt's critical for state agencies to be able to quickly manage federal funds. \r\n\r\nWhat happens when there's a natural disaster and FEMA funds can't be distributed because the Legislature is not in session? What happens when there's an avian flu outbreak and DHS can't support vaccination services in the counties because the Legislature refuses to accept the money?", "No cap. My coworker wears a mask at work, we interact with a lot of customers. They said they haven't been sick in over 4 years since masks became a thing. With poor air quality, unpredictable rounds of respiratory viruses, and bird flu lowkey trending in mammals, masks are still relevant. I also know international students from countries where it's normal to mask up when air quality is bad or you/someone you live with gets sick", "I wouldn't call protective measures \"neurotic.\" The main route of transmission for COVID is via the air we breathe; however, transmission via surfaces is still possible. With most people out and about unmasked, heavy contamination of surfaces could certainly occur. Face shields provide a degree of eye protection, which is a potential route of COVID and other infectious disease transmission. Immunocompromised people exist, as do outbreaks of H5N1 avian influenza. Good handwashing/hand sanitizer is recommended even if gloves are worn, as it is difficult to remove gloves without somewhat contaminating your hands.", "The bird flu didn't start in wild birds. It came from domestic chickens in crowded factory farm environments. Putting an end to animal agriculture is the only way to stop the spread of bird flu. If you're looking for someone to blame, think about who's actually responsible for the virus. I hope you're not supporting animal agriculture after this incident.", "It wasn't the bird flu, it was a supply chain issue with the buffalo batter that happened due to COVID. Source: sister in law is a store manager"], "Topic 4": ["https://raptor.umn.edu/about-us/our-research/HPAI?fbclid=IwAR3THafJSQpwKCzVuAgZXiDmAP3pO5aGzE-0-NEf4Vf8IQRfptpEojRLxz4\r\n\r\n\r\n\r\nIf you put them up, please clean very frequently due to unknowns about bird flu. U of MN raptor center = good source of info in link!", "Bird flu\r\n\r\nhttps://www.reddit.com/r/H5N1_AvianFlu/s/brrC8sNuya", "Unless you want to keep it long term, you should either put it back where you found it or humanely kill it.\r\n\r\nNo place will take a seagull due to avian influenza. I'm sorry this isn't the answer you wanted", "If it so happened you come down with Covid’s and bird flu and the west Nile. Please consider me!", "A new deadly bird flu is infecting wild birds and may not go away  https://www.npr.org/2022/04/09/1091491202/bird-flu-2022-avian-influenza-poultry-farms", "I called and left a message, But it sounds like they cannot do anything because of Avian Flu.\r\n\r\nIt looks healthy but full of mites.\r\n\r\nThanks", "No doubt a Chinese plot to deliver new bird flu variants to the US. s/", "You mean bird flu wiped out the providers flocks.", "How asinine. It’s called bird flu, entire flocks were destroyed."], "Topic 5": ["Beyond avian flu, many facilities that raise chickens, cattle, and pork or process food have ' mysteriously ' exploded or burned down in the last 2 years.", "Im kidding i have 50+ illegally owned chickens all infected H1N1 bird flu if they spread it we will all die.", "One of my besties got her chickens culled cause a farm within 50 miles of hers got bird flu", "Avian flu plus maybe some chickens recently froze to death in outdoor chicken coops, especially in the factory farmsm", "So a coop is not the same as a run. A coop is an enclosed building with a roof and a door that shuts at night. A run is a fenced in area that is predator-proof where the chickens can be outside scratching in the dirt during the day. Ideally, to be predator proof, they are made of 1/2” square hardware cloth on the sides and top. This hardware cloth (steel) is buried about 1 foot into the ground around the run to discourage animals from digging under the fence/ This means wild birds cannot get in and share space / food with the chickens which greatly reduces risk of avian flu transmission. Most chicken owners don’t leave their run open at the top because then hawks get in and eat the chickens.", "Damn ass bird flu destroyed the fast chicken market"], "Topic 6": ["Wasn't there a bird flu going around last year? Maybe that took some out? Idunno. I just remember the zoo having their birds inside because of it.", "Oh yeah there was a bird flu, but the first year I was here there were like 15 times as many", "Interesting.  Thanks. We hunt in Catawba so stop in Medford otw up.  Always heard about the mink but thought it was just a running joke.\r\n\r\n\r\nWas gonna say I thought I recalled  them culling a year or two ago. Just looked up mink again and they’re culling more due to bird flu.", "One must be careful with bird flu still going around.", "My grandpa said they weren’t there because of the avian flu that was going through the bird population. Hopefully will be back this year!"], "Topic 7": ["You can try contacting the US Geological Survey National Wildlife Health Center (Madison WI). Use their email address: asknwhc@usgs.gov\r\n\r\nThe USGS NWHC does testing for things like avian influenza, etc. They may end up referring you first to a state based agency like WDNR or they may take information about the dead owl.", "Call first to schedule an appointment! With HPAI in Wisconsin they will need to set up an enclosure for it out of the main shelter in the barn, and find a foster to take it in. Birds are not currently allowed in the building.", "You could try WVDL. They test for bird flu. I’m not sure how they go about getting it there or if there’s an intermediate organization or something, but you could give them a call and ask.", "Yeah I heard the same thing.  This morning I actually heard that if you find dead birds on your property with no clear cause you're supposed to report them to the DNR so they can test whether it was bird flu.  So as far as I knew it's still an issue.  I haven't been feeding or filling my birdbath, either...", "From [DCHS](https://www.giveshelter.org/wildlife-center)\r\n\r\n&gt;To protect current patients from the rapidly-spreading Highly Pathogenic Avian Influenza (HPAI) Virus, DCHS’s Wildlife Center is currently NOT accepting for rehabilitation any water birds, game birds, or or adult waterfowl. As HPAI is highly contagious, it is not recommended that any member of the public interact with an animal that could be infected. Please follow the instructions below and contact the Wisconsin Department of Natural Resources right away."], "Topic 8": ["There's a huge avian flu outbreak right now so I'd be really cautious about handling wild birds that are acting oddly. It might be sick.", "I wouldn’t mess with them to much.  Bird flu is taking its toll on wild birds.\r\n\r\nThey’ll be fine, or they won’t.  Not much you can do about it", "I wouldn’t touch it, bird flu makes them pretty docile. Wild pigeons can look like that. I’d call the DNR and let them know about it.", "Humane society does avian rehab, that being said they may or may not take it because of avian flu concerns", "I’ve been seeing him there off and on for over two weeks. Morning and afternoon sightings during my commute. I hope he hasn’t been affected by the avian flu.\r\n\r\nHere’s a photo I took a couple weeks ago: https://imgur.com/a/57d9jra"], "Topic 9": ["Crexi shows the closest lease in the 500 block wants $46/sq.ft/ year, not including NNN. Others near want 29 to 31/sq.ft/y.\r\n\r\n3000sq ft... call it 100,000/y in rent.\r\n\r\nIf rent should be about 5% of gross, you need to do $2M/y gross.\r\n\r\nChicken prices shot up w h5n1, covid murdered restaurant dining in general, and let's not forget store front demolition four summers ago.\r\n\r\nI've been here since '87, business owner in the area since '96. I know nothing about these owners, but there are lease holds on State that my gut tells me predate on wishes and dreams.\r\n\r\n\"Our kid just got an MBA, they want to open another earring, bangle, 2nd hand clothes, and incense shop on State Street\"... gone in 9 months.\r\n\r\nI also know of the shifting roach herd among S.St. restaurants first hand. (20 years ago, I'm *sure* it's not a problem now.)\r\n\r\nI'm too lazy to check, but if you aren't the building owner, you just won't last long on state street unless you print money as a business.", "So you’re not using planedemic to refer to covid then but the avian flu? Because that’s the only use I’ve heard of that word.\r\n\r\nIt did just hit me really how much the prices can change and how quickly. Two weeks ago when I got groceries I paid 6.83 for a carton of 18 and this morning when I placed my order the same eggs were 4.23. I know they can manipulate prices but that seems like a massive change for such a short period of time.", "I know that.  I'm saying if it was a thing that was hurriedly added on for a week or three because food prices skyrocketed and then was eliminated again - like if avian flu made egg prices skyrocket at a breakfast-only place or something, where everything's impacted.  I understand that's \\_not\\_ how it's being used most of the time.\r\n\r\nTo me, fees are only \\_possibly\\_ legit if they're temporary or I can somehow avoid them.  If they're mandatory and/or permanent, just build them into the price and be done.", "No idea on pricing anymore, but Chicken Licks are the best wings in the county. They're closed through the 8th for a vacation.\r\n\r\nOtherwise, chicken wings are very expensive because demand is huge and bird flu slashed supplies."], "Topic 10": ["Organic/ free range is cheaper atm because their farms have been less effective by avian flu", "I prefer that my avian flu is free-range, organic, and locally sourced.", "ISO bird flu milk"], "Topic 11": ["Alright, I saw that South Park episode about Randy and the pangolin so if anyone comes down with bird flu, we’re all gonna know.", "Makes one wonder if they’ve gotten bird flu and have bird “brain fog” that slows their reaction time"], "Topic 12": ["I kinda think the extreme people wearing rubber gloves are thinking about Bird Flu more than Covid. Remember early days of covid when people would wear hazmat suits? Yeah, kinda the same attitude and likely the same people I think.", "Personally I bet it's covid they're responding to, I've seen this behavior before bird flu became a thing. Covid broke some people's brains. A small percentage continue to wear masks and gloves while walking outside, which has no basis in reality. Of course it broke people's brains in the other direction too, generating a whole new generation of anti-vax conspiracy theorists."], "Topic 13": ["Yes, factory farms will continue to exist, and we will have also increased the concentration of avian flu vectors in a population center.", "Any size flock can get avian flu. And they do. It’s not great, but something that happens every few years. The biggest predictor isn’t the number of chickens, but whether those chickens have contact with wild birds who may spread the disease. Keep the birds in an enclosed run, and you dramatically reduce the risk, regardless of flock size."], "Topic 14": ["I think what he is trying to say is that Biden invented bird flu.", "Just think, and they are feeding them CHICKEN WASTE....here comes the bird flu!!!!"]}